"""
今有登山望津，津在山南。偃矩山上，令句高一丈二尺。從句端斜望津南岸，入下股二丈三尺一寸。又望津北岸，入前望股裏一丈八寸。更登高巖北，卻行二十二步，上登五十一步，偃矩山上。更從句端斜望津南岸，入上股二丈二尺。問津廣幾何？
術曰：以句高乘下股，如上股而一。所得以句高減之，餘為法；置北行，以句高乘之，如上股而一。所得以減上登，餘以乘入股裏為實。實如法而一，即得津廣。
答曰： a里 。
"""

"""

"""


from fractions import Fraction

# 句高一丈二尺
句高 = 1 + Fraction(2, 10)

# 下股二丈三尺一寸
下股 = 2 + Fraction(3, 10) + Fraction(1, 100)

# 上股二丈二尺
上股 = 2 + Fraction(2, 10)

# 北行二十二步
北行 = 22

# 上登五十一步
上登 = 51

# 望股裏一丈八寸
望股裏 = 1 + Fraction(8, 10)

# 術曰：以句高乘下股，如上股而一
下股實 = 句高 * 下股 / 上股

# 所得以句高減之，餘為法
法 = 下股實 - 句高

# 置北行，以句高乘之，如上股而一
北行實 = (北行 * 句高) / 上股

# 所得以減上登
餘 = 北行實 - 上登

# 餘以乘入股裏為實
實 = 餘 * 望股裏

# 實如法而一，即得津廣
津廣 = 實 / 法

# 答曰：a里
a = 津廣


"""

"""


"""
Variable 'a' has wrong value. Expected: 117/50, Actual: -1170"""
