"""
今有北鄉算八千七百五十八，西鄉算七千二百三十六，南鄉算八千三百五十六，凡三鄉，發傜三百七十八人。欲以算數多少衰出之，問︰各幾何？
術曰：各置算數為列衰，副并為法，以所發傜人數乘未并者，各自為實，實如法得一人。
荅曰：北鄉遣 a人 。西鄉遣 b人 。南鄉遣 c人 。
"""

"""

"""

#----- content starts here -----

# 北鄉算八千七百五十八
北鄉算 = 8758

# 西鄉算七千二百三十六
西鄉算 = 7236

# 南鄉算八千三百五十六
南鄉算 = 8356

# 發傜三百七十八人
發傜人數 = 378

# 各置算數為列衰
算數 = [北鄉算, 西鄉算, 南鄉算]

# 副并為法
法 = sum(算數)

# 以所發傜人數乘未并者，各自為實
實 = [發傜人數 * i for i in 算數]

# 實如法得一人
北鄉遣 = Fraction(實[0], 法)
西鄉遣 = Fraction(實[1], 法)
南鄉遣 = Fraction(實[2], 法)

a = 北鄉遣
b = 西鄉遣
c = 南鄉遣
#----- content ends here -----


"""

"""


"""
"""
