"""
今有五百六十五户，共責絲八石五斤三两八銖。問：户出絲㡬何？
術曰：列絲八石五斤三两八銖，以四乘八石得三十二鈞；以三十斤乘之、納五斤，得九百六十五斤；以十六两乘之、納三两，得一萬五千四百四十三两；以二十四銖乘之、納八銖，得三十七萬六百四十銖。以五百六十五户除之，得一户六百五十六銖；以二十四銖除之，得二十七两奇八銖；以十六除之即得。
答曰： a斤 。
"""

"""

"""

#----- content starts here -----

from fractions import Fraction

# 絲八石五斤三两八銖
石 = 8
斤 = 5
两 = 3
銖 = 8

# 戶數
戶數 = 565

# 以四乘八石得三十二鈞
鈞 = 4 * 石

# 以三十斤乘之、納五斤，得九百六十五斤
斤 = 30 * 鈞 + 5

# 以十六两乘之、納三两，得一萬五千四百四十三两
两 = 16 * 斤 + 3

# 以二十四銖乘之、納八銖，得三十七萬六百四十銖
銖 = 24 * 两 + 8

# 以五百六十五户除之，得一户六百五十六銖
戶銖 = Fraction(銖, 戶數)

# 以二十四銖除之，得二十七两奇八銖
戶两 = Fraction(戶銖, 24)

# 以十六除之即得
a = Fraction(戶两, 16)
#----- content ends here -----


"""

"""


"""
"""
