"""
今有甲乙二人持錢，各不知數。甲得乙中半，可滿四十八；乙得甲大半，亦滿四十八。問：甲乙二人元持錢各幾何？
術曰：如方程求之，置二甲一乙錢九十六于右方，置二甲三乙錢一百四十四于左方，以右方二乘左方，上得四，中得六，下得二百八十八錢；以左方二乘右方，上得四，中得二，下得九十六；以右行再減左行，左上空，中餘四，以為法，下餘九十六錢，為實；上法下實，得二十四錢，為乙錢，以減右下九十六，餘七十二為實，以右上二甲為法，上法下實，得三十六為甲錢也。
答曰：甲持錢 a ，乙持錢 b 。
"""

"""

"""

#----- content starts here -----

from fractions import Fraction

# 置二甲一乙錢九十六于右方
右方_甲 = 2
右方_乙 = 1
右方_錢 = 96

# 置二甲三乙錢一百四十四于左方
左方_甲 = 2
左方_乙 = 3
左方_錢 = 144

# 以右方二乘左方
左乘右_甲 = 右方_甲 * 左方_甲
左乘右_乙 = 右方_甲 * 左方_乙
左乘右_錢 = 右方_甲 * 左方_錢

# 以左方二乘右方
右乘左_甲 = 左方_甲 * 右方_甲
右乘左_乙 = 左方_甲 * 右方_乙
右乘左_錢 = 左方_甲 * 右方_錢

# 以右行再減左行
法_乙 = 右乘左_乙 - 左乘右_乙
實_錢 = 右乘左_錢 - 左乘右_錢

# 上法下實，得乙錢
b = Fraction(實_錢, 法_乙)

# 以減右下九十六，餘七十二為實
實_甲_錢 = 右方_錢 - (右方_乙 * b)

# 以右上二甲為法，上法下實，得甲錢
a = Fraction(實_甲_錢, 右方_甲)

# 答曰：甲持錢 a ，乙持錢 b
#----- content ends here -----


"""

"""


"""
"""
