"""
今有田廣一步半、三分步之一、四分步之一、五分步之一、六分步之一。求田一畝，問︰從幾何？
術曰：下有六分，以一為一百二十，半為六十，三分之一為四十，四分之一為三十，五分之一為二十四，六分之一為二十，并之得二百九十四以為法。置田二百四十步，亦以一為一百二十乘之，為實。實如法得從步。
荅曰： a步 。
"""

"""

"""


from fractions import Fraction

# 廣一步半、三分步之一、四分步之一、五分步之一、六分步之一
廣 = 1 + Fraction(1, 2) + Fraction(1, 3) + Fraction(1, 4) + Fraction(1, 5) + Fraction(1, 6)

# 下有六分，以一為一百二十
一 = 120

# 半為六十
半 = 一 // 2

# 三分之一為四十
三分之一 = 一 // 3

# 四分之一為三十
四分之一 = 一 // 4

# 五分之一為二十四
五分之一 = 一 // 5

# 六分之一為二十
六分之一 = 一 // 6

# 并之得二百九十四以為法
法 = 半 + 三分之一 + 四分之一 + 五分之一 + 六分之一 + 一

# 置田二百四十步
田 = 240

# 亦以一為一百二十乘之，為實
實 = 田 * 一

# 實如法得從步
a = Fraction(實, 法)


"""

"""


"""
"""
