"""
今有田廣一步半、三分步之一、四分步之一、五分步之一。求田一畝，問︰從幾何？
術曰：下有五分，以一為六十，半為三十，三分之一為二十，四分之一為一十五，五分之一為一十二，并之得一百三十七，以為法。置田二百四十步，亦以一為六十乘之，為實。實如法得從步。
荅曰： a步 。
"""

"""

"""


from fractions import Fraction

# 廣一步半、三分步之一、四分步之一、五分步之一
廣 = 1 + Fraction(1, 2) + Fraction(1, 3) + Fraction(1, 4) + Fraction(1, 5)

# 下有五分，以一為六十
一 = 60

# 半為三十
半 = Fraction(1, 2) * 一

# 三分之一為二十
三分之一 = Fraction(1, 3) * 一

# 四分之一為十五
四分之一 = Fraction(1, 4) * 一

# 五分之一為十二
五分之一 = Fraction(1, 5) * 一

# 并之得一百三十七，以為法
法 = 一 + 半 + 三分之一 + 四分之一 + 五分之一

# 置田二百四十步
田 = 240

# 亦以一為六十乘之，為實
實 = 田 * 一

# 實如法得從步
a = Fraction(實, 法)


"""

"""


"""
"""
