[
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#0",
        "text": "法曰此為勾股容圓也以勾股相乗倍之為實併勾股冪以求弦復加入勾股共以為法",
        "sketch": "草曰置甲南行六百步在地以乙東行三百二十步乘之得一十九萬二千步倍之得三十八萬四千步為實以乙東行步自之得一十萬零二千四百步為勾冪以甲南行步自之得三十六萬步為股冪二冪相併得四十六萬二千四百步為弦方實以平方開之得六百八十步則弦也以弦加勾股共共得一千六百步以為法如法而一得二百四十步則城徑也合問",
        "procedure_index": 0,
        "id": "測圓海鏡_2_#0"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#1",
        "text": "法曰此為勾上容圓也以勾股相乘倍之為實併勾股冪以求弦加入股以為法",
        "sketch": "草曰置甲南行四百八十步在地以乙東行二百五十六步乘之得一十二萬二千八百八十步倍之得二十四萬五千七百六十步為實以乙東行步自之得六萬五千五百三十六步為勾冪以甲南行步自之得二十三萬零四百步為股冪勾股冪相併得二十九萬五千九百三十六步為弦方實以平方開之得五百四十四步為弦也以加入南行步共得一千零二十四步以為法而一得二百四十步則城徑合問",
        "procedure_index": 1,
        "id": "測圓海鏡_2_#1"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#2",
        "text": "法曰此為股上容圓也以勾股相乘倍之為實以勾股冪求弦加入勾以為法",
        "sketch": "草曰置甲南行三百七十五步以乙東行二百步乘之得七萬五千步倍之得一十五萬步為實以乙東行自之得四萬步為勾冪以甲南行自之得一十四萬零六百二十五步為股冪勾股冪相併得一十八萬零六百二十五步為弦方實如平方而一得四百二十五步則弦也加入乙東行二百步共得六百二十五步以為法以法除之得二百四十步則城徑也合問",
        "procedure_index": 2,
        "id": "測圓海鏡_2_#2"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#3",
        "text": "法曰此為勾股上容圓也以勾股相乘倍之為實併勾股冪如法求弦以為法",
        "sketch": "草曰以二行步相乘得三萬四千六百八十步倍之得六萬九千三百六十步為實置乙東行自之得一萬八千四百九十六步為勾冪又以甲南行自之得六萬五千零二十五步為股冪二冪相併得八萬三千五百二十一步為弦方實以平方開之得二百八十九步即弦也便以為法如法除實得二百四十步即圓城之徑也合問",
        "procedure_index": 3,
        "id": "測圓海鏡_2_#3"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#4",
        "text": "法曰此為弦上容圓也以勾股相乘倍之為實以勾股和為法",
        "sketch": "草曰以二行步相乘得六萬四千八百步倍之得一十二萬九千六百步為實併二行步得五百四十步以為法除實得二百四十步即城徑也合問",
        "procedure_index": 4,
        "id": "測圓海鏡_2_#4"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#5",
        "text": "法曰此為勾外容圓也以勾股相乘倍之為實以弦較和為法",
        "sketch": "草曰以二行步相乘得六萬九千一百二十步倍之得一十三萬八千二百四十步為實置乙東行自之得三萬六千八百六十四步為勾冪又置甲南行自之得一十二萬九千六百步為股冪二冪相併得一十六萬六千四百六十四步為弦方實以平方開之得四百零八即弦也又置甲南行步内減乙東行步餘一百六十八步即較也以較加弦共得五百七十六步以為法實如法而一得二百四十步為城徑也合問徑今必以勾股相乘倍積為實求得弦加減得弦較和為法而後始得弦較較為城徑者蓋欲因此並明勾股相乘之倍積為弦較較弦較和相乘之積非故為紆廻也",
        "procedure_index": 5,
        "id": "測圓海鏡_2_#5"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#6",
        "text": "法曰此為股外容圓也以勾股相乘倍之為實以弦較較為法",
        "sketch": "草曰二行步相乘得一萬二千倍之得二萬四千步為實以甲南行自之得二萬二千五百步為股冪又以乙東行步自之得六千四百步為勾冪勾股冪相併得二萬八千九百步為弦方實以平方開之得一百七十步即弦也以二行步相減餘七十步為勾股較也以此較又減弦餘一百步即弦較較也便以為法實如法而一得二百四十步即城徑也合問意與上題同",
        "procedure_index": 6,
        "id": "測圓海鏡_2_#6"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#7",
        "text": "法曰此為弦外容圓也勾股相乘倍之為實以弦和較為法",
        "sketch": "草曰以二行步相乘得四千三百二十步倍之得八千六百四十步為實以甲北行自之得八千一百步為股冪又以乙西行自之得二千三百零四步為勾冪併二冪得一萬零四百零四步為弦方實以平方開之得一百零二步為弦也又併二行步得一百三十八步為和以弦減和餘三十六步得黄方以為法實如法而一得二百四十步即城徑也合問",
        "procedure_index": 7,
        "id": "測圓海鏡_2_#7"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#8",
        "text": "法曰此為勾外容圓半也以勾股相乘倍之為實以大差為法",
        "sketch": "草曰以二行步相乘得九千七百二十步倍之得一萬九千四百四十步為實又以乙東行自之得五千一百八十四步為勾冪又以南行自之得一萬八千二百二十五步為股冪二冪相併得二萬三千四百零九步為弦方實以平方開之得一百五十三步即弦也以乙東行七十二步為勾以減弦餘八十一步即勾弦差也便以為法實如法而一得二百四十步即城徑也合問",
        "procedure_index": 8,
        "id": "測圓海鏡_2_#8"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#9",
        "text": "法曰此為股外容圓半也以勾股相乘倍之為實以小差為法",
        "sketch": "草曰以二行步相乘得四百八十步倍之得九百六十步為實又以乙東行自之得二百五十六步為勾冪又以甲南行自之得九百步為股冪二冪相併得一千一百五十六步為弦方實以平方開之得三十四步即弦也以甲南行三十步為股以減弦餘四步以為法以法除實得二百四十步即城徑也合問",
        "procedure_index": 9,
        "id": "測圓海鏡_2_#9"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#10",
        "text": "法曰此為半矮梯也以二行步相乘為實如平方而一得半徑",
        "sketch": "草曰以二行步相乘得一萬四千四百步為實以平方開之得一百二十步倍之即城徑也合問",
        "procedure_index": 10,
        "id": "測圓海鏡_2_#10"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#11",
        "text": "法曰以二行步相乘得數四之為實如平方而一得城徑",
        "sketch": "草曰二行步相乘得一萬四千四百步又四之得五萬七千六百步為實以平方開之得二百四十步即城徑也合問",
        "procedure_index": 11,
        "id": "測圓海鏡_2_#11"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#12",
        "text": "法曰此為兩差求黄方也以二行步相乘倍之為實以平方開得城徑",
        "sketch": "草曰二行步相乘得二萬八千八百步倍之得五萬七千六百步為實以平方開之得二百四十步即城徑也合問别得甲南行即股圓差也乙東行即勾圓差也",
        "procedure_index": 12,
        "id": "測圓海鏡_2_#12"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#13",
        "text": "法曰此當以方五斜七求之每出門二步管徑十步",
        "sketch": "草曰置出門步在地以五之得二百四十步即城徑也據此法合置出門步在地以十之二而一以二數相折故五因便是合問",
        "procedure_index": 13,
        "id": "測圓海鏡_2_#13"
    },
    {
        "source_title": "測圓海鏡",
        "source_juan": 2,
        "name": "#14",
        "text": "法曰以二行步相乗為實二行步相併為從二步常法得半徑",
        "sketch": "草曰立天元一為半徑置南行步在地内減天元半徑得□□為股圓差又置乙東行步在地内減天元得下式□□為勾圓差以勾圓差乘股圓差得丨□□(多九萬六千步)為半段黄方冪即城冪之半也(寄左)又置天元冪以倍之得□□亦為半段黄方冪與左相消得丨□□如帶縱法之得半徑合問(之數使一為步數一為方元數仍相等也如寄數内減一平方加六百八十元則得九萬六千步又數内)(亦減一平方加六百八十元則得一平方六百八十元是為一平方六百八十元與九萬六千步等故其)(式為丨□□舊稿方元數皆作斜畫以别之然遇方元數有多少異號者殊混人目今不用)",
        "procedure_index": 14,
        "id": "測圓海鏡_2_#14"
    }
]