[
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#0",
        "text": "術曰以啇功求之均輸入之倍臺上袤加下袤乗上廣為寄倍下袤加上袤乗下廣併寄乗高為土率如六而一得堅積以築工尺為法除堅積得築工以穿率乗堅積為實以堅率乗钁鍬工尺半之為鍬法除實得钁鍬共工以壤率因堅積如堅率而一為壤積求負土者先列全分及等至高諸母子以母互乗諸子為寄左行以諸母相乗為寄母次列棚道全分及所當鮮母衍子以鮮母互乗衍子為左行以鮮母相乗以乗寄得數又以列位乗之為總母以左右兩行諸子對乗之併之為總子其總母求等約之為定母子以定子乘棚道為次以定母乗平道加次义以踟蹰之數身下加之又以載輸步乗定母併次為統數以定母除統得定一返步亦為列土法置程里通步乗擔土尺有歩母則又以步母乗之為到實實如法而一得每工人到土亦為壤法以除壤積得負土工併前鍬築二工為總用工以各縣日程數約税力各得力率副併為科法以共用工乗未併者各為科實實如法而一各得縣夫求甎者倍轉道濶遍加臺上下廣袤變名上下濶長以甎厚加臺高為臺直次列甎石長濶厚各相乗為甎石積法通廣袤如法乃倍上長加下長乗上濶為寄次倍下長加上長乗濶併寄共乗直得數減土率除如六而一為泛置南北道高子各乗臺高為實如各母而一得五道諸隅高以北道高減臺餘為上停高以南道高減北道高餘為中停高命南道高為下停高以履寸除諸高得級數以上長減下長餘半之為勾以勾乗南道高為實如臺高而一得底率以底率減下長餘為底股以外道級數約底股得外道踏蹤又以底率減底股餘為中股以勾乗中停高為實如臺高而一得中率以中率減中股餘為上股以西道級除上股得西道踏蹤以勾乗上停高為實如臺高而一得中率以中率減中股餘為上股以西道級除上股得西道踏級以勾乗上停高為實如臺高而一得上率以上率併中率共減上股餘為實如裏道級而一得裏道踏蹤次以道濶併下長為補以南北道高併臺高乗補為需次上廣減下廣餘為址以址乗南道高為實以臺高除之得數減下廣餘為南道長以南長併下廣乗南道高加需又以址乗北道高為實以臺高除之得數減下廣餘為北道長以北道長併下廣乗北道高又加需共乗半道濶得數併泛為共率以基脚層數乗石版厚為基高次倍道濶併下濶乗下長為基率次以下廣乗下袤減基率餘乗基高為石率以石率減共率餘為甎率以甎積法除甎率得甎數以石級積法除石率得石版數臺圖",
        "sketch": "草曰倍上袤七丈得一十四加下袤一十七丈得三十四丈加上袤七丈得四十一乗下廣一十五丈得六百一十五併寄得七百七十乗高一十二丈得九千二百四十丈為土率以六除率一千五百四十丈以千尺通之為一百五十四萬尺堅積以築工九十尺除之得一萬七千一百一十一工九分工之一為築工次以穿率四因堅積得六百一十六萬尺為實以堅率三因钁鍬工二百尺得六百尺為法除實得一萬二百六十六工三分工之二為穿工次以壤率五因堅積得七百七十萬尺為壤積以三為母具圖如後土積圖土率堅積壤積$丈$尺$尺$讓母土工圖築上穿下$$$$$$子母子母求負土者先列全分一分之及築至高步半係三分之一中半係二分之一大半係三分之二做兩行築高分母圖$大半母$中半母$少半母$全分母$子$子$子$子上副副次下乃以右行母互乗左行子左上得一十二副位得九次得六下得一十八乃變右行名為寄子以諸母相乗得一十八為寄母具圖如後$寄母$$$$$$次以棚道全分及所當鮮母衍子三當五及三當七并二當五$$$$令分鮮母右行$$$$衍子左行上副次下乃以右行鮮母互乗左行衍子上得四十五副得四十二次得三十下得一十八為右行以鮮母相乗得一十八乃對寄左圖列之$$$鮮母$$衍子右行$$$寄母$$寄子左行乃以左右兩行母子對乗之上得五百四十副得三百七十八次得一百八十下得三百二十四母得三百二十四$乘母上副次下$$$$今以平分術入之併四子得一千四百二十二為總子以列位四乗乗母三百二十四得一千二百九十六為總母$總子$總母$定子$定母乃以總母子求等得一十八俱約之總子得七十九為定子總母得七十二為定母以定子七十九乗棚道四十步得三千一百六十於次以棚道一四十步減徃來一百六十步餘一百二十為平道以乗定七十二得八千六百四十加次共得一萬一千八百又以踟蹰十加一放身下加一得一萬二千九百八十仍於次又以載二十歩乗定母七十二得一千四百四十併次得一萬四千四百二十為統數以定母七十二除統數得二百步不盡約為一十八分步之五為定一返步乃復通分内子得三千六百五為到法乃置程里六十以三百六十通之得二萬一千六百步乗擔上一尺三寸得二萬八千八十尺以到母一十八乗之得五十萬五千四百四十尺為到實實如法除得一百四十尺不盡七百四十與法求等得五約之為七百二十一分尺之一百四十八為到土復通分内子得一十萬一千八十八又以壤母三因得三十萬二千二百六十四尺為壤法次以到土母七百二十一乗壤積七百七十萬尺得五十五億五千一百七十萬尺為壤實實如法而一得一萬八千三百六工不盡一十四萬九千二百一十六與法求等得三十二俱約之為一萬八千三百六工九千四百七十七分工之四千六百六十三為擔土工築工$子$母$築率$$母築率$$穿工$子$母$穿率$$母穿率$$擔工$通分圖$母$擔率$$母擔率$就上母就母圖次列前土工圖築一萬七千一百一十一工九分工之一及穿工一萬二百六十六工三分工之二各通分内子築率得一十五萬四千穿率得三萬八百擔率一億七千三百四十九萬六百二十五按術當以通率圖諸母互乗諸率令騐擔母九千四百七十七可用築母九約亦可用穿母三約故從省以築母九約擔母九千四百七十七得一千五十三為築率乗數又以穿母三約擔母九千四百七十七得三千一百五十九為穿率乗數各以乗數乗本率名曰就母圖乃以九千四百七十七變名曰就母先以築率一十五萬四千乗乗數一千五十三得一億六千二百一十六萬二千為築分次以穿率三萬八百乗乗率三千一百五十九得九千七百二十九萬七千二百為穿分就以擔率一億七千三百四十九萬六百二十五為擔分併三分共得四億三千二百九十四萬九千八百二十五為總工分實以就母九千四百七十七除之得四萬九千六百八十五工九千四百七十七分工之三千八十為總用功具圖如後總用工$子$母$就母$總分$置各縣日程約税力得力率副併為科法工置甲縣力一十三萬三千八百六十六以一日程為之只得此為甲率又置乙縣力二十三萬七千九百八十四以二日約得一十一萬八千九百九十二為乙率又置丙縣力三十一萬二千三百五十四以三日約得一十萬四千一百一十八為内率甲力$$乙力日$丙力$日$甲率$$乙率丙率$列三求等得一萬四千八百七十四俱約之甲得九乙得八丙得七各為定率副併得二十四具圖如後甲定率$乙定率$丙定率$併率$$乃以總分四億三千二百九十四萬九千八百二十五遍乗三縣定率為各實以就母九千四百七十七乗併率二十四為科法甲得三十八億九千六百五十四萬八千四百二十五乙得三十四億六千三百五十九萬八千六百丙得三十億三千六十四萬八千七百七十五各為實法得二十二萬七千四百四十八為科法除各實具圖如後甲實$乙實$丙實$科法$乃以科法除各實甲得一萬七千一百三十一工不盡一十三萬六千七百三十七為甲縣工乙得一萬五千二百二十八不盡二萬四百五十六為乙縣工丙得一萬三千三百二十四不盡一十三萬一千六百二十三為丙縣工諸縣不盡皆輩為一工甲合科一萬七千一百三十二工乙合科一萬五千二百二十九工丙合科一萬三千三百二十五工之一與二之一分母對乗得六分母互乗分子三之一得六之二二之一得六之三相減餘六之一得第二段分數以二之一與三之二分母對乗得六分母互乗分子二之一得三三之二得四相減餘六之一為第三段分數以三分之二與全臺三分之三相減餘三之一為第四段分數然後列四段母數於右子數於左以各分母連乗又互乗分子得三百二十四為總分母第一段一百零八第二段五十四第三段五十四第四段一百零八為各分子求等數得五十四徧約之總母得六分子第一段得二第二段得一第三段得一第四段得二為各段分母子次列棚道一當平道一為下第一段三當五為第二段三當七為第三段二當五為第四段以棚道數為分母以平道數為分子分母連乗又互乗分子得一十八為總分母第一段得一十八第二段得三十第三段得四十二第四段得四十五為各分子求等數得三徧約之總母得六分子第一段得六第二段得十第三段得一十四第四段得一十五次列前後兩分母分子各對乗得總母三十六分子第一段得一十二第二段得一十第三段得一十四第四段得三十併諸子得六十六為總子又求等得六各約之得定母六為棚道數定子一十一為平道數此即合全臺數總計凡棚道六當平道一十一也乃以定子一十一乗棚道四十步得四百四十步為次以棚道四十步減一百六十步餘一百二十步為平道以定母六乗之得七百二十步加次共得一千一百六十步以踟蹰加一於身得一千二百七十六步又以載輸二十步乗定母六得一百二十步义加次共得一千三百九十六歩為統數以定母六除之得二百三十二步又三分步之二為定一返步乃復通分内子得六百九十八為到法乃置程里六十以三百六十步通之得二萬一千六百步乗上一尺三寸得二萬八千零八十尺以到法分母三乗之得八萬四千二百四十尺為到實以到法除之得一百二十尺不盡四百八十約之為三百四十九分尺之二百四十舊名到土復到土復者一工每日所擔之堅土數也通分内子得四萬二千一百二十以壤母三因之得一十二萬六千百六十尺為壤法次以到土復母乗壤積七百七十萬尺得二十六億八千七百三十萬尺為壤實實如法而一得二萬一千二百六十七工不盡一千八百八十約之得三千一百五十九分工之四十七為擔土工次列築工穿工擔工三數及分母分子互乗以齊之列三工數各通分内子得築率一十五萬四千穿率三萬零八百擔率六千七百一十八萬二千五百驗擔母數築穿二母數皆可度盡用就母法以築母除擔母得三百五十一為築東率以穿母除擔母得一千零五十三為穿乗率各以乗率乗本率得築分五千四百零五萬四千穿分三千二百四十三萬二千四百擔率六千七百一十萬二千五百即為擔分同以擔分母為總分母乃併三分數得一億五千三百六十六萬八千九百分為實以總分母為法除之得四萬八千六百四十四工不盡二千五百零四約之不變即命為三千一百五十九分二之二千五百零四為總用工數次置三縣力役以里數遠近通之先以乙丙二里數求等得六十各約之乙得二丙得三以乙二徧乗甲丙以丙三徧乗甲乙得甲率八十萬零三千一百六十九乙率七十一萬三千九百五十二丙率六十二萬四千七百零八三率求等得八萬九千二百四十四徧約之甲得乙得八丙得七各為率併率得二十四乃以工總分一億五千三百六十六萬八千九百分乗三縣各率得甲實一十三億八千三百零二萬零一百乙實一十二億二千九百三十五萬一千二百丙實一十億零七千五百六十八萬二千三百以就母三千一百五十九乗併率二十四得七萬五千八百一十六為科法除各實不盡者各進一工得甲縣合科一萬八千二百四十二工乙縣合科一萬六千二百一十五工丙縣合科一萬四千一百八十九工求甎者倍轉道並濶六尺得一丈二尺遍加臺上下廣袤變各為上下濶長以甎厚六寸加臺高工廣$文下廣$文工闊$下闊$臺高$文臺直$上袤$文下袤$文上長$下長$先以甎長一尺二寸濶六寸厚二寸五分相乗之得一百八十寸為甎積法次列石版長五尺濶二尺厚五寸相乗得五千寸為石積法具圖如後甎長$甎闊$甎厚$甎法$石長$石闊$石厚$石法$騐得諸法皆寸乃以變各圖上下長濶直按術求率倍上長八百二十寸得一千六百四十寸加下長一千八百二十寸得三千四百六十乗上濶六百二十得二百一十四萬五千二百為寄次倍下長一千八百二十得三千六百四十加上長八百二十得四千四百六十乗下濶一千六百二十得七百二十二萬五千二百併寄得九百三十七萬四百乗臺直一千二百六寸得一百一十三億七十萬二千四百寸仍為寄乃騐土積圖土率九千二百四十丈以一百萬寸通之得九十二億四千萬寸以減寄餘二十億六千七十萬二千四百寸如六而一得三億四千三百四十五萬四百寸為泛次置南道高五分之二北道高强半係四分之三及臺原高一千二百寸具圖如後$泛$南道高母$北道高母$原臺$高子$子$$乃以南道高子二乗原臺高得二千四百寸為南寔以南道高子三乗原臺高得三千六百寸為北寔各如本母而一得四百八十寸約為四丈八尺為南道兩隅又為東外道巽隅高又為西道坤隅高所得九百寸約為九丈為北道兩隅高又為西道乾隅高又為東裏道艮隅高具圖如後兩道高$東外道與隅高$兩道乾隅高西道坤隅高$東裏艮隅高以北道高九丈減臺高一十二丈餘三丈為上停高以南道高四丈八尺減北道高九丈餘四丈二尺為中停髙命南道高四丈八尺為下停高$上停高$中停高$下停高$履級寸東裏道級西道級東外道級$$$三停高皆如履級寸而一得五十為東裏道級數得七十為西道級數得八十為東外道級數次以上長八百二十寸減下長一千八百二十寸餘一千寸以半之得五百寸為勾以乗南道高四百八十寸得二十四萬寸為實如臺高一千二百寸而一半之得一百寸為底率以率減下長一千八百二十餘一千七百二十寸為底股以外道級八十約之得二尺一寸五分為外道踏蹤又以底率一百寸減底股一千七百二十寸餘一千六百二十寸為中股乃以勾五百寸乗中停高四丈二尺得二十一萬寸為實如臺高一千二百寸而一得一百七十五寸為中率以中率減中股一千六百二十寸餘一千四百四十五寸為上股以西道級七十除上股一千四百四十五寸得二尺一寸四分寸之九為西道踏蹤又以勾五百寸乗上停高三百寸得一十五萬寸為實如臺高一千二百寸而一得一百二十五寸為上率併中率一百七十五寸得三百減上股一千四百四十五寸餘一千一百四十五寸為實如裏道級五十而一得二尺二寸九分為裏道踏蹤各得具圖以見如後東外道踏級兩道踏級東裏道踏蹤$$$$$尺$尺$子$母$尺次以道濶六尺併下長一千八百二十寸得一千八百八十寸為補以南北道高併臺高共得二千五百八十寸乗補得四百八十五萬四百寸為需次以上廣五百寸減下廣一千五百寸餘一千寸為址乗南道高四百八十寸得四十八萬寸為實以臺高一千二百寸除之得四百寸為減率以減下廣一千五百寸餘一千一百寸為南道長併下廣一千五百寸得二千六百乗南道高四百八十寸得一百二十四萬八千寸加需又以址一千寸乗北道高九百寸得九十萬寸為實亦如臺高一千二百而一得七百五十以減下廣一千五百寸餘七百五十寸為北道長併下廣一千五百得二千二百五十寸乗北道九百寸得二百二萬五千寸又加需共得八百一十二萬三千四百以半道濶三尺乗之得二億四千三百七十萬二千寸併泛三億四千三百四十五萬四百得五億八千七百一十五萬二千四百寸為共率次以基脚七層乗石版厚五寸得三十五寸為基高次倍道濶得一百二十併下濶一千六百二十寸得一千七百四十乗下長一千八百二十得二百一十六萬六千八百為基率次以下廣一千五百寸乗下袤一千七百寸得二百五十五萬減基率餘六十一萬六千八百寸乗基高三十五寸得二千一百五十八萬八千寸為石率以石率減共率餘五億六千五百五十六萬四千四百寸為甎率以甎積法一百八十寸除之得一百一十四萬二千二十四片九分片之四乃以石積法五千寸除石率二千一百五十八萬八千寸得四千三百一十七片為石版不盡三十寸棄之不輩合問",
        "procedure_index": 0,
        "id": "數書九章_7_#0"
    },
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#1",
        "text": "術曰以長乗濶又乗原日原人為實以限日乗築丈數為法除之得人夫",
        "sketch": "草曰以長二十一丈乗濶一十七丈得三百五十七丈又乗原二日得七百一十四又乗原七人得四千九百九十八為工實以限三日乗原築三丈得九為法除實得五百五十五工不盡三與法俱三約之為三分工之一為日收五百五十五工三分工之一合問",
        "procedure_index": 1,
        "id": "數書九章_7_#1"
    },
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#2",
        "text": "術曰以少廣求之置各地面深濶相乗以間數若所數乗之共為實甎長濶相乗為甎平法除得今用甎數次以甎垜高長濶相乗為實却以甎法乗厚得數為甎積法除之得毎垜甎數次以垜數乗之得見有甎以減今用甎得餘甎",
        "sketch": "草曰置堂濶五丈二尺乗深三丈得一十五萬六千寸於上又置書院深一丈五尺乗濶一丈二尺得一萬八千寸又以六間乗之得一十萬八千寸加上共得二十六萬四千寸併上又置後閤濶一丈併濶一丈五尺得二丈五尺又以各二間乗之得五百寸以乗各深一丈三尺得六萬五千寸加上得三十二萬九千寸併上次置亭基一丈四尺自乗得一萬九千六百寸以一十所乗之得一十九萬六千寸又併上共得五十二萬五千寸為實以甎長八寸乗濶四寸得三十二寸為甎平法除之得一萬六千四百六片四分片之一為共用甎次置毎垜高五尺乗濶八尺得四千寸又乗長一丈得四十萬寸為毎垜實却以甎平法三十二寸乗厚一寸只得三十二寸為甎積法除之得一萬二千五百片又以十五垜乗之得一十八萬七千五百片為見有甎内減今用甎餘有一十七萬一千九十三片四分片之三為外餘瓦數合問",
        "procedure_index": 2,
        "id": "數書九章_7_#2"
    },
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#3",
        "text": "術曰以啇功求之置城及牆上下廣各併之乘髙進位半之各得每丈積率併之為共率先以每功尺除之又以諸色工各數乘之為土功丈率次置柱木橛索乘其每條叚功得各共功次置城方一丈自之乘用甎總幅數為實以甎長乘厚為則法除實得城身用甎次置鵲臺座子肩子㡌子各髙闊長相乘為寄併之于上次箭窻眼髙依差寸求斜深虚積減寄餘為女頭甎實以則法乘甎闊為甎積法除之得女頭臺用磚又置䕶險牆髙以丈乘而半之又乘上下幅共數為實以磚闊厚相乘為法除之得䕶險牆用甎併三項用甎為都實以毎功片為法除之得甎匠功以每丈用石叚數求石匠工以搬每丈石求搬石工以片用灰數乘都甎得甎用灰以每丈石版數乘片用灰得石用灰併之為甎石共灰以每工搬灰數除之得搬灰工併諸作工為實以火頭壕寨每管人數各為法除之得各數又併之為都工然後以城圍通長偏乘諸項毎丈率積灰各工料得共數女頭圍",
        "sketch": "草曰置城上廣三丈併下廣七丈五尺得一十丈五尺乘髙三丈得三千一百五十尺進位得三萬一千五百尺半之得一萬五千七百五十尺為每丈城積率置羊馬牆闊五尺併下闊一丈得一十五尺乘髙一丈得一百五十尺進位得一千五百尺以半之得七百五十尺為羊馬牆每丈積率併城牆二率得一萬六千五百尺為共率以為實以钁鍬擔工杵手各六十尺為法除實得二百七十五工以四色因之得一千一百工為钁鍬擔土杵手工置永定柱二十條乘每條栽埋工七分得一十四工又乘串鑿工三分得六工計二十工為永定柱工置爬頭拽後木八十條乘作工三分得二十四工又乘串鑿工二分得一十六工計四十工為爬頭拽後木工置摶子木二百條乘作工二分得四十工又乘搬扛工二分得四十工計八十工為摶子木工置絍撅二千箇乘作工七毫得一十四工絍索二千條乘作工九毫得一十八工計三十二工為橛索共工乃以城牆女頭甎積求甎匠工置城身方一丈自乘一百尺于上次置下九幅中七幅上五幅併之得二十一幅乘上得二千一百尺甎長有寸以寸通之為二十一萬寸為實以甎長一十二寸乘厚二寸五分得三十寸為則法除實得七千片為城身甎數又置鵲臺髙五寸乘闊五尺四寸得二百七十寸又乘長一丈得二萬七千寸寄上又置座子髙二尺二寸五分乘闊三尺六寸得八百一十寸又乘長一丈得八萬一千寸加寄又置肩子髙一尺二寸五分乘闊三尺六寸得四百五十寸又乘長八尺四寸得三萬七千八百寸又加寄又置㡌子髙一尺五寸乘闊三尺六寸又乘長六尺六寸得三萬五千六百四十寸又加寄共得一十八萬一千四百四十寸共為寄其箭窻内外眼雖差三寸于斜深虚積将盈補虧與直深等以窻闊六寸乘長七寸五分得四十五寸又乘座闊三尺六寸得一千六百二十寸為窻積以減寄餘一十七萬九千八百二十寸為實置甎則法三十寸乘甎闊六寸得一百八十寸為甎則法除實得九百九十九片為女頭鵲臺共甎又置䕶險牆髙三尺乘每丈得三千寸以牆法當半折之得一千五百寸又乘上下五幅得七千五百寸為實次以甎厚二寸五分乘闊六寸得一十五寸為甎法除實得五百片為䕶險牆甎次併三項甎八千四百九十九片為毎丈用甎都實以每工七百片為法除實得一十二工七百分工之九十九為甎工每丈用石版十片計一工搬石十片計一工甎每片用灰一觔命都甎即甎用灰之數又置每丈用石版一十片每片用灰一十觔相乘之得一百觔為石版用灰併甎用灰八千四百九十九得八千五百九十九觔為甎石用灰數為實以毎工搬一千觔為法除之得八工一千分工之四百九十九為搬灰工并石匠搬石二工通前列土工一千一百定柱工二十爬頭拽後木工四十摶子木工八十橛索工三十二甎工一十二工七百分工之九十九搬灰八工千分工之四百九十九石匠搬石共二工併諸作工餘分不同者合分術入之共得一千二百九十四工七千分工之一千四百八十九通分内子得一百二十九萬五千四百八十九為衆工實置火頭每管六十人分母乘之得六萬為法除都工實得火頭二十一人六萬分之三萬五千四百八十九壕寨每部一百二十人就倍火頭法六萬為十二萬亦除衆工實得壕寨十人十萬分之九萬五千四百八十九列兩餘分及前諸作工餘七千分之一千四百八十九三項以合分術入之得一工不盡五十萬四十億分之三十萬二千三百六十九億四千萬分求等又約之為八十四萬分之五十萬三千九百四十九分乃又併之共得一千三百二十六工其餘分大約百分中之五十九在半以上收為一工共定得一千三百二十七工為每丈都工然後以城通長徧乘乘諸項置城長一千五百一十丈乘城率一萬五千七百五十尺得二千三百七十八萬二千五百尺為城堅積又以城長乘牆率七百五十尺得一百一十三萬二千五百尺為牆堅積併城牆二積得二千四百九十一萬五千尺又以墟率四因之得九千九百六十六萬尺為實以堅率三約得三千三百二十二萬尺為壕積以為實以壕闊三十丈併下闊二十五丈得五十五丈以半之得二百七十五尺乘壕長一千五百一十丈得四十一萬五千二百五十尺為壕法除實得八丈為壕深求工料共數如術以城通長徧乘丈率工永定柱爬頭拽後木摶子木橛子木絍索蘆蓆筀竹水竹青茅城甎石版石灰各得以共工乘日支錢米得共錢米更不立革應于先求得一丈自乘幅數再乘之二十一萬寸數内減去三層石脚之一萬三千五百寸餘一十九萬六千五百寸為甎實以甎則三十寸除之得六千五百五十觔為甎數草中即以全積為甎實故得數差多四百五十片一女頭鵲臺全積一十八萬一千四百四十寸一箭窻虚積一千六百二十寸三眼應三因之得四千八百六十寸以減全積餘一十七萬六千五百八十寸為實以一甎積一百八十寸除之得九百八十一片為甎數草中只減一眼虚積故得數差多一十八片一併城牆鵲臺䕶險牆三甎數得共用甎八千零三十一片草中差多四百六十八片一題言城脚鋪石版三層應以甎闊六寸乘九幅得五十四寸以一丈乘之得五千四百寸三因之得一萬六千二百寸為實以石之長闊相乘得一千寸為法除之得一十六片二分草中並無求法但云毎丈用石版十片差少六片二分一石每片用灰十觔甎每片用灰一觔毎丈石用灰一百六十二觔甎用灰八千零三十一觔二共用灰八千一百九十三觔草中石用灰差少六十二觔甎用灰差多四百六十八觔二共用灰差多四百零六觔一石十片二工甎七百片一工灰千觔一工每丈應用石工三工二分四釐甎工一十一工七百分工之三百三十一灰工八工千分工之一百九十三併之又併土工一千一百工定柱工二十工爬頭木工四十工摶子木工八十工橛索工三十二工共得一千二百九十四工七千分之六千三百四十一草中分子為一千四百八十九差少四千八百五十二分一求大頭工應以共工分母通工數内子為實以分母通所受六十人為法除實得火頭二十一工又一十四萬分工之八萬一千四百四十七草中誤以千分通之故分母子數不合求壕寨應仍用前實以分母七千通所管一百二十人為法除實得壕寨十工又二十八萬分之二十二萬一千四百四十七草中同前誤分母子數不合一前共工火頭壕寨三分數通而併之得二工又二十八萬分之七萬七千九百八十一然後總併之得一千三百二十七工又二十八萬分工之七萬七千九百八十一其分子不及分母十之三棄之即以一千三百二十七工為定數草中分子僅進一工餘數及十之六又進一工故所得定工數亦同一共用石版二萬四千四百六十二觔答數内差少九千三百六十二觔一共用甎一千二百一十二萬六千八百一十觔答數内差多七萬零六百六十八觔一共用灰一千二百三十七萬一千四百三十觔答數内差多六十一萬三千六十觔右十餘條皆依舊草正其舛訛至立法之疎密未暇論也",
        "procedure_index": 3,
        "id": "數書九章_7_#3"
    },
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#4",
        "text": "術曰以啇功求之置牆髙乘長得寸為實以甎闊乘厚為法除之得用甎及用灰以處數並乘諸工料得總用工料",
        "sketch": "草曰置牆髙四尺通為四十寸置長三丈通為三百寸相乘得一萬二千寸為實以甎闊六寸乗厚二寸五分得一十五寸為法除之得八百片為牆甎又為灰并四八甎灰三千觔共灰三千八百觔乃以六十處徧乗總用工料卧牛木搭腦木㸔壕柱副壕柱挂甲柱虎蹲柱仰板木平板木串挂枋木四八甎城甎石灰紙觔中板瓦一尺釘八寸釘五寸釘四寸釘釘環工數各項總數在前計造石壩",
        "procedure_index": 4,
        "id": "數書九章_7_#4"
    },
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#5",
        "text": "術曰以啇功求之招法入之置層髙尺數乗靣闊及長為初率次以差闊尺數乗髙又乗長為次率却以石版長闊厚相乗為法以除二率各得石版為上積及次積置深以層髙尺數約之得層數對二積列之一行各添一撥天地數各以累乗對約之得乗率以對上次積併之為石版以每觔用灰乗石為灰數以匠工片數約版得石匠以搬夫數乗石版為實以扛片數為法除之得人數以搬用灰數除灰得人數併諸工以火頭管數約之為火頭半之為部押石壩圖",
        "sketch": "草曰置層髙二尺靣闊三丈相乘得六十尺又乘長三十又得一萬八千尺為初率次以差闊一尺乘髙二尺又乘長三十丈得六百尺為次率却以石版長五尺闊二尺厚五寸相乘得五尺為法以除二率得三千六百片為初積一百二十片為次積列右行置深四丈二尺以每層二尺約之得二十一層乘初積三千六百片得七萬五千六百片于上次置二十一層減一餘二十以乘二十一層得四百二十半之得二百一十乗次積一百二十觔得二萬五千二百片加入上共得一十萬八百片為石版數次置二十一層減去一餘二十以差闊一尺乗之得二丈併上闊三丈共得五丈為下闊之數又置石一十萬八百片以每工九約得一萬一千二百置石版數以搬扛四人乗之得四十萬三千二百為實以五片為法除之得八萬六百四十工又置石版數以每片用灰一十觔乗之得一百萬八千觔為灰實以毎人擔用一百一十觔約之得九千一百六十三工一十一分工之七為灰工于上又併石版工一萬一千二百及併搬扛工八萬六百四十工加上共得一十萬一千三工一十一分工之七通分内子得一百一十一萬一千四十為實置火頭每名管六十工以乗分母一十一得六百六十為法除實得一千六百八十三工不盡二百六十與法約之為三十三分工之一十三為火頭工數半之得八百四十一工三十三分工之二十三為部押壕寨數今衆工下十一分工之七以母十一除火頭分母三十三得三以三因衆工下母子為一十萬一千三工三十分工之二十一併三項母子得一十萬三千五百二十九工分子五十七滿母三十三收一工餘二十四與母各三約為十一分工之八為共用一十萬三千五百二十八工十一分工之八$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
        "procedure_index": 5,
        "id": "數書九章_7_#5"
    },
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#6",
        "text": "術曰以啇功求之置里通歩作尺為積率併諸縣人數為均法法與率可約者約之以科率各乗先到人為實皆法而一各得先築里歩為先賦埂長續到人合賦功凖此求之",
        "sketch": "草曰置三十六里五分以里法三百六十歩通之得一萬三千一百四十歩又以歩五尺乗之得六萬五千七百尺為長率併甲乙丙丁縣四縣合科人得七千七百二十為均法合法與率可求等得二十以約之率得三千二百八十五法得三百八十六以長率三千二百八十五尺乗甲縣先到人一千五百四十四夫得五百七萬二千四十人為甲實實如法三百八十六而一得一萬三千一百四十尺以歩五尺約之得二千六百二十八歩為甲縣先到人所築積歩又以長率三千二百八十五乗丙縣先到人九百六十五夫得三百一十七萬二十五尺為丙實實如法三百八十六而一得八千二百一十二尺五寸以歩法五尺約之得一千六百四十二歩半為丙縣先到人所築歩",
        "procedure_index": 6,
        "id": "數書九章_7_#6"
    },
    {
        "source_title": "數書九章",
        "source_juan": 7,
        "name": "#7",
        "text": "術曰以啇功求之併河上下廣于上併河上下流深乗之又以長乗為實以四為法除得河積以堅率乗河積為實以墟率為法除得堤積併堤上下廣乗堤長半之為法除堤積得堤髙併河堤二積以棚道母半之副置以棚道減工子乗之以棚道減工母除之得數以併其副共為寄以子減母餘乗常尺為増子以母乗常尺為増分併増分増子乗寄倍為用工實以増分乗増子又乗限月日為法除實得用人工數",
        "sketch": "草曰置河上廣六丈併底廣四丈通之折半得五十尺于上又置河上流深八尺併下流深一丈六尺併之折半得一十二尺以乗上數得六百尺為次置長四十八里以尺里法二千一百六十通之得一十萬三千六百八十尺得堤河長以乗次得六千二百二十萬八千尺為河積以堅率三因河積得一億八千六百六十二萬四千尺為實以穿率四為法除之得四千六百六十五萬六千尺為堤積置上廣一丈八尺下廣二丈四尺併之為四十二尺以乗堤長一十萬三千六百八十尺得四百三十五萬四千五百六十尺以半之得二百一十七萬七千二百八十尺為法除堤積得二十一尺為堤髙不盡九十三萬三千一百二十與法求等得三十一萬一千四十俱約之為七分尺之三次置河積六千二百二十萬八十尺併堤積四千六百六十五萬六千尺得一億八百八十六萬四千尺以棚道築至半是二除之得五千四百四十三萬二千尺副之先以減工之子一乗之只得此數為實乃後以減工母五為法除之得一千八十八萬六千四百尺併副五千四百四十三萬二千尺共得六千五百三十一萬八千四百尺為寄以折減工五分之一以子一減母五餘四以乗常尺六十得二百四十尺為増子以母五乗常尺六十得三百尺為増分以二増併之得五百四十乗寄得三百五十二億七千一百九十三萬六千尺以半之得一百七十億三千五百九十六萬八千尺為用工實得八千一百六十四為每日人工數不盡一百七十二萬八千與法求等四十三萬二千俱約之為五分工之四得每日用工八千一百六十四工五分工之四復通分内子得四萬七百二十四以三十日乗之得一百二十二萬一千七百二十為寔仍以母五約之得二十四萬四千三百四十四工為共用工合問",
        "procedure_index": 7,
        "id": "數書九章_7_#7"
    }
]