[
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#0",
        "text": "術曰商功求之堆積入之倍中靣副置減一以乘其副得數半之為原木副置上層減一以乘其副得數半之用減原木餘為見存",
        "sketch": "草曰倍中靣九條得一十八副置減一餘一十七以乘副一十八得三百六條以半之得一百五十三條為原木之數副置中靣九條減一餘八以乘副九得七十二以半之得三十六以減原木一百五十三餘一百一十七條為見存木數合問",
        "procedure_index": 0,
        "id": "數書九章_9_#0"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#1",
        "text": "術曰以方田及圓率求之置原束差併竹外圍竹數以乘外圍又乘把數為竹實倍圓束差為竹法除之各得二竹數皆以把數為心加入各得竹條數置蘆圍尺數自乘以乘蘆束為蘆實以蘆原尺數自乘為蘆法除實得所凖蘆束數",
        "sketch": "草曰置圍束差六併筀竹外圍三十六竿得四十二竿以乘外圍三十六竿得一千五百一十二竿又乘筀竹一千一百五十一把得一百七十四萬三百一十二竿為筀竹實倍圓束差六得一十二為竹法除實得一十四萬五千二十六竿以把數一千一百五十一併之得一十四萬六千一百七十七竿為筀竹又置原差六併水竹外圍四十二竿得四十八竿以乘水外圍四十二竿得二千一十六竿又乘水竹一千二百二十三把得二百四十六萬五千五百六十八竿為水竹實亦以竹法一十二除之得二十萬五千四百六十四竿以水竹把數一千二百二十三併之得二十萬六千六百八十七竿為水竹數次置蘆圍五尺通為五十寸以自乘得二千五百寸又乘蘆束數三千六十五得七百六十六萬二千五百寸為蘆實以原様蘆圍五尺五寸亦通為五十五寸以自乗得三千二十五寸為蘆法除實得二千五百三十三束不盡一百七十五寸與法求等得二十五俱以約之得一百二十一分束之七為蘆二千五百三十三束一百二十一分束之七合問",
        "procedure_index": 1,
        "id": "數書九章_9_#1"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#2",
        "text": "術曰啇功求之置厫并屋深濶米高相乗併之為實如斛法而一",
        "sketch": "草曰先以厫深三丈通為三十尺乗濶十五尺得四百五十尺又乗高一十二尺得五千四百尺以乗五十厫得二十七萬尺為實以斛法二尺五寸除之得一十萬八千石為倉五寸厫共容米次置寺屋深二十五尺乗濶一十二尺得三百尺乗米高一十尺得三千尺以二十五間乗之得七萬五千尺於上次置深三十尺乗濶一十三尺得三百九十尺又乗米高十十二尺得四千六百八十尺以乗一十五間得七萬二百尺加上共得一十四萬五千二百尺以斛法二尺五寸除之得五萬八千八十石為寺屋四十間共容米以併厫米共得一十六萬六千八十石為共和糴到米",
        "procedure_index": 2,
        "id": "數書九章_9_#2"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#3",
        "text": "術曰以啇功及少廣求之置出斗上下方相乗之又各自乗併之乗深又以五斗乗之為積于上求方斛先自如意立數為斛深又如意立數為底方置深為從隅以底方乗隅為從方又以底乗從方為減率以減上積餘為實開連枝平方得方斛口方不盡以所得數為基增損求之以口底方相乗又各自求併之為法除前上積得深餘分収棄之求圖斛置四數以因前積為寄如意立數為斛深别如意立數為底徑以三因深為從隅以底徑乗隅為從方以底徑乗從方為減率以減寄餘為實開連枝平方得口徑不盡以所得數為基如意求差以口底徑相乗又各自乗併之為法除寄得深餘分収棄之求囤米置各囤上徑下徑相乗又各自乗併之乗高又乗囤數所得之數為積併之為共積如四而一為實以斛求之得米",
        "sketch": "草曰置出租斗口方九寸六分與底方七寸相乗得六十七寸二分於上又於口方九寸六分自乗之得九十二寸一分六厘加上又以底方七寸自乗得四十九寸又加上共得二百八寸三分六厘乗深四寸得八百三十三寸四分四厘又以五斗乗之得四千一百六十七寸二分為三叚斛積于上求方斛如意立一尺六寸為斛深又加意立一尺二寸為斛底以深一十六寸為從隅以底一十二寸乗隅得一百九十二寸為從方又以底一十二寸乗從方一百九十二寸得二千三百四寸為減率以減上積四千一百六十七寸二分餘一千八百六十三寸二分為實開連枝平方得六寸三分五厘為基其積不及一寸一分六厘係有虧數其基數為米可用湏合損益基數今益作六寸四分為口方以原立一尺二寸為底方以口方乗底方得七十六寸八分以上又以口方六寸四分自乗得四十寸九分六厘又以底方十二寸自乗得一百四十四寸併以上共得二百六十一寸七分六厘為法以除前積四千一百六十七寸二分得一尺五寸九分二厘為方斛深其積不及一厘九毫二絲収為閏又累増至一十寸為口方仍以一十二寸為底方乃以口方一十寸乗底方一十二寸得一百二十寸於上又口方自乗得一百寸加上又以底方自乗得一百四十四寸又加上共得三百六十四寸為法亦除前實積四千一百六十七寸二分得一十一寸四分五厘為方斛深其積不及六分収為閏此是求出両等斛數在人擇而用之求圓斛置四數以因前積四千一百六十七寸二分得一萬六千六百六十八寸八分為寄如意立一尺二寸為圓斛深又如意立一尺為底徑以三因深得三十六寸為從隅以底一十寸乗隅得三百六十寸為從方又以底一十寸乗從方得三千六百寸為减率以減寄一萬六千六百六十八寸八分餘一萬三千六十八寸八分為實開連枝平方得一尺四寸七分為基其實不及二寸四分四厘収為閏次以原立底徑一尺併基一尺四寸七分得二尺四寸七分只減七分為差以餘三尺四寸以半之得一尺二寸為底徑以差七分併底徑得一尺二寸七分為口徑始以口徑一尺二寸七分乗底徑一尺二寸得一百五十二寸四分於上次以口徑自乗得一百六十一寸二分九厘加上又以底徑自乗得一百四十四寸又加上共得四百五十七寸六分九厘以三因之得一千三百七十三寸七厘為法除前寄一萬六千六百六十八寸八分得一尺二寸一分四厘為圓斛正深其實不及二毫六絲九忽八微収為閏又以基一尺四寸七分增三分得一尺五寸併底徑一尺得二尺五寸減一寸為差餘二尺四寸以半之得一尺二寸為底徑以差一寸併底徑一尺二寸得一尺三寸為口徑始以口徑一十三寸乗底徑一尺二寸得一百五十六寸於上又以口徑一十三寸自乗得一百六十九寸加上又以底徑一十二寸自乗得一百四十四寸又加上共得四百六十九寸以三因之得一千四百七寸為法除前寄一萬六千六百六十八寸八分得一尺一寸八分四厘七毫為圓斛深寄餘七厘一毫却収深七毫作一厘通得一尺一寸八分五厘為圓斛深此是求出両等圓斛在人擇而用之求囤米置大囤上徑一丈通為百寸乗下徑九十寸得九千於上又以上徑自乗得一萬寸加上又以下徑九十寸自乗得八千一百寸加上共得二萬七千一百寸乗高一百二十寸得三百二十五萬二千寸又乗大囤一十二個得三千九百二萬四千寸為寄次置小囤上徑九十寸下徑八十寸相乗得七千二百寸於次又上徑自乗得八千一百寸加次又下徑自乗得六千四百寸加次共得二萬一千七百寸又乗高一百寸得二百一十七萬寸又乗小囤一十三箇得二千八百二十一萬寸併寄共得六千七百二十三萬四千寸為實倍前斛積四千一百六十七寸二分為法除之得八千六十七石四升七合四勺一抄四撮口方$出斗寸底方$寸正深$出斗為率上中下上得$寸口方$寸$底方寸中乘下得上上副得次下口方$口方$以併上$寸$寸$$寸上併副得次下次乘下得$寸$寸底方$寸底方$寸副以併上上得副次下上積副得次$寸深$寸得$寸$斗次乘下得斛積斛積$母$如意寸斛深斛底方$$寸如意立此二數上副次下減積$寸底方$寸從方$底隅$副乘次得上之減積數實寸$從方$從隅$方隅皆不可超進乃約實置商六寸商留存$實守$從方$得隅約實至首商六寸生隅入方尊寸$實$方$隅$以方命商除實商寸$實$方$隅$又以商生隅入方商寸$實$方$隅$方一退隅再退商寸$實$方$隅$約實續商三分以續商生隅八分商寸$實$方$隅$以方命續商除實商寸$寸$寸$隅$以續商又生隅入方商寸$實$方$隅$方一退隅再退商寸$實$方$隅$約實又續商五厘商寸$實$方$隅$以續商生隅入方商寸$實$不辱$方$隅$以續商命方除實益$益厘$基$原底寸$造斛盡無厘又益厘為分基乘底得後上上副次副次基自乘得基基下工下相併得$$$後圓上數上副次下底方自乘得底$底方$$$方冪併上為法實寸$法$實如法除之得泛深得深之自基數變至此除得寸方口寸冪加一尺五寸九分二厘$$$為深尚在如意數十六寸以下故累加口方又求口方寸$口方寸$口方寸$底方寸$累加得口方自乘得後圓上方乘底方得後圓副副次下上併副得後圓副寸$寸$底$底$底自乘得後圓上上副次上併副得次為法$$法$商寸$實$法$以法除前斛積圓內實得商為斛深深兩等斛深寸$寸$方斛一隻口方寸$深寸$底方寸$荅數方斛又一隻口方寸口$深寸$底方寸$荅數求圓斛因數$前積寸$奇寸$因數乘前積為寄常用如意如意寸因率乘如意因率$深寸$底徑$深數為從隅從隅$$底從隅乘如意底數為從方從方寸$$底從方乘底為減積減積$寸率圓寄$以減積損圓奇得寸實實寸$從方$寸從隅$進退開除得商商寸$實$不及$方$隅$益不及以此就商為基口徑底$底徑$寸口底和$如意$寸基併底為和如意差減和得除餘寸$半法$底徑$寸$差半餘為底徑差併底徑為口徑上$寸底徑$口徑$寸口底相乘得上上$寸口冪$寸口徑$口徑$口徑自乘得口冪口冪併上得後上上$寸底冪$寸底徑$底徑$底得自乘得底冪底冪併上得後上$寸圓率$法$三因上得法圓寄$寸法$寸法除實得商商$寸餘實$寸法$寸法退續商商$寸餘實$寸不及$寸法$寸實不及收就續商四為斛深斛深$基$寸如意$口徑寸$寸如意益分入基為口徑如意$寸和$寸底徑$寸口徑$寸底徑併口徑為和如意立差損和得餘餘$寸半法$得中$寸差$寸半餘得中以差併中為口徑上$寸口徑$寸底徑$寸口底相乘得上上$寸併上$寸口徑$寸口徑$寸口徑自乘得併加上上$寸併上$寸底徑$寸底徑$寸底徑自乘得併又加上併得寸$因率$法$三因得數為法圓徑寸$法寸$以法除圓寄相商商寸$餘$厘寸法$餘釐棄之商寸$寸收$圓斛深$寸收餘毫得斛深圓斛一隻口徑$寸深寸$底徑寸$答數圓斛又一隻口徑$寸$深寸$底徑寸答數圓上寸$圓下寸$商下徑相乘得後上上寸$下徑冪$寸下徑寸$上徑寸$上徑自乘為徑冪併上得得上上寸$下徑冪$下徑寸$上徑寸$下徑自乘為徑冪併上得後上上得寸$圓高寸$次得寸$囤數上乘囤高得得次次乘囤數後後寄寄寸$上徑寸$下徑寸$小囤上下徑相乘得後上上寸$副得$寸上徑$寸上徑$寸上徑自乘得副以副併上得後上上寸副得寸下徑寸下徑寸下徑自乘得$$$$副併上得後上上副次下以上乘副得次$$$$次乘下得後上上得寸寄寸實寸上併寄為實$$$斛積$寸$二因斛為法商石$實寸$法寸$法除實得商大小二十五圓乘總數其商即囤米商$不及$寸法$方圓四斛皆同得此數",
        "procedure_index": 3,
        "id": "數書九章_9_#3"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#4",
        "text": "術曰以粟米求之置積日乘息分數增三百為法以三百乘共錢為寔寔如法而一得本",
        "sketch": "草曰置前年頭臘月半係四十五日并去年三百六十又加今年五十九日共得四百六十四日為積日乘息二分二釐得一百二十文八釐增三百文得四百二文八釐為法以三百文乘共錢一百六十貫八百三十二文得四萬八千二百四十九貫六百文為寔如法而一得一百二十貫文為原本",
        "procedure_index": 4,
        "id": "數書九章_9_#4"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#5",
        "text": "術曰以商功求之率變入之置糴本牙錢牽錢相乘為寔以牽米為隅開連枝立方得石價以價除本得糴到米以牙錢乘米得縂牙錢以價除之得牙米以牽錢乘牙米得共牽錢",
        "sketch": "草曰置糴本三百萬貫乘牙錢三十文得九千萬貫文乘牽錢八百文得七百二十億萬貫為價寔置牽米四石六斗八合於寔數零文之下為立方從隅起歩歩法常超二位每超一度商進之今隅凡超四度當於寔上約定首商二十貫乃以商生隅超四石六斗八合得九十二貫一百六十文乃以為亷又以商生亷得一百八十四萬三千二百貫為方乃以方命上商二十貫除寔訖寔餘三百五十一億三千六百萬貫復以商生隅四石六斗八合入亷得一百八十四貫三百二十文又以商生亷加入方内得五百五十二萬九千六百貫為方法復以商又生隅四石六斗八合加入亷得二百七十六貫四百八十文為亷法其方法一退亷法二退從隅三退乃於首商之次約寔續商五貫以續商生隅四石六斗八合入亷得二百九十九貫五百二十文又以續商生亷入方得七百二萬七千二百貫乃命續商五貫除寔適盡所得二十五貫為毎石米價以為法以糴本三百萬貫為寔寔如法而一得一十二萬石為糴到米數以米數乘牙錢三十得三千六百貫為牙錢以石價二十五貫除牙錢三千六百貫文得一百四十四石為糴埸量米折牙錢以牽錢八百乘牙米一百四十四石得一百一十五貫二百文為牽頭得牙人所與牽錢之數以石價二十五貫文約牽錢一百一十五貫二百文得四石六斗八合為牽米折錢合問",
        "procedure_index": 5,
        "id": "數書九章_9_#5"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#6",
        "text": "術曰以盈朏變法求之置原本以息數退位乗歸本位每出共納累得月數以末後不及數為足月錢數",
        "sketch": "草曰置本五十萬貫以六釐五毫乘之入共本内得五十三萬二千五百貫文内减初月一十萬餘四十三萬二千五百貫文又以六釐五毫乘之餘本内得四十六萬六百一十二貫五百文又减次月一十萬貫餘三十六萬六百一十二貫五百文又以六釐五毫乘之入餘本内得三十八萬四千五十二貫三百一十二文五分又减第三月錢一十萬貫文餘二十八萬四千五十二貫三百一十二文五分又以六釐五毫乘之得三十萬二千五百一十五貫七百一十二文八分一釐二毫五絲内减第四月錢一十萬貫餘二十萬二千五百一十五貫七百一十二文二分一釐二毫五絲又以六釐五毫乘之入餘本内得二十一萬五千六百七十九貫二百三十四文一分四釐五毫三絲一忽二微五塵内减第五月錢一十萬貫餘一十一萬五千六百七十九貫二百三十四文一分四釐五毫三絲一忽二微五塵又以六釐五毫乘之入餘本内得一十二萬三千一百九十八貫三百八十四文三分六釐四毫七絲五忽七微八塵一沙二𣺌五莾减第六月錢一十萬貫餘二萬三千一百九十八貫三百八十四文三分六釐四毫七絲五忽七微八塵一沙二𣺌五莾又以六釐五毫乘之入餘本内得二萬四千七百六貫二百七十九文三分四釐八毫四絲六忽七微無塵七沙無𣺌三莾一輕二清五烟為第七月納足本息畸錢",
        "procedure_index": 6,
        "id": "數書九章_9_#6"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#7",
        "text": "術曰以方程求之衰分入之正負入之置共錢以人數約之得數列入人數各為行積次置諸色各物數為叚子對本色有分者通之可約者約之為定率以第一行為右以第二行為副以第三行為次第四行為左每以下位互遍乘之每騐其積以少减多如同名相减異名相加正無人負之負無人正之如同名相加異名相减正無人正之負無人負之得一叚為法以餘積為寔除之各得諸價以諸價列右行以各物數列左行以兩行對乘各得本率以諸色求等約之得列衰併諸衰為總法以列衰遍乘各物諸數各為寔諸寔並如總法而一各得其物除不盡者以觔兩通而除之或又分母命之",
        "sketch": "草曰置估值四十二萬四千貫以四人約之得一十萬六千貫為各積以人數列四位次置甲金二百兩於右上以四袋乘鈔一十道得四十袋於右副為右行次置乙鈔八十八道以三袋乘之得鹽二百六十四袋及銀八百兩為副行次置丙銀一千六百七十兩度牒一十五道為次行次置丁度牒五十二道金五十八兩八銖為左行驗得首圖左行上叚金帶八銖是三分兩之一乃以分母遍乘左行諸數只以分子一内入左上金内其左積得三十一萬八千貫左金得一百七十五兩左度牒得一百五十六道為次圖驗次圖四行皆可求等右行求得四十約之副行求得八約之次行求得五約之左行求得一約之各得數為定率圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$定率圖右積得二千六百五十貫金五兩鹽一袋副積得一萬三千二百五十貫鹽三十三袋銀一百兩次積得二萬一千二百貫銀三百三十四兩度牒三道左積得三十一萬八千貫金一百七十五兩度牒一百五十六道乃以定圖次行度牒三因左行左積得九十五萬四千貫金五百二十五兩度牒四百六十八道次以定圖左下度牒一百五十六乗次行積得三百三十萬七千二百貫銀五萬二千一百四兩定率圖維圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$乃驗維圖左及次行之下度牒等當相減之以積為端當以左之少積減次之多積按術曰同名相減其次行之金空而左行之金五百二十五兩有為正次空為無按術曰正無人負之即以左行之金正加入次行金位為負名成音圖仍置定圖左行諸數乃驗音圖次行積得二百三十五萬三千二百貫正金五百二十五兩負銀五萬二千一百四兩為正餘三行皆正音圖駁圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$今驗音次行之負金當以右行之正金補之而其數不等先以右金五約次金五百二十五得一百五以乗音圖右行畢其右積得二十七萬八千二百五十貫金二百五十五兩正鹽一百五袋正其副次左三行如音圖故乃成爻圖今視爻圖右行之金正與次行之金負適等即用右行直加次行按術以同名相加乃以右之金正減其次之金負為空按術以異名相減之其次鹽空為無人按術以正無人正之乃以爻圖右積二十七萬八千二百五十貫加次積二百三十五萬三千二百貫内得二百六十三萬一千四百五十貫其次金空次鹽一百五袋正次銀五萬二千一百四兩正仍置定圖右行數而成政圖政圖卜圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$今視政圖從者乃擇其諸行本色可求等首金可鹽亦可盖金多鹽少乃以政圖副次兩行鹽數三十三與一百五求等得三故以三約三十三得一十一以乗次行又以三約一百五得三十五以乗副行畢其副積得四十六萬三千七百五十貫鹽一千一百五十五袋銀三千五百兩次積二千八百九十四萬五千九百五十貫鹽一千一百五十五袋銀五十七萬三千一百四十四兩皆正列成卜圖宫圖$$$$$$$$$$$$$$$$$$$$及視上圖副行積少次行積多即以副行求減次行皆是同名相減之既畢仍置定圖副行數其次行乃得積二千八百四十八萬二千二百貫銀得五十六萬九千六百四十四兩列為宫圖驗宫圖次行下只有銀五十六萬九千六百四十四兩獨一數以為法以次積二千八百四十八萬二千二百貫為寔寔如法而一得五十貫為銀一兩價而成千圖千圖$$$$$$$$$$$$$$$$$$$$乃以千圖副行銀一百兩乗兩價五十貫得五千貫以減千圖副行之積一萬三千二百五十貫訖副積餘八千二百五十貫其下鹽得三十三袋銀空而成曜圖曜圖支圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$乃以曜圖副行之積八千二百五十貫為鹽寔以其下鹽三十三袋為法除之得二百五十貫為鹽一袋價而成支圖乃以支圖右行鹽一袋徧乗副行畢其副積只得二百五十貫次以副行直減右行畢右積餘二千四百貫金五兩鹽空而成閏圖乃以閏圖右積二千四百貫為寔金五兩為法除之得四百八十貫為金一兩價成定圖次以左金一百七十五兩徧乗右行直減左行訖左積得二十三萬四千貫度牒一百五十六道左金空而成定圖閏圖定圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$今驗定圖左積二十三萬四十貫為寔以左下度牒一百五十六道為法除之得一千五百貫為度牒一道價而成終圖既得金銀每兩鈔鹽每袋度牒每各色之價次列甲乙丙丁四人乗之終圖$$$$$$$$$$$$$$$$$$$$後以首圖右金二百兩併左金五十八兩八銖得二百五十八兩以八銖為三分兩之一通分内子得七百七十五於左甲其右價四百八十貫乃以左甲母三約之為一百六十貫於左甲次以右鹽四千袋併副鹽二百六十四袋得三百四袋於左乙以鹽價二百五十貫於右乙次以副銀八百兩併銀一千六百七十兩得二千四百七十兩於左丙以銀價五十貫於右丙又以次行度牒一十五道併左度牒五十二道得六十七道於左丁以度牒價一千五百貫於右丁兩行對乗之$$$$$$$$以右甲一百六十乗左甲七百七十五兩得一十二萬四千貫為甲原本以右乙二百五十貫乗左乙三百四袋得七萬六千貫為乙原本以右丙五十貫乗左丙二千四百七十兩得一十二萬三千五百貫為丙原本以右丁一千五百貫乗左丁六十七道得一十萬五百貫為丁原本列四人各得原本求等得五百貫皆以五百貫為法除之甲行二百四十八乙得一百五十二丙得二百四十七丁得二百一各為列衰於右行併右行列衰得八百四十八為總法次置博到沉香五千八十八兩遍乗列衰各為沉香寔次置胡椒一萬四百三十包亦遍乗列衰為椒寔次置象牙四百二十四條以大小各半之得二百一十二合亦遍乗列衰為牙寔$$$$$$甲得一百二十六萬一千八百二十四乙得七十七萬三千三百七十六丙得一百二十五萬六千七百二十六丁得一百二萬三千六百八十八各為沉香寔以總法八百四十八除之甲得沉香一千四百八十八兩乙得沉香九百一十二兩丙得沉香一千四百八十二兩丁得沉香一千二百六兩$$$$$$甲得二百五十八萬六千六百四十乙得一百五十八萬五千三百六十丙得二百五十七萬六千二百一十丁得二百九萬六千四百三十各為椒寔以總法八百四十八除之甲得三千五十包不盡二百四十包以包率四十觔乘之得九千六百觔又以法除之得一十一觔不盡二百七十二觔以十六兩通之得四千三百五十二兩又以法除之得五兩不盡一百一十二求等得一十六約之得五十三分兩之七約甲得椒三千五十包一十一觔五兩五十三分兩之七乙得一千八百六十九包不盡四百四十八包以四十觔乘之得一萬七千九百二十又以法除之得二十一觔不盡一百一十二觔以十六兩通之得一千七百九十二兩又以法除得二兩不盡九十六兩求等得十六約之得五十三分兩之六為乙合得椒一千八百六十九包二十一觔二兩五十三分兩之六丙得三千三十七包不盡八百三十四以四十觔通之得三萬三千三百六十觔又以法除之得三十九觔不盡二百八十八以十六兩通之得四千六百八兩又以法除之得五兩不盡三百六十八兩求等得十六約之得五十三分兩之二十三為丙合得椒三千三十七包三十九觔五兩五十三分兩之二十三丁得二千四百七十二包不盡一百七十四以四十觔通之得六千九百六十觔又以法除之得八觔不盡一百七十六以十六兩通之得二千八百一十六又以法除之得三兩不盡二百七十二求等得十六約之得五十三分兩之一十七為丁合得椒二千四百七十二包八觔三兩五十三分兩之一十七$$$$$$甲得五萬二千五百七十六合乙得三萬二千二百二十四合丙得五萬二千三百六十四合丁得四萬二千六百一十二合各為牙寔皆以總法八百四十八除之甲合得牙六十二合乙合得牙三十八合丙合得牙六十一合不盡六百三十六求等得二百一十二約之得四分合之三丁合得牙五十合不盡二百十二求等得二百一十二約之得四分合之一發明歩筭雖繁寔有條而不紊也",
        "procedure_index": 7,
        "id": "數書九章_9_#7"
    },
    {
        "source_title": "數書九章",
        "source_juan": 9,
        "name": "#8",
        "text": "術曰以方程求之正負入之列積及物數於下布行數各對本色有分者通之可約者約之為定率積列數每以下項互徧乘之毎視其積以少减多其下物數各随積正負之類如同名相减異名相加正無人負之負無人正之其如同名相加異名相减正無人正之負無人負之使其下項物數得一數者為法其積為寔寔如法而一所得不計遍損或益諸積各得法寔除之餘倣此",
        "sketch": "草曰置凖錢一百四十七萬貫為三次撥錢為三行積數次置先撥沉香三千五百裏瑇瑁二千二百觔乳香三百七十五觔為右行物數又列次撥沉香二千九百七十裹瑇瑁二千一百三十觔乳香三千五十六套四分套之一為中行物次列沉香三千二百裹瑇瑁一千五百觔乳香三千七百五十套為左行之物各以本色相對列之率圖定率圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$其中行乳香有四分套之一便以母四通中行諸數只内子一入乳香叚内積得五百八十八萬貫沉香得一萬一千八百八十裹瑇瑁得八千五百二十觔乳香得一萬二千二百二十五套以右行求等得二十五俱約之積得五萬八千八百貫沉香得一百四十裹瑇瑁得八十八觔乳香得一十五套以中行求等得一十五約之積得三十九萬二千貫沉香得七百九十二裹瑇瑁得五百六十八觔乳香得八百一十五套以左行求等得五約之積得二萬九千四百貫沉香得六十四裹瑇瑁得三十觔乳香得七十五套列為定率圖三行副置求之今先欲去定圖下位乳香套數一十五與左下七十五互乘左右兩行右積得四百四十一萬貫沉香一萬五百裹瑇瑁得六千六百觔乳香得一千一百二十五套左積得四十四萬一千貫沉香得九百六十一裹瑇瑁得四百五十觔乳香得一千一百二十五套驗左積少右積多當以左行直減右行畢仍置定圖左行數維圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$右積得三百九十六萬九千貫沉香得九千五百四十裹瑇瑁得六千一百五十觔次驗中左兩行各有下位叚又以左下七十五互乗中行乃以中行下八百一十五互乗左行畢中積得二千九百四十萬貫沉香得五萬九千四百裹瑇瑁得四萬二千六百觔乳香得六萬一千一百二十五套左積得二千三百九十六萬一千貫沉香得五萬二千一百六十觔瑇瑁得二萬四千四百五十觔乳香得六萬一千一百二十五套驗左積少中積多以左行同名直減中行畢仍置定圖左行數卜圖宫圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$中積得五百四十三萬九千貫沉香得七千二百四十裹瑇瑁得一萬八千一百五十觔今驗右中兩行數多又求約之其右行求得三十約之右積得一十三萬二千三百貫沉香得三百一十八裹瑇瑁得二百五觔中行求得一十約之中積得五十四萬三千九百貫沉香得七百二十四裹瑇瑁得一千八百一一十五觔今又欲去中左行之瑇瑁乃以中行瑇瑁一千八百一十五互乗右行右積得二億四千一十二萬四千五百貫沉香得五十七萬七千一百七十裹瑇瑁得三十七萬二千七十五套以卜右瑇瑁二百五觔互乗中行中積一億一千一百四十九萬九千五百貫沉香得一十四萬八千四百二十裹瑇瑁得三十七萬二千七十五觔今驗宫右積多中積少乃以中行直減右行畢仍置卜圖中行數干圖支圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$今驗干圖右行叚數只有沉香四十二萬八千七百五十裹以為法以右上積一億二千八百六十二萬五千貫為寔寔如法而一得三百貫為沉香一裹價便以中行沉香七百二十四乗三百貫得二十一萬七千二百貫減中行五十四萬三千九百貫餘三十二萬六千七百貫為中積便減去中行沉香叚之數次以左上沉香六十四乗三百貫得一萬九千二百貫減左積二萬九千四百貫餘一萬二百貫為左積便減左上沉香裹數去之今驗支圖中行其下只有瑇瑁一千八百一十五觔以為法中積三十二萬六千七百貫為寔寔如法而一得一百八十貫為瑇瑁價閏圖$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$今驗閏圖左行有瑇瑁三十觔以乘價一百八十貫得五千四百貫减左積一萬二百貫餘四千八百貫為左積其下只有乳香七十五套以為法以積四千八百貫為寔寔如法而一得六十四貫為乳香套價此題並係俱正補草",
        "procedure_index": 8,
        "id": "數書九章_9_#8"
    }
]