[
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#0",
        "text": "本題術曰置諸元數兩兩連環求等約竒弗約偶徧約畢乃變元數皆曰定母列右行各立天元一為子列左行以諸定母互乘左行之子各得名曰衍數次以各定母滿去衍數各餘名曰竒數以竒數與定母用大衍術求一得各乘率以乘衍數各得用數驗次所揲餘幾何以其餘數乘諸用數併之名曰總數滿衍母去之不滿為所求數以為實易以三才為衍法以法除實所得為象數如實有餘或一或二皆命作一同為象數其象數得一為老陽得二為少隂得三為少陽得四為老隂得老陽畫重爻得少隂畫拆爻得少陽畫單爻得老隂畫交爻凡六畫乃成卦",
        "sketch": "草曰一二三四列右行立天元一列左行$$$$元數右行$$$$天元左行以右行互乘左行以右行一二三四互乘左行異子一弗乘對位本子各得衍數$上$副$次$下元數右行上副次下$$$$衍數左行併之得五十乃併左行衍數四位共計五十故易曰大衍之數五十算理不可以此五十為用葢分之為二則左右手之數竒偶不同見隂陽之伏數必須復求用數先名此曰衍數以為限率遂乃復以一二三四之元數求等數約定按前術以兩兩相連環求等約之先以一與二求等一與三求等一與四求等皆得一各約竒弗約偶數不變次以二與三求等亦得一約竒弗約偶數亦不變及以二與四求等乃得二此二只約副數二變為一而弗約四次以三與四求等亦得一約竒亦不變所得一一三四各為定數母列右行仍各立天元一為子列左行$$$$定母右行$$$$天行左行以右行定母互乘左行以右行定母一一三四互乘左行各子一惟不對乘本子畢左上得一十二左副得一十二左次得四次下得三皆曰衍數$上$副$次$下定母右行以右定母滿去左$上$副$次$下衍數左行衍衍餘各為竒數次以各母去衍數其一母去衍一十二竒一其副母一亦去副子一十二亦各竒一其次母三去次衍四亦竒一其下母四欲去下子三則不滿便以三為左下竒數$上$副$次$下定母右行$$$$竒數左行其左上次副更不大衍只以左下與右下衍之凡竒數得一者便為乘率今左下衍是三乃與本母四用大衍求一術入之列衍竒三於右上定母於右下立天元一於左上空其左下$衍竒$定母&商$天元先以右上少數三除右下多數四得一為商以商一乘左上天元一只得一歸左下其右下餘一$商$衍竒$定母餘○$天元$歸數次以右下少數一除右上多數三須使右上必竒一算乃止遂於右行最上商二以除右衍必竒一乃以上商命右下定餘一除之右衍餘一$商$衍竒餘$定母餘$天元$歸數次以商二與左下歸數相乘得二加入左上天元一内共得三$衍竒餘$右行驗至右上得一只以左上得為乘率$乘率$左行今驗右上衍餘得一當止乃以左上三為乘率與前三者乘率各一與衍定圖衍數對列之通計三行$$$$定母$$$$衍數$$$$乘率以乘率對乘左行畢左上得一十二左副得一十二左次得四左下得九皆曰泛用數$$$$定母$衍母$上$副$次$下泛用次以右行一二三四相乘得一十二名曰衍母復推元用等數二約副母二為一今乃復歸之為二遂用衍母一十二益於左副一十二内共為二十四$$$$元數$$$$定用今驗用數圖右行之一二三四即是所揲之數左行一十二併二十四及四與九併之得四十九名曰用數用為蓍草數故易曰其用四十有九是也假今用蓍四十九信手分之為二則左手竒右手必偶左手偶右手必竒欲使蓍數近大衍五十非四十九或五十一不可二數信手分之必有一竒一偶故所以用四十九取七七之數始有左副二十四内益十二就其三十七泛為用數但三十七無意義兼蓍少太露是以用四十有九凡揲蓍求一爻之數欲得一二三四岀於無餘必令揲者不得知故以四十九蓍分之為二只用左手之數假令左手分得三十三自一一楪之必竒一故不繁楪乃徑掛一故易曰分而為二以象兩掛一以象三次後又令筮人以二二揲之其三十三亦竒一故歸奇於㧅又令之以三三揲之其三十三必奇三故歸奇於㧅又令之以四四揲之又奇一亦歸奇於㧅與前掛一併三度揲通有四㧅乃得一一三一其掛一者乘用數圖左上用數一十二其二揲㧅一者乘左副用數二十四其三揲㧅三者乘左次用數四得一十二其四揲一者乘左下用數九$$$$用數$掛一$㧅$㧅$㧅左行三㧅謂之三變掛一得一十二㧅一得二十四㧅三得一十二又㧅一得九並為總數$$$$併此四總得五十七不問所握幾何乃滿衍母一十二去之得不滿者九以為實用三才衍法約之得三乃畫少陽單爻他皆倣此術意謂揲二楪三楪四者凡三度復以三十三從頭數揲之故曰三變而成爻既卦有六爻必有十八變故曰十有八變而成卦",
        "procedure_index": 0,
        "id": "數書九章_1_#0"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#1",
        "text": "術曰同前置問數求總等不約一位約衆位各得元法連環求等約竒弗約偶各得定母以定相乘為衍母定除母得衍數滿定去衍得竒以大衍入之得乘率以乘衍數得泛用數併諸泛以課衍母如泛内多倍數者損之乃驗元數竒偶同類處各損半倍各得正用然後推氣朔不及或所遇甲子日數乘正用加减之為總滿衍去之餘為所求厯過率實如紀元法而一為厯過以氣元法除衍母得一會積年以氣周日刻乘一會年得一會積日以朔元法除衍母得一會積月數右本題問氣朔甲子相距日數係開禧厯推倒或甲子日在氣朔之間及非十一月前後者其總數必滿母贅去之所得厯過年數尾位雖倫首位必異今設問以明大衍之理初不計其前多後少之厯過",
        "sketch": "草曰置問數冬至三百六十五日四分日之一朔䇿二十九日九百四十分日之四百九十九甲子六十日各通分内子互乘之列三等位具圖如後冬至$日$子$母朔策$$$甲子$$$冬至得一千四百六十一朔實得二萬七千七百五十九甲子無母只是六十列三行互乘之具圖如後$$$$朔通$母$$$總等法元圖以三行互乘右得一百三十七萬三千三百四十為氣分中得一十一萬一千三十六為朔分左得二十二萬五千六百為紀分先求總等得一十二乃存紀分一位不約只以等一十二約氣分得一十一萬四千四百四十五又約朔分得九千二百五十三皆為元法乃以連環求等次以紀元二十二萬五千六百與朔元九千二百五十三求等得一不約又以紀元與氣元一十一萬四千四百四十五求等得二百三十五只約氣元得四百八十七次以氣元四百八十七與朔元九千二百五十三求等得四百八十七只約朔元九千二百五十三得一十九約偏畢得四百八十七為氣定得一十九為氣定得二十二萬五千六百為紀定以三定相乘得二十億八千七百四十七萬六千八百為衍母具圖如後$氣定$朔定$紀定$衍母寄右行$氣衍$朔衍$紀衍$衍數寄左行各以定數約衍母各得衍數氣得四百二十八萬六千四百朔得一億九百八十六萬七千二百紀得九千二百五十三寄左行各滿定數去之各得竒數$$$定數右行$$$奇數左行氣竒得三百一十三朔竒得四紀竒得九千二百五十三各與定數用大衍求一各得乘數列右行對寄左行衍數具圖如後$$$乘率右行$$$衍數左行各以大數入之氣乘率得四百七十三朔乘率得五紀乘率得一十七萬二千七百一十七對左行衍數以右行乘率對乘左行衍數氣泛得二十億二千七百四十六萬七千二百朔泛得五億四千九百三十三萬六千紀泛得一十五億九千八百一十五萬四百一十具圖如後$$$$$$氣正用$朔正用$紀正用右行$氣不及$朔不及$不及數左行右列用數併之共得四十一億七千四百九十五萬三千六百一為泛用數與衍母二十億八千七百四十七萬六千八百驗之在衍母以上就以衍母除泛得二乃知泛内多一倍母數當於各用内損去所多一倍按術驗法元圖内諸元數奇偶同類者各損其半今驗法元圖氣元尾數是五紀元尾數是六百為俱五同類乃以術母二十億八千七百四十七萬六千八百折半得一十億四千三百七十三萬八千四百以損泛用圖内氣泛紀泛畢其朔泛不損各得氣朔紀正用數其氣正用得九億八千三百七十二萬八千八百朔正用五億四千九百三十三萬六千紀正用五億五千四百四十一萬二千一列為正用圖在前既得正用數次驗問題十一月朔日丙辰冬至初五日庚申初九日甲子乃以初一减初九甲子餘八日為朔不及次以初五亦减初九甲子餘四日為氣不及以二不及各乘正用得數具圖如後$氣總$朔總先以氣不及甲子四日以乘氣正用數九億八千三百七十二萬八千八百得三十九億三千四百九十一萬五千二百為氣總次以朔不及甲子八日數以乘其朔正用數五億五千九百三十三萬六千得四十三億九千四百六十八萬八千為朔總併之得八十三億二千九百六十萬三千二百為總數滿母二十億八千七百四十七萬六千八百去之不滿二十億六千七百一十七萬二千八百為所求率實具圖如後$總數$衍母$所求實率$紀定法不滿置所得率實二十億六千七百一十七萬二千八百如法元圖紀元法二十二萬五千六百而一得九千一百六十三年為厯過年數次置衍母二十億八千七百四十七萬六千八百為實如法元圖氣元一十一萬四千四百四十五為法而一得一萬八千二百四十年為氣朔甲子一會積年内减厯過九千一百六十三年餘九千七十七年為未至年數次以冬至周日三百六十五日二十五刻乘積一會年一萬八千二百四十得六百六十六萬二千一百六十日為一會積日又以術母為實如法元圖朔元法九千二百五十二而一得二十二萬五千六百月為一會積月合問",
        "procedure_index": 1,
        "id": "數書九章_1_#1"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#2",
        "text": "術曰以大衍求之置甲庫市陌以庫减庫减之各得諸庫原陌連環求等約竒弗約偶得定母諸定相乘為衍母以定約衍母得衍數衍數同衍母者去之為無其各滿定母去餘為竒數以竒定用大衍求乘率乘衍數為用數無者則以原數同類者求等約衍母得數為借數次置有零文庫零錢數乘本用數併為總數滿衍母去之不滿為諸庫日息足錢各大小月日數乘之各為實各以原陌約為舊會",
        "sketch": "草曰置甲庫市陌一十二遞减一得一十一為乙庫陌十一為丙庫陌九為丁庫陌八為戊庫陌七為己庫陌六為庚庫陌得諸庫原陌甲乙丙丁戊己庚$$$$$$$原陌以連環求等約訖甲得一乙得十一丙得五丁得九戊得八己得七庚得一各為定母立各一為子甲乙丙丁戊己庚法列七庫陌數於前先以甲與$$$$$$$乙相約無等數與丙數相約得等數二約丙十得五與丁甲乙丙丁戊己庚數相約得等數三約甲十二$$$$$$$得四與戊數相約得等數四約甲四得一甲數既為一不能冄約即為與諸數徧約畢甲乙丙丁戊己庚次以乙與下五數相約俱無等$$$$$$$次以丙與下四數相約亦俱無等次以丁與戊己二數相約俱無等與庚數相約得等數三甲乙丙丁戊己庚約庚六得二次以戊與己相$$$$$$$約無等與庚相約得等數二約庚二得一庚既為一己亦不能與之相約乃為連環求等畢得定數為甲一乙十一丙五丁九戊八己七庚一也後凡求定數倣此$$$$$$互乘天元$$$$$$$先以諸定相乘得二萬七千七百二十為衍母次以諸定互乘諸子甲得二萬七千七百二十乙得二千五百二十丙得五千五百四十四丁得三千八百戊得三千四百六十五己得三千九百六十庚得二萬七千七百二十各為衍數甲乙丙丁戊己庚$$$$$$$定母右行$$$$$$$衍數左行$衍母次驗諸衍數有同衍母者皆去之為無衍數次各滿定母去各本衍各得奇數甲無乙得一丙得四丁得二戊得一己得五庚無各為竒數甲$乙$丙$丁$戊$己$庚定母$$$$$$$奇數次驗有奇數者得一便以一為乘率或得二數以上者各以奇數於右上定母於右下立天元一於左上用大衍求一之數入之驗乘除至右上餘一而止皆以左上所得為乘率甲無乙得一丙得四丁得五戊得一己得四庚無各為乘率列右行以對寄左衍數甲$乙$丙$丁$戊$己$庚乘率右行$$$$$衍數左行以兩行對乘之為用數甲無乙得二千五百二十丙得二萬二千一百七十六丁得一萬五千四百戊得三千四百六十五巳得一萬一千八百八十庚無甲乙丙丁戊己庚$$$$$$$次推無用數者惟甲庚合於同類處借之其同類謂原陌列而視之甲乙丙丁戊己庚原陌生$今視甲一十二庚六皆與丙一十戊八俱偶為同類其戊用數三千四百六十五其數少不可借惟丙一十之用數係二萬二千一百七十六為最多當以借之乃以甲一十二丙一十庚六求等得二以等數二約衍母二萬七千七百二十得一萬三千八百六十為借數乃减丙用二萬二千一百七十六餘八千三百一十六為丙用數乃以所借岀之數一萬三千八百六十為實以原等二為法除之得六千九百三十為甲用數以甲用數减借岀數餘亦得六千九百三十為庚用數今不欲甲庚之借數同乃驗得岀數一萬三千八百六十可用幾約如意乃立三取三分之一得四千六百二十為甲用取三分之二得九千二百四十為庚用列右行$$$$$$$用數右行甲乙丙丁戊己庚一$$$$$$左行乃視諸庫有無零錢數驗得乙丙己三庫無先去其用數乃以甲子戊庚四庫零錢列左行對乘本用甲得四萬六千二百丁得六萬一千六百戊得二萬七百九十庚得三萬六千九百六十合為總$$$$$$$$各總甲丁戊庚併此四總得一十六萬五千五百五十滿衍母二萬七千七百二十去之不滿二萬六千九百五十為所求率以貫約為二十六貫九千五十文為諸庫日息等數以官省七十七陌展得三十五貫文各以其庫陌紐計各得舊會零錢各以三十日乘為大月息以日息减大月息餘為小月息合問分糶推原",
        "procedure_index": 2,
        "id": "數書九章_1_#2"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#3",
        "text": "術曰以大衍求之置官塲斛率安吉鄉斛率平江市斛率為原數求總等不約一位約衆位連環求等約竒不約偶或猶有類數存者有求等約彼為復乘此各等定母相乘為衍母互乘為衍數滿定去之得竒大衍求一得乘率乘衍數為用數以各餘米乘用併之為總滿衍母去之不滿為所分以原人數乘之為共米",
        "sketch": "草曰置文思院官斛八十三升吉安州鄉一百一十升平江府市斛一百三十升各為其斛原率官斛安吉斛平江斛$$$原數先以三率求總等得一不約次以連環求等其安吉率一百一十與平江率一百三十五求等得五以約平江率得二十七餘皆求等得一不約各得原數$$$以定相乘得二十四萬六千五百一十為衍母各以原率約之得二千九百七十為官斛衍數得二千二百四十一為安吉州衍數得九千一百三十為平江斛衍數官斛安吉平江衍母$$$衍數寄左$次以定母滿法去衍數得不滿六十五為官斛奇不滿四十一為安吉奇不滿四為平江奇數$官斛$安吉$平江定母右行$$$奇數左行定母奇數各以大衍入之求得乘數得二十三為官斛乘率得五十一為安吉乘率得七為平江乘率$$$定母$$$乘數以乘率各乘寄左行衍數得六萬八千三百一十為官斛用數得一十一萬四千二百九十一為安吉用數得六萬三千九百一十為平江用數$官斛$安吉$平江周數升$甲$乙$丙餘米次以甲餘三十二升乘官斛用數六萬八千三百一十得二百一十八萬五千九百二十升於上次以乙餘七十升乘安吉用數一十一萬四千二百九十一得八百萬三百七十升於中次以丙餘三十升乘平江用數六萬三千九百一十得一百一十九萬七千三百於下各為總併之得一千二百一十萬三千五百九十升為總數滿衍母二十四萬六千五百一十升去之不滿二萬四千六百升為所求率展為二百四十六石為三人各分米以兄弟三人因之得七百三十八石為共米置分米二百四十六石各以官斛八斗三升安吉斛一石一斗平江斛一石三斗五升約之甲得二百九十六石餘三斗二升乙得二百二十三石餘七斗丙得一百八十二石餘三斗各為糶過及餘米合問",
        "procedure_index": 3,
        "id": "數書九章_1_#3"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#4",
        "text": "術曰以大衍求之置甎方長闊厚為元數以小者為單起一先求總等存一位約衆位乃為元數連環求等約為定母以定相乗為衍母各定約衍母得衍數滿定去之得竒竒定大衍得乗率以乗衍數得用數次置廣深多少數多者乘用少者減元數餘以乘用併為總滿衍母去之不滿得廣深",
        "sketch": "草曰置四甎方長闊厚係八數城甎厚有分為小者皆通之為單大方得一百三十分小方得一百一十分城甎長得一百二十分闊得六十分厚得二十五分六門甎長得一百分闊得五十分厚得二十分$$$$$$$$錐行置之右列位稍多甎名相互今假八音為號位先以最少者自木二十與革二十五求等得五乃反約木二十為四木四與土五十求等得二以約五十為二十五木四與匏六十求等得四約六十為一十五木四與竹一百求等得四約一百為二十五木四與絲一百一十求等得二約一百一十為五十五木四與石一百二十求等得四反約木四為一以木一與金求等得一不約為木與諸數求等約訖為一變得數具圖如後$$$$$$$$次以革二十五與土五十求等得二十五約五十為二以革二十五與匏一十五求等得五約匏一十五為三以革二十五與竹二十五求等得二十五約竹二十五為一又以革二十五與絲五十五求等得五約絲五十五得一十一以革二十五與石一百二十求等得五約一百二十為二十四以革二十五與金一百三十求等得五約金一百三十得二十六革與諸數徧約訖為二變具圖如後$$$$$$$$乃以土二與匏三竹一絲一十一求等皆得一不約以土二與石二十四求等得二及約土二得一又不土一與金二十六求等得一不約土與諸數約訖為三變具圖如後$$$$$$$$乃以匏三與竹一絲十十一求等皆得一又以匏三與石二十四求等得三約石二十四為八又匏三與金二十六求等得一不約匏與諸數約訖以為四變次以竹一與絲一十一與石二十四與金二十六求等皆得一竹與諸數約訖為五變次以絲一十一與石二十四與金二十六求等皆得一不約為六變復以石二四與金二十六求等得二約金二十六為一十三至此七變連環求等約俱畢得數為定母列圖如後$$$$$$$$右定母列右行以相乗得八萬五千八百為衍母以各定母約衍母各得衍數其竹木土定得一者為無$$$$$$$$$$$$$$$$$金定一十三得衍數六千六百石定八得衍數一萬七百二十五絲定一十一得衍數七千八百竹定一無衍匏定三得衍數二萬八千六百土定一無衍數革定五五得衍數三千四百三十二木定一無衍數各滿定母去之得竒數$$$$$$$$$$$$$$$$金得竒九石得竒四絲得竒一匏得竒一草得竒七其絲匏得竒數一者便以一為乗率其金石革三處竒數皆與本定母用大衍求一入之各得乘率列右行$$$$$$$$$$$$$$$$金得三石得五絲得一革得一革得一十八各為乘率寄左行衍數各得為用數$$$$$$$$$凡諸用數同類者類必多可互借以補無者先驗革元數二十五與木元數二十為同類求等得五以等五約衍母八萬五千八百得一萬七千一百六十乃於革用數内減出以補木位為木用餘四萬四千六百一十六為革用次驗竹元數一百與土五十為同類以求等得五十以等五十約衍母八萬五千八百得一千七百一十六亦於革用内各借與竹土為用數革止餘四萬一千一百八十四為用得諸定用數$$$$$$$$$右行定用始列錐行假號求得今照甎色遷次列之$$$$$$$$$$$$$$$$旣照甎次序列用數於右行乃驗問題所謂大方甎砌廣多六寸小方多二寸城甎長多三寸城甎闊多三寸厚多五分六門長多三寸闊多三寸厚多一寸對本用列左行各對乘之具圖如後$$$$$$$$兩行乗畢金得一百一十八萬八千絲得一十五萬六千石得一百六十萬八千七百五十匏得八十五萬八千革得二十萬五千九百二十竹得五萬一十四百八十土亦得五萬一千四百八十木得一十七萬一千六百乃併前八位數共得四百二十九萬一千二百三十分為總滿衍母八萬五千八百去之不滿一千二百三十分約之為一丈二尺三寸為基元廣數乃求其深驗問題大方砌少六寸小方砌少三寸城甎長砌少一寸闊砌少一寸厚砌多一寸六門長砌多一寸六門闊砌多一寸六門厚砌多一寸列為中行次置諸甎元數列為左行課減之具圖如後$$$$$$$$$$$$$$$$今以中行多者存之少者用減左行存者左行元數去之所減者左行餘數存之金得七十絲得八十石得一百一十匏得五十革得一十竹一十土一十本一十具圖如後$$$$$$$$列為左行以對右行定用數具圖如後$$$$$$$$$$$$$$$$以左行多餘數對乘右行用數金得一百三十八萬六千絲得六十二萬四千石得五百八十九萬八千七百五十匏得一百四十三萬革得四十一萬一千八百四十竹得一萬七千一百六十土得一萬七千一百六十木得一十七萬一千六百具圖如後$$$$$$$$$$併八位得九百九十五萬六千五百一十分為總滿衍母八萬五千八百去之不滿三千七百一十分展為三丈七尺一寸為基地深",
        "procedure_index": 4,
        "id": "數書九章_1_#4"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#5",
        "text": "術曰置各縣力以程功程為實以力率乗堤齊闊為法除之得各縣日築復數求總等不約一位約衆位曰元數連環求等約竒得定母陸續求衍數竒數乗率用數以丙丁縣不及數乘本用併為總數以定母相乘為衍母滿母去總數得各縣分給里歩積尺數以縣數因之為堤長各以里法歩法約之為里歩",
        "sketch": "草曰置甲縣力一十三萬八千六百貫乙縣力一十四萬六千三百貫丙縣力一十九萬二千五百貫丁縣力一十八萬四千八百貫以程功六十尺徧乗之皆以貫黙約之甲得八百三十一萬六千尺乙得八百七十七萬八千尺丙得一千一百五十五萬尺丁得一千一百八萬八千尺各為實次以力率七百七十貫乗堤齊闊二十尺亦以貫黙約之得一萬五千四百尺為法徧除諸各實甲得五十四丈乙得五十七丈丙得七十五丈丁得七十二丈各為四縣衆夫每日築長率按大衍術命曰復數列右行$$$$$$$$以復數求總等得三大以約三位多者不約其少者甲得五十四乙得一十九丙得二十五丁得二十四仍為元數次以兩兩連環求等各約之$$$$先以丁丙求等又以丁乙求等皆得一不約次以丁甲求等得六只約甲五十四得九不約丁次以丙與乙求等又以丙與甲九求等皆得一不約後以乙與甲九求等得一不約復驗甲九與丁二十四猶可再約又求等得三以約丁二十四得八復乘甲為二十七$$$$$次以定母四位相乗求得一十萬二千六百為衍母各以定母約衍母甲得三千八百乙得五千四百丙得四千一百四丁得一萬二千八百二十五為衍數$$$$$$$$滿定母各去衍數甲不滿二十乙不滿四丙不滿四丁不滿一各為竒數$$$$$$$$以各定母與本竒數用大衍求一術入之各得乘率甲得二十三乙得五丙得一十九丁得一$$$$$$$$以右行乗率對乘寄左行衍數甲得八萬七千四百乙得二萬七千丙得七萬七千九百七十六丁得一萬二千八百二十五各為用數$$$$次驗四縣所築有無不及零丈尺寸今甲乙俱畢為無丙餘五十一丈丁餘一十八丈為有以丙丁二縣餘丈各乗丙丁二用數其丙五十一丈乗丙用七萬七千九百七十六得三百九十七萬六千七百七十六丈為丙總以丁餘一十八乗丁用一萬二千八百二十五得二十三萬八百五十丈為丁總併二總得四百二十萬七千六百二十六丈為總數亦以丈通衍母得一十萬二千六百丈仍為衍母滿去總數不滿一千二十六丈為所求長率以四縣因之得四十一百四丈為實以歩法五尺八寸除之得七千七十五歩五尺為堤長歩以里法三百六十歩約之得一十九里二百三十五歩五尺為堤通長置長率一千二十六丈以歩法約之得一千七百六十八歩五尺六寸又以里法約之得四里三百二十八歩五尺六寸為各縣所給道里歩尺數",
        "procedure_index": 5,
        "id": "數書九章_1_#5"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#6",
        "text": "術曰以大衍求之列三器所容為元數連環求等約為定母以相乘為衍母以定各約衍母得衍數各滿定母去之得竒以竒定用大衍求得乘率以乘衍數得用數次以各剰米乗用併之為總滿衍母去之不滿為毎籮米各以剰米減之餘為甲乙丙盗米併之為共失米",
        "sketch": "草曰列三器所容一升九合一升七合一升二合為元數連環求等皆得一不約便以元數相乗得三千八百七十六為衍母以各元數為定母以定約衍母得衍數甲得二百四乙得二百二十八丙得三百二十三各為衍數列左行以三定母甲十九乙十七丙十二列右行具圖如後$$$$各滿定母去衍數得竒數甲得一十四乙得七得七丙得一十一$$$$$$各以竒定用大衍求一各得乗率甲得十五乙得五丙得一十一各為乘率列右行對寄在行衍數具圖如後$$$$$$以丙行對乗之得用數甲得三千六十乙得一千一百四十丙得三千五百五十三列右行具圖如後$$$$$$既得用數始驗問題三籮剰米列左行對三人所用以兩行對乗之甲得三千六十乙得一萬五千九百六十丙得三千五百五十三$$$$$$併三數得二萬二千五百七十三為總數滿衍母三千八百七十六去之不滿三千一百九十三合展為三石一斗九升三合為三籮適滿細數以左籮剰一合減之餘三石一斗九升二合為甲盗米又為丙盗米以中籮剰米一升四合減之餘三石一斗七升九合為乙盗米併三人共得九石五斗六升三合為所失總米合問$$$$$$",
        "procedure_index": 6,
        "id": "數書九章_1_#6"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#7",
        "text": "術曰以大衍求之置各行里先求總等存一約衆得原里次以連環求等約竒復乘偶得定母以定相乘為衍母滿定除衍衍得乘率以乘衍數得用數次置辰刻正末乗各行里為實以晝六時約之得餘里各乗用數併為總滿衍母去得所求至都里以各日行約之得日辰刻數",
        "sketch": "草曰置甲三百里乙二百四十里丙一百八十里先求總等得六十只存甲三百勿約乃約乙二百四十得四次約丙一百八十得三各為元數連環求等$$$先以丙乙求等得一不約次以丙甲求等三於術約竒不約偶盖以等三約三因得一為竒盧無衍數乃便徑先約甲三百為一百復以等三兼丙三為九既丙九為竒甲百為偶此即是約竒弗約偶次以一四與甲百求等得四以四約一百得二十五為甲復以四乗乙四得一十六為乙各為定母$$$$以定母相乗得三千六百為衍母以各定約衍母為衍數甲得一百四十四乙得二百二十五丙得四百術數各滿衍母去之不滿為竒數甲得一十九乙得一丙得四$$$$$$以各竒數與定母用大衍入之各得乘數甲得四乙得一丙得七各為乗率列右行$$$$$$以乗率對乘寄左行衍數甲得五百七十六乙得二百二十五丙得二千八百各為用數$$$$$$次置甲申末到者其酉初為夜此是甲以全日到為無餘里次置乙於未正到乃於卯時數至未正得四箇半時以四半乗乙行二百四十里得一千八十為實以畫六時約之得一百八十里為乙行不及全日之餘里次置丙於辰未到自卯初數至辰未得二時以因丙行一百八十里得三百六十為實以六時除之得六十里為丙行不及全日之餘里$$$$$$$$以乙餘一百八十乗乙用二百二十五得四萬五百於中以丙餘六十乗丙用二千八百得十六萬八千加中共得二十萬八千五百為總滿衍母三千六百去之不滿三千三百里為軍前至都里以甲三百除之得一十一日以乙二百四十除之得一十三日四時半以丙一百八十除之得一十八日二時合問",
        "procedure_index": 7,
        "id": "數書九章_1_#7"
    },
    {
        "source_title": "數書九章",
        "source_juan": 1,
        "name": "#8",
        "text": "術曰以均輸求之大衍入之置乙己去日數乗乙行里為實以甲乙行里差為法除之得甲及乙日數辰刻以乗甲行得里次置丙旣去日乗丙行里為實以丙乙行里差為法除之得乙及丙日數以乗乙行得里然後置三人日行求總等約得原數以連環求等約得定母以定相乗得衍母各定約衍得衍數滿定去衍得竒竒定大衍得乗率以乗寄衍得用數視甲及乙里為乙率乙及丙里為丙率以乙日行滿去乙率不滿為乙餘以丙日行滿去丙率不滿為丙餘以二餘各乗本用併之為總滿衍去之不滿為彼去此里",
        "sketch": "草曰置乙己去日乘乙日行二百五十里得一百二十五里為實次置甲日行三百里減去乙行二百五十里餘五十里為差法除實得二日五十刻甲果及乙數以乗甲行三百里得七百五十為甲及乙里數次置丙既行二百乗丙日二百里得四百里為實次置乙行二百五十里減丙行二百里餘五十里為差法除實得八百為乙及丙日數以乗乙行二百五十里得二千里為乙得及丙之里數已上為先欲知果及數次列甲乙丙三名日行求總等得五十先約甲丙存得甲六乙二百五十丙四$$$以甲六丙四求等得二以二約甲為三復以二因丙為八次將乙二百五十與丙八相約得二乃約乙為一百二十五復以二因丙為十六定得甲三乙一百二十五兩十六為定母$$$$以定相乗得六千為衍母以各定約衍母得衍數甲得二千乙得四十八丙得三百七十五求竒數$$$$$$左上二千以甲三去之竒二左中四十八即為乙竒左下三百七十五丙十六去之竒也$$$$$$各以大衍求得甲二乙一百一十二丙七各為乘率$$$$$$以乗率對乗衍數甲得四千乙得五千三百七十六丙得二千六百二十五為泛用數$$$併三泛得二萬二千一乃多衍母一倍當半衍母六千得三千以消甲四千餘一千又消乙五千三百七十六餘二千三百七十六丙不消各為定用數$$$$$$既得用數次視前草中甲及乙七百五十里為乙率乙及丙一千里為丙率各滿乙丙日行里去之$$$$今乙丙二人所行各皆適滿去之無餘雖稱同時俱至乃各係全日所行便以乙丙二人約六千里得三千里為彼去此里數合問法列三數於上以十為總等徧約之得甲三十乙二十五丙二十即為元數連環求等以甲與乙約得等數五約甲得六以甲與丙約得等數二約甲得三為甲數徧約畢次以乙與丙約得等數五約丙得四為乙丙二數徧約畢乃以總等十乗乙數得二百五十次求續等以甲與乙與丙相約俱無續等以乙與丙約得續等二約乙數得一百二十五復乗丙得八則甲三乙一百二十五丙八即為各定數也以三定數連乗得三千為衍母即所問彼處去此之里數較舊術算省而數亦確矣",
        "procedure_index": 8,
        "id": "數書九章_1_#8"
    }
]