[
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#0",
        "text": "術曰以少廣求之置人占方冪乗每隊人為隊實以一為隅開平方所得為隊方圖次置隊數乗将數又四因之増三為寔以二為從隅開平方得率以乗隊方面為營方面",
        "sketch": "草曰置人占八尺自乗得六十四尺為人占方冪以乗每隊一百二十五人得八千尺為寔以一為隅開平方歩法常超一位今隅超一度至寔之百下約寔置啇八十尺以啇八十生隅一得八十為方乃命上啇除寔訖實餘一千六百次以啇生隅入方得一百六十畢方一退隅再退之復於上啇之次續啇九尺乃以續啇九生隅一入方得一百六十九乃命續啇除寔訖得八十九尺不盡七十九尺就為九十尺得隊方面次置三十三隊乗三将得九十九又四因得三百九十六増三得三百九十九為寔以二為從方一為從隅開平方歩法以從方進一位至寔之十下隅隅超一位至寔之百下乃約寔置啇一十生隅一入方得一十二乃命上啇除寔訖餘二百七十九又以啇一十生隅入方得二十二畢方一退隅再退之續于寔上啇九隊以續啇九生隅入方得三十一乃命續啇除寔適盡得一十九乗隊方面九十得一千七百十尺展為營方一百七十一丈合問$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
        "procedure_index": 0,
        "id": "數書九章_8_#0"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#1",
        "text": "術曰以少廣求之置兵開平方得方面人數以人立尺數乗之為原方面置原方面以欲多數加之為鋭後闊亦為通長倍馬路減之餘為實以人立尺約為闊布兵不盡半歸馬路以四約闊布兵得外鋭一邉人倍一邉人併不歸為内鋭長闊人數副置減一餘乗其副得數半之為内鋭布兵以減總兵餘為外鋭布兵計立六萬二千五百人鋭後廣通長各三百丈内鋭立一萬六千六百五十三人外鋭立四萬五千八百四十七人",
        "sketch": "草曰置一軍一萬二千五百以五軍因之得總兵六萬二千五百人為寔開平方得二百五十人以人立八尺乗之得方面二百丈置二百丈加半倍一百丈得三百丈為鋭陣後闊亦為鋭陣道長先倍騎路五丈得一十丈以減後闊二百丈餘二百九十丈為實以人立八尺約之得三百六十二為鋭後闊布兵不盡四尺以半之得二尺軰歸騎路作五丈二尺以四約鋭後闊布兵三百六十二人得九十人為外鋭一邉人倍一邉九十得一百八十併不盡二人共得一百八十二人為内鋭廣布兵數亦為長布兵副置加一得一百八十三乗副一百八十二得三萬三千三百六以半之得一萬六千六百五十三人為内鋭陣布兵以減總兵六萬二千五百餘四萬五千八百四十七人為外鋭兵$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
        "procedure_index": 1,
        "id": "數書九章_8_#1"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#2",
        "text": "術曰以啇功求之置重數減一餘為叚以叚乗圓差為衰以衰乗重數為率求圓周以率減兵餘如重數而一得内周人數不滿為餘兵以人立圓邉乗内周人得内周尺倍衰乗圓邉為泛以泛併内周尺得外周尺為實如圓邉而一得外周人求出竒後以率加存兵如重數而一得外周人不滿為餘兵以外周人約原外周尺得後立尺以後立尺約原内周得内周人",
        "sketch": "草曰置九重減一餘八為叚以乗圓束差六得四十八為衰九重得四百三十二為率$$$$$$$求原周以率四百三十二減周制一軍一萬二千五百餘一萬二千六十八為實如重數九而一得一千三百四十人為内周人數不滿八人為餘兵$$$$$$$次以人立圓邉六尺乗内周人一千三百四十得八千四十尺收作八百四丈為内周尺數$$$$倍衰四十八得九十六乗圓邉六尺得五百七十六尺為泛$$$以泛五百七十六尺併内周八千四十尺得八千六百一十六尺為外周尺$$$以外周尺八千六百一十六為實如圓邉六尺而一得一千四百三十六人為外周人數$$$求出竒後以竒母四約一萬二千五百得三千一百二十五為竒兵以減總軍餘九千三百七十五為存兵次以率四百三十二加之得九千八百七十為實加重數九而一得一千八十九為外周人不盡六$$$$$$$$$$$$$次以原外周八千六百一十六尺為實以外周人一千八十九約之得七尺九寸一分不盡二尺一分與法求等得三俱約之為分下三百六十三分之六十七$$$$$$$$$$置原内周八千四十尺為實以後立尺七尺九寸一分約之得一千一十六為内周人數不盡三尺四寸四分為寛地$$$$$本術所求内外周之人數既定不拘竒出竒入皆以六人為重差或累差加減各得諸重圍數或併九重人課總軍存兵",
        "procedure_index": 2,
        "id": "數書九章_8_#2"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#3",
        "text": "術曰以啇功求之以圓率因内徑為内周以人立尺約之為内周人數乃以圓求差率為隅次置内周人減隅餘約從方列兵數為寛開平方得重數不盡為餘兵置重數減一餘四因又乗圓邉尺數併内徑共為通徑以圓率因通徑得外周$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
        "sketch": "草曰以圓率三因内徑七十二丈得二千一百六十尺為内周以圓邉九尺約内周得二百四十為内周人數乃以圓束差六為從隅次置内周二百四十人減隅餘二百三十四為從方列兵二千六百為寔開平方歩法從方進一位隅法超一位今方隅皆不可超進乃于寔約啇置九重以啇生隅六得五十四増入從方内共得二百八十八乃命上啇九重除寔訖寔餘八人為餘兵副置九重減一餘八以四因之得三十二又乗圖邉九尺得二百八十八尺併内徑七百二十尺得一千八尺為通徑又以圓率三因通徑得三千二十四尺為外周次以圓邉九尺為法除外周尺數得三百三十六人為外周人數合問",
        "procedure_index": 3,
        "id": "數書九章_8_#3"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#4",
        "text": "術曰以粟米求之互換入之置各功程原人率於右行置原日數於中行置欲求數為左行以三行對之為各實列右行置原物數於中行置見𬋩人為左行以左行乘中行各為法以對除右行各得日數",
        "sketch": "草曰置原造弓七人造刀八人造箭三人於右行次置造弓九日造刀六日造箭二日列中行又置於造弓一萬欲造刀一萬欲造箭一百萬列左行以三行對乗原造弓$人原造刀$人原造箭$人右行原造弓$日原造刀$日原造箭$日中行原造弓$張原造刀$副原造箭$隻左行弓寔$日刀寔$日箭寔$日寄右行次列原造弓八張刀五副箭一百五十隻放中又列見管弓作二百人刀作五百四十人箭作二百七十六人於左行原造弓$張原造刀$副原造箭$隻中行原造弓$人原造刀$人原造箭$人左行以兩行對乗之上得一千六百中得二千七百下得四萬一千四百各為法上$中$下$各為法先以上法一千六百除寄右行弓日實六十三萬日得三百九十三日為造弓一萬張日數寔白$$造弓畢$不盡$法$不盡一千二百與法求等得四百俱約之為四分日之三造弓日$$子$母次以中得二千七百除寄右行刀日實四十八萬日得一百七十七日為造刀一萬副日數刀日寔$造弓畢$不盡$法$不盡二千一百與法求等得三百俱約之為九分日之七造刀$子$母$次以下法四萬百除寄右行箭日實六百萬日得一百四十四日為造箭一百萬隻日數箭日寔$$法商$不盡$$不盡三萬六千四百日與法四萬一千四百求等得二百俱以約之得二百七分日之一百八十二為造箭日分合問造箭日$$子$母計造軍衣",
        "procedure_index": 4,
        "id": "數書九章_8_#4"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#5",
        "text": "術曰以盈拙求之置人數於左右之中置所給物各於其上置盈拙各於其下令維乘之先以人數互數乘其所給率相減餘為法次以人數相乘為寄後以盈拙互乘其上未減者是謂未乘騐其下係一盈一拙以上下皆併之為物其上併之實其下併之乘寄為兵寔如法而一各得騐其係兩盈或兩拙者以上下皆相減之其上減之餘為物寔其下減之餘乘寄為兵寔二寔皆如法而一各得騐其或一盈一足或一拙一足者其適足乃以空互乘其上未減者去之只以所用盈拙數互乘其上為物寔以盈或拙一數乘寄為兵寔皆如法而一各得",
        "sketch": "求布草曰置布於六人左中八疋於左朏上一百六十四疋於左下置七人於右中九疋於右上盈百五六十於布下先以左右之中六七互乘左右之上訖左上得五十五右上得五十四以相減之餘二為法次以左右中六七相乘得四十二為寄於中次以左下虧一百六十乘右上未减五十四得八十六百四十又以右下盈五百六十乘左上未减五十六得三萬一千三百六十驗得左右之下係一盈一朏當併之以三萬一千三百六十併右上八千六百四十得四萬為布實次以左下朏一百六十併左下盈五百六十得七百二十乗寄四十二得三萬二百四十為兵實二實皆如法二而一得二萬疋為布得一萬五千一百二十為兵求布圖步$疋$人盈$疋右行右中乘左上步$疋$人胐$左行左中乘右上$$人盈$上對減之$$人胐$未減$疋盈$右行右下乘左上$法$人左下乘右上未減$疋胐$左行$盈$右行寄$人兩行併之$胐$左行$寄$人$中乘下得後中$兵$$法下除上及中$疋兵$人$荅數求綿草曰置八人於左中綿一百五十兩於左上餘一萬六千五百兩於左下次置九人於右中一百七十兩於右上餘一萬四千四百兩於右下以左右中八九五乘各上訖左上得一千三百五十右上得一千三百六十相減餘一十為法次以中八九相乘得七萬二為寄於中次以左下一萬六千五百乘右上一千三百六萬得二千二百四十四萬却以右下一萬四千四百乘左上一千三百五十得一千九百四十四萬驗其下係兩盈當相減之其右上餘三百萬為綿實其左右之下亦相減之餘二千一百乘寄七十二得二十五萬一千二百為兵實二實皆如法一十而一綿得三十萬兩兵得一萬五千一百二十人求綿圖$綿兩$人餘綿$兩右行右中乘左上$綿兩$人餘綿$左行左中乘右上$兩$人餘$兩上對減$兩$人餘$兩中對乘未減$兩餘$兩右下乘左上兩$法寄$人左下乘右上未減$兩餘$兩$兩餘$兩右行寄$人上下對減$兩餘$兩左行綿實$兩寄$人餘$兩下乘中為後中綿實$兩兵實$人$法下除上中兩$兵$人求絮草曰置四人於左中一十三觔於左上少六千八百四觔於左下又置五人於右中一十四觔於右上適足為空於右下以左右之中四五互乘其上訖左上得六十五右上得五□六利減餘九為法以中四五相乘得二十為寄於中先以左下六千八百四互乘右上五十六得三十八萬一千四百二十却以右適足之空乘左上六十五亦為空乃去之只以右上三十八萬一千二十四觔為絮實只以左下六千八百四乘寄二千人得一十三萬六千八十為兵實二實皆如法九而一具絮得四萬二千三百三十六觔其兵得一萬五千一百二十人合問求絮圖絮$$人適足$空右行右中乘左上絮$$人少$左行左中乘右上$$人$空上對減$上$人$少中對乘中下$法未減寄$人定$空左下乘右上為後未減$實右下空乘左上乃無乃去絮實$寄$人少$以下乘中為後中絮實$人兵實$人$法以下除中上絮$兵$人荅數已上布綿絮三項求人兵數皆同今仍於各圖立算求之以合本術",
        "procedure_index": 5,
        "id": "數書九章_8_#5"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#6",
        "text": "術曰以均輸求之置行數為法以單數一行乘日程為寔寔如法兩一得宿程里歩",
        "sketch": "草曰置行數九為法以單傔數一行用乘六十里為寔寔如法而一得六十不盡六里以里法三百六十歩通之得二千一百六十歩又為寔仍如法九而一得二百四十歩為六里二百四十歩宿程",
        "procedure_index": 6,
        "id": "數書九章_8_#6"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#7",
        "text": "術曰以均輸求之置各縣及鄉力皆如里而一不盡者約之復通分内子互乘之或就母遷退之各得變力可約約之為定力副併為法以合起夫徧乘未併定力各得為實並如前法而一各得夫其餘分軰之",
        "sketch": "草曰置甲州三縣及乙軍五鄉物力里數作八行列之具圖于後上縣$文$里$力$$上$定力中縣$文$里$$中$定力下縣$文$里$力子$母$下$定力仁鄉$文$里$力$仁$定力義鄉$文$里$力$$義$定力禮鄉$文$里$力$$禮$定力智鄉$文$里$力$$智$定力信鄉$文$里$力$子母$信$定力置上縣力五十七萬三千二百五十九貫五百文如九百二十五里而一得力六十一萬九千七百四十置中縣五十萬四千九百八十三貫七百八十文如六百五十二里而一得力七十七萬四千五百一十五置下縣四十九萬八千七百六十貫九百五十如四百六十五里而一得力一百七萬二千六百四不盡九十文與法求等得十五約之得三十一分之六置仁郷一十二萬八千三百七十一貫九百八十如七百里而一得力一十八萬一千八百三十置義鄉鄉一十一萬九千四百七十二貫六百文如七百九十五里而一得力一十五萬二百八十置禮鄉一十萬八千四百六十三貫五十文如七百九十而一得力一十三萬七千二百九十五置智鄉八萬四千二百三十六貫二百八十五文如七百四十九里而一得力一十一萬二千六百四十五置信鄉九千三百四十五貫一百六十文如八百四里而一得力一萬一千二百六十三不盡二百六十八文與法求等得二百六十八約為三分之一其下縣信鄉二處帶母子者各以母互徧乘八處所得畢二處各内本子上得五千七百六十三萬五千八百二十中得七千二百二萬九千八百九十五下得九千九百七十五萬二千一百九十仁得一千六百九十一萬一百九十義得一千三百九十七萬六千四十禮得一千二百七十六萬八千四百三十五智得一千四十五萬九千二百四十五信得一百八萬九百七十已上為三郷五縣變力率可約者復求等約之求得五故俱以五約之上得一千一百五十二萬七千一百六十四中得一千一百四十萬五千九百七十九下得一千九百九十五萬四百三十八仁得三十八萬二千五十八義得二百七十九萬五千二百八禮得二百五十五萬三千六百七十八智得二百九萬一千八百四十九信得二十一萬六千一百九十四已上並為定力副併八處定力得五千六百九十二萬二千五百七十七為法以合起一萬二千夫遍乘定力訖上得一千三百八十三億二千五百九十六萬八千為實中得一千七百二十八億七千一百四十七萬八千為中實下得二千三百九十四億五百二十五萬六千為下實得四百五億八千四百六十九萬六千為仁實義得三百三十五億四千二百四十九萬六千為義寔禮得三百六億四千四百二十萬萬四千為禮寔智得三百五十一億二百一十八萬八千為智寔信得二十五億九千四百三十二萬八千為信寔已上八寔皆如前法而一餘分軰之各得夫數合",
        "procedure_index": 7,
        "id": "數書九章_8_#7"
    },
    {
        "source_title": "數書九章",
        "source_juan": 8,
        "name": "#8",
        "text": "術曰以均輸求之置各軍見管人騐可求約等以約之為衰副併為法以共合差數乘列衰各為寔寔如法而一各得",
        "sketch": "草曰置諸軍見管求等得一千二百三十四俱以約見管前軍得五右軍得四中軍得六左軍得三後軍二列為各衰副併諸衰得二十為法以共差一千得二百六十人乘諸衰前軍得六千三百右軍得五千四十中軍得七千五百六十左軍得三千七百八十後軍得二千五百二十各為寔皆如法二十而一前軍合差三百一十五人右軍合差二百五十二人中軍合差三百七十二人左軍合差一百八十九人後軍合差一百二十六人見管人$$右軍$中軍$左軍$後軍求等$前軍$右軍$中軍$左軍$後軍等數$前衰$右乘$中衰$左軍$法$前寔$右寔$中實$左實$後寔等法$前軍$右軍$中軍$左軍$後軍合差人",
        "procedure_index": 8,
        "id": "數書九章_8_#8"
    }
]