[
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#0",
        "text": "術曰以勾股求之重差入之置二退表相減餘為高法通表間併法於上以目高減表高餘乗上為寔寔如法而一得山高以法乗表高為逺法以退後表乗髙寔為逺寔寔如法而一得山逺望山髙逺圖",
        "sketch": "草曰置後退表三丈一尺三寸減前退表三丈九寸餘四寸為高法置表去木一百六十四歩以歩法五十寸通得八千二百寸為表間併法四寸得八千二百四寸於上以目髙五尺減表高二丈三尺餘通之為一百八十寸乗上得一百四十七萬六千七百二十寸為髙實實如髙法四寸而一得三十六萬九千一百八十寸為積寸次以歩法五十寸約之得七千三百八十三寸五分歩之三次以里法三百六十歩約之得二十里一百八十三歩五分歩之三為山髙次以法四寸乘表高二丈三尺得九百二十為逺法以退後表三丈一尺三寸乗髙實一百四十七萬六千七百二十寸得四億六千二百二十一萬三千三百六十寸為逺實實如逺法九百二十寸而一得五十萬二千四百五寸二十三分寸之一十九為積寸乃以歩法五十寸乗逺法九百二十得四萬六千寸為法亦除逺實得一萬四十八歩不盡五千三百六十與法求等得八十俱以約之得五百七十五分歩之六十七又以里法三百六十歩約得二十七里三百二十八歩五百七十五分歩之六十七為山去後表入立望處等圖如後$$$$$$$$$$$$乃以頭位八千二百四寸乗中一百八十寸得一百四十七萬六千七百二十寸為髙寔$$$$$$$$$$$$$$$$$$$$$$$$$$$$乃以歩法五十寸乗中位逺法九百二十寸得下位四萬六千寸為後圖中位歩寸法$$$$$$$$$$乃以中除上得下位里數及零歩其不盡寸與法求得八十俱約之為歩分母子之數",
        "procedure_index": 0,
        "id": "數書九章_4_#0"
    },
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#1",
        "text": "術曰以勾股重差求之置短去目下寸為法以人目併岸髙減去法餘乗人矩端為實如法而一得水闊陡岸測水圗",
        "sketch": "草曰置矩本去目下五寸為法以入目髙五尺併岸髙三丈得三丈五尺通為寸得三百五十寸减去五寸餘三百四十五寸乗沙際入矩端三十四寸得一萬一千七百三十寸為實實如法五寸而一得二千三百四十六寸展為二十三丈四尺六寸為水闊合問",
        "procedure_index": 1,
        "id": "數書九章_4_#1"
    },
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#2",
        "text": "術曰以勾股重差求之置城東南隅景入表减表間餘乗表間為城去木寔以西方歩減城東北隅景入表餘為法得城去木數以城東北隅景入表減表間餘乗表間為廣實實如前法而一得城廣表望方城圖",
        "sketch": "草曰以西行一十步減東北隅入表一十五步餘五歩為法以城東南隅景入表四十八步七分半減表間一百六十步餘一百一十一歩二分半乗表間一表六十歩得一萬七千八百為城去木寔以法五歩除之得三千五百六十歩以里法三百六十約之得九里三百二十步為城去木里及步數次置城東北隅京十表一十五步减表間一百六十餘一百四十五歩乗表間一百六十得二萬三千二百為减實以以前法五步除之得四千六百四十歩以里法三百六十約之為一十二里三百二十歩即城方廣里及歩數合問遥度城",
        "procedure_index": 2,
        "id": "數書九章_4_#2"
    },
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#3",
        "text": "術曰以勾股夕桀求之一為從隅五因北外里為從七亷置北里冪八因為從五亷以北里冪為正率以東行冪為負率二率差四乗北里為益從從三亷倍負率成五亷為益上亷以北里乗上亷為實開玲瓏九乗方得數自乗為徑以三因徑得周遥度圓城",
        "sketch": "草曰以一為從隅以五因北三里得一十五里為從七亷以北三里自乗得九里為正率以八因率得七十二為從五亷以西行見里自乗得八十一為負率以正率九減負率餘七十二位負差以四因之得二百八十八以乗北三里得八百六十四係負差所乗者為益三亷倍負率八十一得一百六十二乗五㢘七十二得一萬一千六百六十四為益上亷以北三里乗上亷得三萬四千九百九十二為實置實亷隅玲瓏空隅位方亷以約實衆法不可超進乃于實上定商三里其隅與商相生得三為從下亷又與商相生入從七亷共得二十四為星亷又與商相生得七十二為從六亷又與商相生入五内共得二百八十八又與商相生得八百六十四為從四亷又與商相生得二千五百九十二為正三亷内消益三亷八百六十四訖餘一千七百二十八為從三亷又與商相生得五千一百八十四為從二亷又與商相生得一萬五千五百八十二為從上亷内消益上亷一萬一千六百六十四訖餘三千八百八十八為正上亷又與商相生得一萬一千六百六十四為從方乃命上商三里除實適盡得三里以自乗之得九里為城圓徑之里數又以故法圓率三因之得二十七為城周$$$$$$$$$$$$$$$$$$$$$$$$$$$$以上求率圖以後開方圖實與益皆負畫黑商與從皆正畫朱$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$法列寔及方亷隅数約商九里乃以隅生商得九入下亷得一十五又以下亷生商得一百三十五入上亷得一百四十四又以商生上亷得一千二百九十六以消益方得二百二十四為從方以商生從方得二千九百一十六減實恰盡為開得三乘方為九里即城徑也",
        "procedure_index": 3,
        "id": "數書九章_4_#3"
    },
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#4",
        "text": "術曰以勾股夕桀求之置表間自乗為勾冪以退表自乗為股冪併二冪為弦冪置里通步自之乗勾冪為率自乗為泛實半弦冪乗率為泛從上亷以勾冪減股冪餘四約之自乗為泛益隅開連枝三乗玲瓏方得營徑以密率二千二乗七除為周",
        "sketch": "草曰置表間二步自乗得四為勾冪以退表一十二步自乗得一百四十四為股冪以勾股二冪併之得一百四十八為弦冪置七里以里法三百六十步通之得二千五百二十步自乗得六百三十五萬四百乗勾冪四得二千五百四十萬一千六百為率以率自乗得六百四十五萬二千四百一十二億八千一百五十六萬為之實乃半弦冪得七十四乗率二千五百四十萬一千六百得一十八億七千九百七十一萬八千四百為泛從上亷以勾冪四減股冪一百四十四餘一百四十以四約之得三十五以自乗得一千二百二十五為泛益隅置三泛求等得一千二百二十五俱以約之得五千二百六十七億二千七百五十七萬七千六百為定實一百五十三萬四千四百六十四為從上亷一為定益隅開玲瓏三乗方乃以亷隅超二度約啇置七百上亷為一百五十三億四千四百六十四益隅為一億乃以上啇生隅得七億為益下亷又以上啇生益亷減從亷餘一百四億四千四百六十四萬為從上亷又以上啇生從亷得七百三十一億一千二百四十八萬為從方乃命上啇除實實餘一百四十九億四千二十一萬七千六百又以上啇生益隅入下亷得一十四億為益下亷又以上啇生益亷得益上亷減從亷餘六億四千四百六十四萬為上亷又以上啇生上亷入方得七百七十六億二千四百九十六萬為方又以上啇生益隅入下亷得二十一億又以上啇生下亷為益上亷減從亷餘一百四十億五千五百三十六萬為益上亷又以上啇生益隅入下亷得二十八億諸法皆退方一退為七十七億六千二百四十九萬六千益上亷再退為一億四千五十五萬三千六百益下亷三退為二百八十萬益隅四退為一萬乃於上啇之次續啇置二十步以續啇生隅入下亷為二百八十二萬又以續啇生下亷入上亷為一億四千六百一十九萬三千六百又以續啇生上亷減從方餘七十四億七千一十萬八十八百乃命續啇除實適盡所得七百二十步以里法約之得二萬為營徑次以密率二十二乗七百二十得一萬五千八百四十為實以七除之得二千二百六十二步七分步之六以里法約之得六里一百二步七分步之六為營周表間表間勾冪步退表退表股冪步$$$$$$勾冪股冪注冪里數里法隅步$$$$$$得得得冪率率$$$$$$泛實車旌冪率泛從上廉勾冪股冪餘約法得得泛益隅置三泛求等得$$$$$一千三百二十五以約三泛數泛實步泛從上廉泛益隅等數$$$$以等約之商實方從上廉益上廉益下廉以商生下廉$$$$$$$隅得益上廉相消從上廉得上廉商實方上廉下廉以商生上廉$$$$$$隅入方得後方商實方上廉下廉以商生復生$$$$$$隅隅入下廉商實方下廉上廉又以商生下$$$$$$隅廉得益上廉商實方從上廉益上廉下廉$$$$$$$隅上廉益從相消商實方益廉下廉$隅還以商生$$$$$隅入下廉商上廉下廉從方一退$$$$$$隅上廉再退下廉三退益隅四退商實方上廉下廉續以商生隅$$$$$$隅入下廉商實方上廉下廉$隅又以商生下$$$$$廉入上廉商實方上廉下廉再以商生上$$$$$$隅廉消從方商實方上廉下廉乃以從方命$$$$$$隅續商除實適盡",
        "procedure_index": 4,
        "id": "數書九章_4_#4"
    },
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#5",
        "text": "術曰以勾股乗之置人退表步乗入表為實以人目髙為法除之得徑以密周率乗徑得數為實以密徑率因人立為法約之得外周人數餘収為一副置加六以乗副得數為實如一十二而一餘亦収為全望知敵衆圖",
        "sketch": "草曰置人立退表三十步以步法五尺展為五十寸通之得一千五百寸乗入表八尺得一十二萬寸為實人退表步尺寸寸$$$$寸入表寸寸$$$以人目髙四十八寸為法除之為徑實寸寸$$$以密率周法二十二乗徑二千五百得五萬五千寸為實為盡密周實寸$$$以密率徑法七因諜稱人立八尺得五百六十為法密得法人立法寸$$$商實寸法寸$$$以法五百六十寸約實五萬五千寸得九十八人為外周人數不盡一百二十寸棄之外周棄余寸法$$$副置外周九十八人加六得一百四人乗副為實副政圓差人得$$$$商實人法以十二為法$$$商實法以法退一步$$$商實法法進二商八百$$$實法法退商四千$$$敵眾人盡數法得八百四十九$$不盡$為敵眾不盡棄之",
        "procedure_index": 5,
        "id": "數書九章_4_#5"
    },
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#6",
        "text": "術曰以勾股求之重差入之置人目髙以表髙減之餘為法置退表乗表髙為實實如法而一",
        "sketch": "草曰置人目髙四尺八寸減表髙四尺餘八寸為法置退表九百步以步五十寸通之得四萬五千寸乗表髙四十寸得一百八十萬寸為實如法八寸而一得二十二萬五千寸以步法五十寸約之得四千五百步為相去步以里法三百六十步約之得一十二里半為敵去表所合問",
        "procedure_index": 6,
        "id": "數書九章_4_#6"
    },
    {
        "source_title": "數書九章",
        "source_juan": 4,
        "name": "#7",
        "text": "術曰以勾股求之重差入之置鋦數減一餘乗鋦相去數併一枚長數加竿本共為表竿髙以退表為法以人目髙減表竿髙餘乗竿去塔為實實如法而一得數加表竿髙共為塔髙置相輪入本鋦數減一餘乗鋦相去又乗竿去塔為實實如法而一得相輪髙以減塔髙餘為塔身髙以益㔼卯尺數為塔心木長",
        "sketch": "草曰置鋦一十四枚減一餘一十三以乗鋦相去二尺五寸得三百二十五寸併最上鋦一枚長五寸得三百三十寸又加竿本九尺二寸共得四百二十二尺為表竿髙以人退表三丈通為三百寸為法次以人目髙四尺八寸減表竿髙四百二十二寸餘三百七千四寸以乗竿去塔六丈得二十二萬四千四百寸為實實如法三百兩一得七百四十八寸加表竿髙四百二十二寸得一千一百七十寸以十約之為一十一丈七尺為塔髙置相輪本入第七鋦減一餘六以乗鋦相去二尺五寸得一百五十寸又乗竿去塔六丈得九萬寸為實實如前法三百寸而一得三百寸約為三丈得相輪髙以相輪髙三丈減塔髙一十一丈七尺餘八丈七尺為塔身髙益三尺為剪截㔼卯共得九丈為塔心木長合前問",
        "procedure_index": 7,
        "id": "數書九章_4_#7"
    }
]