[
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#0",
        "text": "術曰先距前後年數為法置前測曰刻分减後測曰刻分餘為率以紀䇿累加之今及天道合用五日以上數為實以法除實得嵗餘去全日餘為斗分以所求中間年上距前測年數乘嵗餘益入前測日刻分滿紀䇿去之餘為所求氣骨",
        "sketch": "草曰置前測戊午嵗距前嵗庚寅嵗得三十三為法置前測戊午嵗冬至三十九日九十二刻四十五分減後測紹定三年庚寅嵗冬至三十二日九十四刻一十二分今後測者少不及前測者以減乃加紀法六十日於後測日内得九十二日九十四日一十二分然後用前測者減之餘五十三日一刻六十七分為率按術當以法三十三餘率須使啇數必得五日以上乃可今率未得五日乃兩度累加紀法一百二十入率内共得一百七十三日一刻六十七分為刻實如法除之得五日二十四刻二十九分三十杪三十小分為嵗餘乃去全五日得二十四刻二十九分三十杪三十小分為斗分次推嘉泰甲子上距慶元戊午嵗得六以乘嵗餘五日二十刻刻二十九分三十杪三十小分得三十一日四十五刻七十五分八十一杪八十小分益入前測戊午嵗三十九日九十二刻四十五分得七十一日三十八刻二十分八十一杪八十小分滿紀法六十去之餘一十一日三十八刻二十分八十一杪八十小分為所求甲子氣骨之數合問治厯推閏",
        "procedure_index": 0,
        "id": "數書九章_2_#0"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#1",
        "text": "術曰以日法各通氣朔日刻分杪各為氣骨朔骨分其氣骨分如約率而一約盡者為可用然後與朔骨分相減餘為閏骨率以日法約之為閏骨䇿",
        "sketch": "草曰置本厯曰法一萬六千九百先通冬至一十一日四十四刻六十一分五十四杪得一十九萬三千四百四十分二十六小分為實其歴約率係三千一百二十以約之得六十二可用其餘小分二十六乃弃之只用一十九萬三千四百四十為氣骨分次置朔一日七十五刻五十五分六十二杪以本厯日法一萬六千九百乘之得二萬九千六百六十八分九十九杪七十八小分將近一分故於氣骨内所弃二十六小分借二十二小分以補朔内收上得二萬九千六百六十九為朔然後以朔骨分減氣骨分餘有一十六萬三千七百七十一為閏骨率復以日法除之得閏骨䇿九日六十九刻五分九十一杪不盡一百二十一筭直命之為一百六十九分杪之一百二十一合問治厯演紀",
        "procedure_index": 1,
        "id": "數書九章_2_#1"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#2",
        "text": "術曰以厯法求之大衍入之調日法如何承天術用强弱母子互乘得數併之為朔餘以二十九日通日法增入朔餘為朔率又以日法乘前厯所測冬至氣刻分收棄末位為偶數得斗分與日法用大衍術入之求等數因率蔀率以紀乘等數為約率置所求氣定骨如約率而一得數以乘因率滿蔀率去之不滿以紀法乘之為入元嵗次置嵗日以日法通之併以斗定分為嵗率以十二月乘朔率減嵗率餘為嵗閏以嵗閏乘入元嵗滿朔率去之不滿為入閏與閏骨相減之得差必在刻分法半數以上却以閏泛骨併朔率得數内减入閏餘與朔率求閏縮以紀法乘日法為紀率以等數約之為氣元率以氣元乘嵗閏滿朔率去之不滿為元閏虗置一億減入元嵗餘為實元率除之得乘限乃以元閏與朔率用大衍入之求得等數因數蔀數以等約閏縮得數以因數乘之滿蔀數去之不滿在乘限以下以乘元率為朔積年併入元嵗為演紀積年又加成厯年今人相乘演積年其術如調日法求朔餘朔率立斗分嵗餘求氣骨朔骨閏骨及衍等數約率因率蔀率求入元嵗嵗閏入閏元率元閏已上皆同此術但其所以求朔積年之術乃以閏骨減入閏餘為之閏贏却與閏縮朔率列號甲乙丙丁四位除乘消減謂之方程乃求得元數以乘元率所得為之積年加入元嵗共為演紀嵗積年所謂方程正是大衍術非特置筭繁多初無定法可傳甚是惑悮後學易失古人之術意故今術不言閏贏而曰入閏差者蓋本將來可用入元嵗便為積年之意故今止將元閏朔率二項以大衍先求等數因數蔀者仍倣前前求入元嵗之術理假閏骨如氣骨以等數為約數及求乘數蔀數以等約閏縮得因乘數滿蔀去之不滿在限下以乘元率便為朔積年亦加入元嵗共為演紀積年此術非惟止用乘除省便又且於自然中取見積年不惑不差矣新術敢不用閏贏而求者實知閏贏已存於入閏之中但求朔積年之竒分與閏縮等則自與入閏相合必滿朔率所去故也數理精微不易窺識窮年致志感於夢寐幸而得知謹不敢隐",
        "sketch": "草曰本厯以何承天術調得一萬六千九百為日法係三百三十九强一十七弱先以强數三百三十九乘强子二十六得八千八百一十四於上次以弱數一十七乘弱子九得一百五十三併上共得八千九百六十七為朔餘次以日法通朔䇿二十九日得四十九萬一百增入朔餘得四十九萬九千六十七為朔率又以日法乘統天厯所測毎嵗冬至周日下二十四刻三十一分得四千一百八分三十九杪為斗泛分驗八分既偶遂棄三十九杪只以四千一百八分為斗定分與日法以大衍術入之□得五十二為等數一百四十四為因率三百二十五為蔀率以甲子六十為紀法乘等數得三千一百二十為約率却置本厯上課所用嘉泰甲子嵗氣骨一十一日四十四刻六十一分五十一杪以乘日法得一十九萬三千四百四十分二十六杪為氣泛骨欲滿約率三千一百二十而一故就近乃棄微杪只以一十九萬三千四百四十為氣定骨然後以約率三千一百二十除之得六十二以因率一百四十四乘之得八千九百二十八滿蔀率三百二十五去之不滿一百五十三以紀法六十乘之得九千一百八十年為入元嵗次置嵗三百六十五以日法乘之得六百一十六萬八千五百併斗定分四千一百八得六百一十七萬二千六百八為嵗率却以十二月乘朔率四十九萬九千六百七得五百九十八萬八千八百四率内減去此數餘一十八萬三千八百四為嵗閏以嵗閏乘入元嵗九千一百八十得一十億八千七百三十二萬七百二十滿朔率去之不滿四十七萬四千二百六十為入閏次置本厯所用嘉泰甲子嵗天正十一月朔一日七十五刻五十五分六十二杪以日法乘之得二萬九千六百六十八分九千九百七十八杪為朔泛骨就近收杪為一分共得二萬九千六百六十九為朔定骨數然後乃以朔定骨減氣骨一十九萬三千四百四十餘一十六萬三千七百七十一為閏泛骨置日法以二百歸除之得八十四半為半刻法次以入閏數内減去閏泛骨與入閏相課減之餘三十一萬四百八十九為差半刻法以上乃以閏泛骨併朔率共得六十六萬二千八百三十八以入閏四十七萬四千二百六十減之餘一十八萬八千五百七十八在朔率下便為閏縮次以紀䇿六十乘日法得一百一萬四千為紀率以等數五十二歸除紀率得一萬九千五百為氣元率以氣元率乘嵗閏一十八萬三千八百四得三十五億八千四百一十七萬八千滿朔率去之不滿三十七萬七千八百七十三為元閏次置一億以入元嵗元千一百八十減之餘九千九百九十九萬八百二十為實以元率一萬九千五百為法除之得五千一二十七為乘元限數乃以元閏三十七萬七千八百七十三餘與朔率四十九萬九千六十七用大衍術求之得等數一因等四十五萬七千九百九十九蔀數四十九萬九千六十七然後以等數一約閏縮只得一十八萬八千五百七十八以因數四十五萬七千九百九十九乘之得八百六十三億六千八百五十三萬五千四百二十二滿蔀數四十九萬九千六百七十去之不滿四百二在乘元限數以下為可用以乘元率一萬九千五百得七百八十三萬九千年為數積年併入元嵗九千一百八十共得七百八十四萬八千一百八十為嘉泰四年甲子嵗積算本厯係於丁夘嵗進呈又加丁夘三年共為七百八十四萬八千一百八十三年為本厯積年合具繪圖如後$$$$何承天調日法強弱四率$$$$$$$$$$$$$$條以減第四條餘一十七為第六條是第五條即强母數第六條即弱母數矣次用第五條第六條轉求第一條以取兩子數置第六條於上二因第五條加之得第五條者二第六條者一共六百九十五為第四條以第四條加第五條得第五條者三第六條者一共一千零三十四為第三條七因第三條以加第四條得第五條者二十三第六條者八共七千九百三十三為第二條以第二條加第三條得第五條者二十六第六條者九共八千九百六十七為第一條是第五條倍數即强子數第六條倍數即弱子數矣至算式中以日法取强母數者則又以第五條第六條再約而得者如以第五條為實第六條為法為法商之初商得十以法乘初商得一百七十為初商積減實餘一百六十九恰與百分日法分之一等故百除日法分為一數又三乘之得五百零七為實以四十九為法初商得十初商積為四百九十減實餘十七乃以商十乘十七得一百七十與前初商積等故加與前餘積等之百分日法分之一得三百三十九為五條之數名之曰强數也次以日法乘朔䇿日得數併朔餘為朔率$$$$$$$$$斗分見偶則棄見竒則收為偶$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
        "procedure_index": 2,
        "id": "數書九章_2_#2"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#3",
        "text": "術曰以方程法求之置見日減一餘半之為見率以伏日併見日為初行法以法半之如見率共為伏率以伏日乘伏率為伏差以見日乘見率為見差以伏日乘見差於上以見日乘伏差減上餘為法以見日乘伏度為泛以伏日乘見度減泛餘為實實滿法而一為度不滿退除為分杪即得日差法以合伏日除伏行度得二十三分為合伏日折中第八日四十五分一日之行度以順行日除順行度得十五分為順行日折中第五十六日五十分一日之行度兩一日之行度相減行七分為合伏第八日四十五分與順行第五十六日五十分兩一日之行度較為實併合伏順行兩日數而半之得六十四日為合伏第八日四十五分至順行五十六日五十分之積日為法除之得十一杪為一日遞差之數即日差若不先用除則以兩日數與兩行度互乘相減為實兩日數相乘又併兩日數而半之再乘為法得數亦同求初行率置初法減一餘乘日差為寄以半初行法乘寄得數又加伏見度共為初行實以法退除之得合伏日初行率求未行率以段日乘日差減初行率餘為末行率求平行率以初行率併未行率而半之為平行率求交段差以各段常日下分數減全日一百分餘乗末日行率為交段差累減前段積度以益後段積度各為常度中專解於後",
        "sketch": "草曰以伏日隨伏度為右行以見日隨見度為左行以度對度日對日其度於上日於中空其下列之$$$$$$$$$$$$$$$$$$置見日一百一十三減一餘一百一十二以半之得五十六為見率以伏日一十六日九十分併見日一百一十三得一百二十九日九十分為初行法$$$$$$$$$$$$$$$$$$$$$$$以初行法半之得六十四日九十五分併見率五十六日得一百二十日九十五分為伏率以初行法寄之以伏率歸右下以對見率仍分左右兩行為首圖$$$$$$$$$$$$以首圖伏日一十六日九十分乗伏率一百二十日九十五分得二千四十四日五分五十杪為伏差於右下以首圖見日一百一十三乘見率五十六得六十三百二十八日為見差於左下乃成次圖凡方程之術先欲得者存之以未欲得者互偏乘兩行諸數今驗此圖先欲得日差故存其左右之上下以左右之中伏見日數互偏乘兩行乃以次圖右中伏日一十六日九十分先偏乘左行畢左上得三百一度三十二分七十杪左中得一千九百九日七十分左下得一十萬六千九百四十三日二十分又以次圖左中見日一百一十三偏乗右行畢右上得四百四十日七十分右中亦得一千九百九日七十分右下得二十三萬九百七十八日二十一分五十杪$$$$$$$$$$$$以兩行得變名泛積法而成才圖乃驗才圖左上下皆少用減右行畢行上餘一百三十九度三十七分三十杪為日差實右中空右下得一十二萬四千三十五日一分五十杪為日差法今維圖法多實少除得空度空分十一杪二十三小分六十五小杪不盡十杪五十五小分三十九小杪五十二微分五十微杪收為一小杪為日定差一十一杪二十三小分六十六小秒$$$$$$$$既得日差乃行初行率置法圖内初行法一百二十九日九十分内減去一日餘一百二十八日九十分乗日差一十一杪二十三小分六十六小杪得空度一十四分四十八杪三十九小分七十七小杪四十微分為寄次置$$$$$$$以得數加伏度三度九十分見度一十七度八十三分共得三十一度一十三分七十三杪四十三小分三十二小杪一十三微分為初行實如初行法一百二十九日九十分而一乃行空度二十三分九十七杪為伏合初日行率餘三杪一十三分分三十二小杪一十三微分棄之$$$$$求末行率置合伏段日數一十六日九十分乗日差一十一杪二十三小分六十六小杪得一分八十九杪八十九小分八十五小杪四十微分為得數乃以得數減初行率二十三分九十七杪餘二十二分七杪一十小分一十四小杪六十微分為合伏末日行率但注曆收棄小分以下餘數為定$$$$$求平行率置初行率二十三分九十七杪併末行率二十三分七杪得四十六分四杪以半之得二十三分二杪為平行率$$$$$求交段差置合伏日下減全日一百分餘一十分乘末行率二十二分七杪得二分二十杪七十小分為交段差$$$$$求晨疾初段常度置合伏日一十六日九十分乃收九十分作一日通為一十七日併舊厯所注晨疾初段常日三十得四十七為共日乗合伏初行率二十三分九十七杪得一十一度二十六分五十九杪為寄上$$$$$$$乃副置共日四十七減一餘四十六以半之得二十三乗副四十七得一千八十一以乗日差一十一杪二十三小分六十六小杪得一度二十一分四十六杪七十六小分四十六小杪以減上寄一十一度一十六分五十九杪餘一十度五分一十二杪二十三小分五十四小杪為合伏晨疾初兩段共積度置共積内減合伏三度九十分餘六度一十五分一十二杪二十三小分五十四小杪為泛次以交段差二分二十杪七十小分減泛餘六度一十二分九十一杪五十三小分五十四小杪為晨疾初段常度注厯乃收八杪五十六小分四十六小杪為全分常定度$$$$$$$$$$$$$$$$$$$$$求晨疾初段初行率以日差一十一杪二十三小分六十六小杪減合伏末行率二十二分七杪餘二十一分九十六杪為晨疾初段初行率行泛收之為定者也$$$$$求晨疾初末行率置晨疾初常日三十減一餘二十九日乗日差一十一杪二十三小分六十六十小杪得三分二十五杪八十六小分一十四小杪以減晨疾初段初行率泛二十一分九十五杪七十六小分三十四小杪餘一十八分六十九杪九十小分二十小杪為晨疾初末行率$$$$$$$$$$求平行率以晨疾初初行泛二十一分九十五杪七十六小分三十四小杪併晨疾初末泛一十八分六十九杪九十小分二十小分得四十分六十五杪六十六小分五十四小杪以半之得二十分三十二杪八十三小分二十七小杪為晨疾初平行泛乃以三泛收棄為之定$$$$$$$$$$$$$$",
        "procedure_index": 3,
        "id": "數書九章_2_#3"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#4",
        "text": "置臨安府所測冬至景一丈八寸二分二十五杪以夏至景九寸一分減之餘九尺九寸一分二十五杪為景差以為實$$$置象限度九十一度三十一分四十四杪加一十一度二十五分二十七杪五十小分命度為寸得一百二寸五十六百七十一分五十杪為法以除前差實得空寸九十六百六十四分四十杪不盡棄之自乗得節泛數九千三百四十分不盡棄之$$$$$$$$$$先以小暑節乗率二十五乗節率九千三百四十分得二十三寸三千五百分於上$$$次以臨安夏至九寸一分自乗得八十二寸八千一百分為夏至冪$$$$乃以夏至冪加上得一百六寸一千六百分為小暑冪以為實以一寸為隅開平方得一尺三分為臨安小暑節景不盡七百分即寸下七毫棄之$$$$又以大暑乗率一百九乗節率九千三百四十分得一百一寸八千六十分於頭位$$$仍以夏至冪八十二寸八千一百分加頭位一百一寸八千六十分得一百八十四寸六千一百六十分為大暑冪以為實以一寸為隅開平方得一尺三寸五分八十七杪為大暑不盡棄之$$$$$$$$$$又置立秋乗率二百八十九乗節率九千三百四十分得二百六十九寸九千二百六十分於上$$$仍置夏至冪八十一寸八千一百分加於上二百六十九寸九千二百六十分得三百五十二寸七千三百六十八為立秋冪$$$置立秋冪為實以一寸為隅開平方得一尺八寸七分八十一杪為立秋景不盡棄之$$$$$$$乃驗陽城夏至景一尺四寸七分七十九杪在大暑後立秋前乃置大暑一尺三寸五分八十七杪併立秋景一尺八寸七分八十一杪得三尺二寸三分六十八杪以半之得一尺六寸一分八十四杪為大暑後九日景又以九日景併大暑景得二尺九寸七分七千一杪以半之得一尺四寸八分八十五杪半為大暑後五日景$$$$$$$$$$乃以大暑景得五日景得二尺八寸四分七十二杪半以半之得一尺四寸二分三十六杪少為大暑後三日景$$$$又以五日景得三日景得二尺九寸一分二十一杪大以半之得一尺四寸五分六十杪八十七小分五十小杪為大暑後四日景$$$$今驗陽城夏至景一尺四寸七分七十九杪為入臨安府大暑後四日景一尺四寸五分六十杪太強乃以四日減五日景餘三分二十四杪太弱為景差以十二時除之得二十七杪五小分二十小杪為法$$$$$$$乃置陽城夏至景一尺四寸七分七十九抄減臨安大暑後四日景一尺四寸五分六十杪八十七小分五十小杪餘二分一十八杪一十二小分五十小杪為實後以法二十七杪五小分二十小杪除之實如法而一得商數八有餘命大暑四日午後數八辰得大暑五日寅時景與陽城夏至之日午景等$$$$$$$$求較以大衍厯晷景所差乃置陽城大暑景長一尺九寸五分七十六杪併陽城立秋景二尺五寸三分三十一杪得四尺四寸九分七杪以半之得二尺二寸四分五十三杪半為次暑後九日午中景$$$$置九日景復併大暑景一尺九寸五分七十六抄得四尺二寸二十九杪半以半之得二尺一寸一十四杪太為大暑後五日景$$$$$今驗開禧厯所推臨安府大暑後五日午中景一尺四寸八分八十五杪半與陽城大暑後五日午中景尺一寸一十四杪太課之$$乃以臨安府五日景減陽城五日景差六寸一分二十九杪少$",
        "sketch": "草曰置臨安府所測冬至景一丈八寸二分二十五抄以夏至景九寸一分減之餘九尺九寸一分二十五抄為景差以為實置象度九十一度三十一分四十四杪加一十一度二十五分二十七杪半命度為寸得一百二寸五千六百七十一分半為法除實得空寸九千六百六十四分四十杪以自乗之得空寸九千三百四十分為節率先以小暑乗率二十五乗之得二十三寸三千五百分於上次以臨安夏至景九寸一分自乗得八十二寸八千一百分為夏至景冪以加上得一百六寸一千六百分為小暑景冪開平方以一寸為隅開之得一尺三分為小暑景又以大暑乗率一百九乗節率九千三百四十分得一百一寸八千六十分於上仍加夏至冪八十二寸八千一百分得一百八十四寸六千一百六十分為大暑冪以為實一寸寸為隅開平方得一尺三寸五分八十七杪為大暑景又置立秋乗率二百八十九乗節率九千三百四十分得二百六十九寸九千二百六十分於上仍加夏至冪八十二寸八千一百分共得三百五十二寸七千三百六十為立秋冪以為實以一寸為隅開平方得一尺八寸七分八十一抄為立秋景乃驗陽城夏至景一尺四寸七分七十九杪在大暑後立秋前乃併大暑立秋二景半之得一尺六寸一分八十四杪為大暑後九日景又併大暑景半之得一尺四寸八分八十五杪半為大暑後五日午中景又併大暑景得數半之得一尺四寸二分三十六杪少為大暑後三日景又併五日景一尺四寸八分八十五杪半得數半之得一尺四寸五分六十杪强為大暑後四日景驗得陽城夏至景入臨安大暑後四日乃以四日景減五日景餘三分二十四杪太弱為差以十二時除之得二十七杪五小分二十小杪為法復除陽城景與本日景差二分一十八杪一十二小分五十小杪得八命外為在初五日寅時景等求較以大衍厯晷景所差乃置陽城大暑景長一尺九寸五分七十六杪併陽城立秋景二尺五寸三分三十一杪得四尺四寸九分七杪以半之得二尺二寸四分五十三杪半為大暑後九日午中景復併暑景一尺九寸五分七十六杪得四尺二寸二十九杪半以半之得二尺一寸一十四杪太為大暑後五日暑以較今開禧厯當日景一尺四寸八分八十五杪半差少六寸一分二十九杪少合問接集中皆術在前草次之圖在後此條之例不同天池測雨",
        "procedure_index": 4,
        "id": "數書九章_2_#4"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#5",
        "text": "術曰盆深乗底徑為底率二徑差乗水深併底率為靣率以盆深為法除靣率得面徑以二率相乗又各自乗三位併之乗水深為實盆深乗口徑以自之又三因為法除之得平地水深",
        "sketch": "草曰以盆深及徑皆通為寸盆深得一十八寸底徑得一十二寸相乗得二百一十六寸為底率置口徑二十八寸減底徑一十二寸餘一十六寸為差以乗水深九寸得一百四十四寸併底率二百一十六寸得三百六十寸為靣率以盆深一十八寸為法除靣率得二十寸展為二尺為水靣徑以底率二百一十六寸乗靣率三百六十寸得七萬七千七百六十寸於上以底率二百一十六寸自乗得四萬六千六百五十六寸加上又以靣率三百六十寸自乗得一十二萬九千六百併上共得二十五萬四千一十六以乗水深九寸得二百二十八萬六千一百四十四寸為實以盆深一十八寸乗口徑二十八寸得五百四寸自乗得二十五萬四千一十六寸又三因得七十六萬二千四十八寸為法除實得三寸為平地雨深合問",
        "procedure_index": 5,
        "id": "數書九章_2_#5"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#6",
        "text": "術曰口徑減底徑餘乗雪深半之自乗為隅以籮深冪乗雪深冪併隅又乗雪深冪為實隅實可約約之開連枝三乗方得平地雪厚",
        "sketch": "草曰列問數各通為寸置口徑一十六寸減底徑一十二寸餘四寸乗雪深一十寸得四十寸以半之得二十寸自乗得四百寸為隅以籮深一十七寸自乗得二百八十九寸為籮深冪次置雪深一十寸自乗得一百寸為雪深冪以乗籮深冪數加隅又乗深冪得二百九十三萬寸為實隅實求等得四百俱約之得七千三百二十五為實得一為隅開三乗方歩法不可超乃約實置商九寸與隅一相生得九為下亷又與商相生八十一寸為上亷又與商相生得七百二十九為從方乃命上商除實不盡七百六十四已而復以商生隅入二亷至方陸續又生畢以方亷隅共併之得三千四百三十九分寸之七百六十四為平地雪厚九寸三千四百三十九分寸之七百六十四合問列問數各通為十口徑得一十六寸深一十七寸底徑一十二寸籮中雪髙一十寸$$$$乃以底徑減口徑餘四寸乗雪深一十寸得四十寸以中得數二十寸自乗得四百寸為隅$$$以籮深一十七寸自乗得二百八十九寸為籮深冪$$$次置雪深一十寸自乗得一百寸為雪深冪$$$以雪深冪一百寸乗籮深冪二百八十九寸得二萬八千九百寸併隅四百寸得二萬九千三百寸為上$$$$$置頭位數二萬九千三百寸又乗雪深冪一百寸得二百九十三萬寸為實開三乗方$$$$$$$以隅實求等得四百俱為約之得七千三百二十五為實一為隅開之$$$$$歩法不可超乃約實置商九寸與隅相生得九為下亷$$$$$下亷九又與商九相生得八十一為上亷$$$$$上亷又與商相生得七百二十九為從方$$$$$乃以從方七百二十九命上商九除實七千三百二十五訖實餘七百六十四既而後以商生隅入下亷$$$$$下亷得一十八又與啇九相生入上亷$$$$$上亷得二百四十三又與商相生入方得二千九百一十六$$$$$又以商九生隅一入下亷一十八内得二十七$$$$$又以商九生下亷二十七入上亷二百四十三内得四百八十六又以商生隅入下亷二十七内得三十六為求圖乃以末圓方亷隅四者併之得三千四百三十九為母以實餘七百六十四為子$$$命為平地雪厚九寸三千四百三十九分寸之七百六十四合問",
        "procedure_index": 6,
        "id": "數書九章_2_#6"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#7",
        "text": "術曰底徑與腹徑相乗又各自乗併之乗半罌深以一十一乗之為下率以四十二為下法除得下積以半罌深併雨深減元罌深餘為上深以口徑減腹徑餘乗上深為次以半罌深乗口徑加次為靣率以半深除靣率得水靣徑以半深乗腹徑為腹率置靣率與腹率相乗又各自乗併之以一十一乗之為上率以半深自乗為冪以乗下法為上法上法除上率得上積半深冪乗下率併上率為總實口徑冪乗上法為總法除實得平地雨髙",
        "sketch": "草曰置底徑八寸與腹徑二十四寸相乗得一百九十二寸於上又底徑八寸自乗得六十四寸加上又腹徑二十四寸自乗得五百七十六寸併上共得八百三十二寸以乗半罌深八寸得六千六百五十六寸又以一十一乗之得七萬三千二百一十六寸為下率置宻率法一十四以所併三因之得四十二為下法以半深八寸併雨深一十二寸得二十寸以減元深一十六寸餘四寸為上深以口徑一十寸五分減腹徑二十四寸餘一十三寸五分以乗上深四寸得五十四寸為次以半罌深八寸乗口徑一十寸五分得八十四寸加次共得一百三十八寸為靣率以半深八寸乗腹徑二十四寸得一百九十二寸為腹率置靣率一百三十八寸與腹率一百九十二寸相乗得二萬六千四百九十六寸於上又以靣率一百三十八寸自乗得一萬九十四十四加上又以腹率一百九十二寸自乗得三萬六千八百六十四併上共得八萬二千四百四寸以一十一乗之得九十萬六千四百四十四寸為上率以半深八寸自乗得六十四寸為半深冪以乗下法四十二得二千六百八十八為上法以半深冪六十四寸乗下率七萬三千二百一十六寸得四百六十八萬五千八百二十四寸併上率九十萬六千四百四十四共得五百五十九萬二千二百六十八寸為總實以口徑一十寸五分自乗得一百一十寸二分五厘以乗上法二千六百八十八寸得二十九萬六千三百五十二寸為總法除實得一尺八寸不盡二十五萬七千九百三十二與法求等得四俱約之為一尺八寸七萬四千八十八分寸之六萬四千四百八十三為平地雨深合問法以腹徑底徑相乗又各自乗併三積以半罌深八寸乗之得六千六百五十六寸為三倍方罌内腹下雨積又以口徑腹徑相減餘一十三寸五分以雨深減罌深餘四寸相乗以半罌深除之得六寸七分五厘與口徑相加得一十七寸二分五厘為雨靣徑與腹徑相乗又各自乗併三積以雨上深四寸乗之得五千一百五十寸二五為方罌内三倍腹上雨積併二雨積得一萬一千八百零六寸二五為方罌内三倍共雨積為實口徑自乗三因得三百三十寸七五為法除實得三尺五寸又一千三百二十三分寸之九百二十為平地雨深若不先用除則以口徑腹徑較與罌深雨深較相乗之五十四寸為雨靣徑口徑較加一半罌乗之數即為雨靣徑口徑較此數既加一半罌乗則諸數皆以半罌乗之得口徑八十四寸腹徑一百九十二寸以口徑與雨靣徑口徑較相加得雨靣徑一百三十八寸與腹徑相乗又各自乗併三冪以腹上雨深四寸乗之得三十二萬九千六百一十六寸為三倍上雨積又以半罌深冪乗前三倍下雨積得四十二萬五千九百八十四寸為三倍下雨積併二積得七十五萬五千六百寸為三倍共雨積為實以半罌深冪乗三因口徑冪得二萬一千一百六十八寸為法除之得數亦同",
        "procedure_index": 7,
        "id": "數書九章_2_#7"
    },
    {
        "source_title": "數書九章",
        "source_juan": 2,
        "name": "#8",
        "text": "術曰以少廣求之連枝入之以去址自乗為隅以墻髙自乗併隅於上以雪厚自之乗上為實開連枝平方得地雪厚",
        "sketch": "草曰以問數皆通為寸置去址五十寸自乗得二千五百為隅以墻髙一百二十寸自乗得一萬四千四百寸併隅得一萬六千九百寸於上以雪厚四寸自之得一十六乗上得二十七萬四百寸為實開連枝平方今隅實可求等得一百俱約之得二千七百四為實得二十五為隅開平方得一十寸四分展為一尺四分為平地雪厚合問勾甲乙為小弦甲丙為小股乙丙為小勾以牆髙大股自乗木去址大勾自乗併之為大弦冪為實以木上雪厚乙丙小勾冪乗之以木去址大勾冪除之得甲乙小弦冪開平方即為平地雪厚也",
        "procedure_index": 8,
        "id": "數書九章_2_#8"
    }
]