[
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#0",
        "text": "術以衰分求之先列本縣色位自下錐行列之又以鄉數對列而乗之副併為法以除官物數得一分之率以率數乗未併者各得諸鄉之數次列各鄉等位自上等置十分每以内分錐行九折之至九等止又各以畝歩乗之副併為鄉法以除諸各鄉所得官物數所得為一分之率以乗未併者各得毎畝税色",
        "sketch": "草曰列本縣色位三自下色例十分中十一分上比中身外加一上得一百二十一中得一百一十下得一百為上中下三率列之右行乃列甲一對上率乙丙共二對中率丁戊己共三對下率列左行乃以左行列數各相對乗右行率數其上得一百二十一其十得二百二十其下得三百乃副置而併之得六百四十一為法置元科苗米一萬三千五百六十七石八斗四升四合三勺為寔以法除之得一百六十一石五斗七升二合三勺為一分之率以未併下率一百乗率得一萬六千一百五十七石二斗三升為丁戊己三鄉各科數以於身下加一得一萬七千七百七十二石九斗五升三合為乙丙二鄉各科數又於身下加一得一萬九千五百五十石二斗四升八合三勺為甲合科數求和買亦用六百四十一為法置元科和買一萬三千四百九十八匹以匹法四丈通之得五萬三千九百九十二丈内零一丈七尺三寸七分六釐得五萬三千九百九十三丈七尺三寸七分六釐為寔以法除之得八十四丈二尺三寸三分六釐為一分之率亦以未併下率一百乗之得八千四百二十三丈三尺六寸為丁戊己三鄉各科數次於身下加一得九千二百六十五丈六尺九寸六分為乙丙二鄉各科數又於身下加一得一萬一百九十二丈二尺六寸五分六釐為甲鄉合科數求夏税亦置六百四十一為法置元科九千八百七十六匹以匹法四丈通之得三萬九千五百四丈内零三丈二尺六寸五分八釐得三萬九千五百七丈二尺六寸五分八釐為寔以法除之得六十一丈六尺三寸三分八釐為一分率亦以未併下率一百乗之得六千一百六十三丈三尺八寸為丁戊己三鄉各科數次於身下加一得六千七百七十九丈七尺一寸八分為乙丙二鄉各科數又於身下加一得七千四百五十七丈六尺八寸九分八釐為甲鄉數次列九等上以十次九八七六五四三二各對乗六鄉九等田畝其田畝下角歩以畝法除之得分釐毫絲忽於畝上對乗之各得率甲上等上田率五萬六千七百八十四分五釐中田率四萬四千二十九分一釐二毫五絲下田率五萬二千九百六十九分八釐中等上田率五萬七千五百七十五分七釐中田率六萬二百一十分一釐五毫下田率八萬二千六百五十分下等上田率八萬四千三百六十分四釐中田率九萬六千一百八十分三毫七絲五忽下田率七萬一百二十三分五釐二毫五絲乙上等上田率六萬七千八百九十四分中田率五萬三千八百八十七分五釐下田率六萬四千八十六分一釐中等上田率五萬二千七百八十七分中田率五萬四千七百二十九分三釐下田率九萬五千三百三十分一釐二毫五絲下等上田率七萬二千一百四十九分一釐中田率二萬八千三百七十分九釐八毫八絲下田無丙上等上田率四萬八千六百八十五分一釐二毫五絲中田率五萬三千八百一十七分九釐七毫五絲下田率五萬五千一百八分二釐中等上田率五萬五千八百八十九分七釐五毫中田率八萬四千三百三十六分三釐下田率一十一萬六千六百六十五分二釐五毫下等上田率一十一萬一千二十分二釐七毫五絲中田無下田率六萬一百四十分二毫五絲丁上等上田率一十一萬一千二十分五毫中田率八萬八千八百八十六分二釐五毫下田率七萬一百二十三分中等上田率五萬二千七百七十四分中田無下田率六萬四千九百三十五分八釐七毫五絲下等上田無中田率一萬六千二百九十六分八釐二毫五絲下田率六萬六千七百二十七分五釐七毫五絲戊上等上田率二十四萬六千三百二十一分六釐二毫五絲中田率一十二萬一千六百九十分一毫二絲五忽下田率七萬九千九百一十分一釐中等上田率六萬二千一百四十分六釐四毫五絲中田率六萬八千二分五釐下田率一十三萬五千三百三十五分下等上田率七萬九千五百七分一釐中田率二十三萬七千四百七分七釐八毫七絲五忽下田率二萬八十三分二釐五毫已上等上田無中田率七萬一百分六釐六毫二絲五忽下田無中等上田率六萬九千九百九十六分五釐八毫七絲五忽中田率六萬五千一十七分四釐一毫下田無下等上田率一十二萬八千三百五十七分七釐六毫中田率一十三萬一千三十六分二釐一毫二絲五忽下田率一十萬八千一百三十五分八釐八毫併六鄉之九率為九鄉之法甲法六十萬四千八百八十三分二釐三毫七絲五忽乙法四十八萬九千二百三十四分一釐一毫三絲丙法五十八萬五千六百六十二分九釐丁法四十七萬七百六十三分五釐七毫五絲戊法一百五萬三百九十八分二毫己法五十七萬二千六百四十四分五釐一毫二絲五忽以六鄉法各除諸鄉官物得一分之率甲鄉苗米三升二合三勺二抄一撮和買一寸六分八釐五毫四忽夏税一寸二分三釐二毫八絲乙鄉苗米三升六合三勺二抄八撮和買一寸八分九釐三毫九絲二忽夏税一寸三分八釐五毫八絲丙鄉苗米三升三勺四抄八撮和買一寸五分八釐二毫一絲夏税一寸一分五釐七毫五絲丁鄉苗米三升四合三勺二抄一撮四圭和買一寸七分八釐九毫三絲夏税一寸三分九毫二絲三忽戊鄉苗米一升五合三勺八抄二撮和買八分一毫九絲二忽夏税五分八釐六毫七絲七忽己鄉苗米二升八合二勺一抄五撮一圭和買一寸四分七釐九絲六忽夏税一寸七釐六毫三絲各用鄉錐行數九八七六五四三二一各乗一分之率為各鄉毎畝等則泛數或自上等上田之則以一分之率累減之亦得甲鄉上等上田苗米三斗二升三合二勺一抄和買一尺六寸八分五釐四絲夏税一尺二寸三分二釐八毫中田苗米二斗九升八勺八抄九撮和買一尺五寸一分六釐五毫三絲六忽夏税一尺一寸九釐五毫二絲下田苗米二斗五升八合五勺六抄八撮和買一尺三寸四分八釐三絲二忽夏税九寸八分六釐二毫四絲中等上田苗米二斗二升六合二勺四抄七撮和買一尺一寸七分九釐五毫二絲八忽夏税八寸六分二釐九毫六絲中田苗米一斗九升三合九勺二抄六撮和買一尺一寸一釐二絲四忽夏税七寸三分九釐六毫八絲下田苗米一斗六升一合六勺五撮和買八寸四分一釐五毫二絲夏税六寸一分六釐四毫下等上田苗米一斗二升九合二勺八抄四撮和買六寸七分四釐一絲六忽夏税四寸九分三釐一毫二絲中田苗米九升六合九勺六抄三撮和買五寸五釐五毫一絲二忽夏税三寸六分九釐八毫四絲下田苗米六升四合六勺四抄二撮和買三寸三分七釐八忽夏税二寸四分六釐五毫六絲乙鄉上等上田苗米三斗六升三合二勺八抄和買一尺八寸九分三釐九毫二絲夏税一尺三寸八分五釐八毫中田苗米三斗二升六合九勺五抄二撮和買一尺七寸四釐五毫二絲八忽夏税一尺二寸四分七釐二毫二絲下田苗米二九升六勺二抄四撮和買一尺五寸一分五釐一毫三絲六忽夏税一尺一寸八釐六毫四絲中等上田苗米二斗五升四合二勺九抄六撮和買一尺三寸二分五釐七毫四絲四忽夏税九寸七分六絲中田苗米二斗一升七合九勺六抄八撮和買一尺一寸三分六釐三毫五絲二忽夏税八寸三分一釐四毫八絲下田苗米一斗八升一合六勺四抄和買九寸四分六釐九毫六絲夏税六寸九分二釐九毫下等上田苗米一斗四升五合三一抄二撮和買七寸五分七釐五毫六絲八忽夏税五寸五分四釐三毫二絲中田苗米一斗八合九勺八抄四撮和買五寸六分八釐一毫七絲六忽夏税四寸一分五釐七毫四絲下田苗米七升二合六勺五抄六撮和買三寸七分八釐七毫八絲四忽夏税二寸七分七釐一毫六絲丙鄉上等上田苗米三斗三合四勺八抄和買一尺五寸八分二釐一毫夏税一尺一寸五分七釐五毫中田苗米二斗七升三合一勺三抄二撮和買一尺四寸二分三釐八毫九絲夏税一尺四分一釐七毫五絲下田苗米二斗四升二合七勺八抄四撮和買一尺二寸六分五釐六毫八絲夏税九寸二分六釐中等上田苗米二斗一升二合四勺三抄四撮和買一尺一寸七釐四毫七絲夏税八寸一分二毫五絲中田苗米一斗八升二合八抄八撮和買九寸四分九釐二毫六絲夏税六寸九分四釐五毫下田苗米一斗五升一合七勺四抄和買七寸九分一釐五絲夏税五寸七分八釐七毫五絲下等上田苗米一斗二升一合三勺九抄二撮和買六寸三分二釐八毫四絲夏税四寸六分三釐中田苗米九斗一合四抄四撮和買四寸七分四釐六毫三絲夏税三寸四分七釐二毫下田苗米六升六勺九抄六撮和買三寸一分六釐四毫二絲夏税二寸三分一釐五毫丁鄉上等上田苗米三斗四升三合二勺一抄四撮和買一尺七寸八分九釐三毫夏税一尺三寸九釐二毫三絲中田苗米三斗八合八勺九抄二撮六圭和買一尺六寸一分三毫七絲夏税一尺一寸七分八釐三毫七忽下田苗米二斗七升四合五勺七抄一撮二圭和買一尺四寸三分一釐四毫四絲夏税一尺四分七釐三毫八絲四忽中等上田苗米二斗四升二勺四抄九撮八圭和買一尺二寸五分二釐五毫一絲夏税九寸一分六釐四毫六絲一忽中田苗米二斗五合九勺二抄八撮四圭和買一尺七分三釐五毫八絲夏税七寸八分五釐五毫三絲八忽下田苗米一斗七升一合六勺七撮和買八寸九分四釐六毫五絲夏税六寸五分四釐六毫一絲五忽下等上田苗米一斗三升七合二勺八抄五撮六圭和買七寸一分五釐七毫二絲夏税五寸二分三釐六毫九絲二忽中田苗米一斗二合九勺六抄四撮二圭和買五寸三分六釐七毫九絲夏税三寸九分二釐七毫六絲九忽下田苗米六升八合六勺四抄二撮八圭和買三寸五分七釐八毫六絲夏税二寸六分一釐八毫四絲六忽戊鄉上等上田苗米一斗五升三合八勺二抄和買八寸一釐九毫二絲夏税五寸八分六釐七毫七絲中田苗米一斗三升八合四勺三抄八撮和買七寸二分一釐七毫二絲八忽夏税五寸二分八釐九絲三忽下田苗米一斗二升三合五抄六撮和買六寸四分一釐五毫三絲六忽夏税四寸六分九釐四毫一絲六忽中等上田苗米一斗七合六勺七抄四撮和買五寸六分一釐三毫四絲四忽夏税四寸一分七毫三絲九忽中田苗米九升二合二勺九抄二撮和買四寸八分一釐一毫五絲二忽夏税三寸五分二釐六絲二忽下田苗米七升六合九勺一抄和買四寸九毫六絲夏税二寸九分三釐三毫八絲五忽下等上田苗米六升一合五勺二抄八撮和買三寸二分七毫六絲八忽夏税二寸三分四釐七毫八忽中田苗米四升六合一勺四抄六撮和買二寸四分五毫七絲六忽夏税一寸七分六釐二絲一忽下田苗米三升七勺六抄四撮和買一寸六分三毫八絲四忽夏税一寸一分七釐一三毫五絲四忽己鄉上等上田苗米二斗八升二合一勺五抄一撮和買一尺四寸七分九毫六絲夏税一尺七分六釐三毫中田苗米二斗五升三合九勺三抄五撮九圭和買一尺三寸二分三釐八毫六絲四忽夏税九寸六分八釐六毫七絲下田苗米二斗二升五合七勺二抄八圭和買一尺一寸七分六釐七毫六絲八忽夏税八寸六分一釐四絲中等上田苗米一斗九升七合五勺五撮七圭和買一尺二分九釐六毫七絲二忽夏税七寸五分三釐四毫一絲中田苗米一斗六升九合二勺九抄六圭和買八寸八分二釐五毫七絲六忽夏税六寸四分五釐七毫八絲下田苗米一斗四升一合七抄五撮五圭和買七寸三分五釐四毫八絲夏税五寸三分八釐一毫五絲下等上田苗米一斗一升二合八勺六抄四圭和買五寸八分八釐三毫八絲四忽夏税四寸三分五毫二絲中田苗米八升四合六勺四抄五撮三圭和買四寸四分一釐二毫八絲八忽夏税三寸二分二釐八毫九絲下田苗米五升六合四勺三抄二圭和買二寸九分四釐一毫九絲二忽夏税二寸一分五釐二毫六絲已上田則苗至勺絹至分收歸為等則定數答在前",
        "procedure_index": 0,
        "id": "數書九章_5_#0"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#1",
        "text": "術曰以衰分求之列母子求田率副併為法以共田為寔寔如法而一得一分之率以徧乗未併者得三等田各以起租乗之各得米",
        "sketch": "草曰置弱半母四為中率子三為上率以太半子二减母三餘一以乗中率四只得四為中泛又以餘一乗上率三只得三為上泛次以太半母三乗中泛四得一十二為下泛副併三泛得一十九為法置田三千二十一頃五十一畆以畝法二百四十通之得七千二百五十一萬六千二百四十歩内子一十五歩得七千二百五十一萬六千二百五十五歩為寔以法一十九除之得三百八十一萬六千六百四十五歩為一分之數以上泛三因之得一千一百四十四萬九千九百三十五歩為上積又以中泛四因之一分數得一千五百二十六萬六千五百八十歩為中積又以下泛一十二乗一分數得四千五百七十九萬九千七百四十歩為下積其三積各以畝法二百四十約之為畆其上田得四百七十七頃八畝一十五歩其中田得六百三十六頃一十畝三角其下積得一千九百八頃三十二畝一角各以起租三積為三寔其上積一千一百四十四萬九千九百三十五歩乗上積六斗得六百八十六萬九千九百六十一石為寔以畝法二百四十除之得二萬八千六百二十四石八斗三升七合五勺為上田租其中積一千五百二十六萬六千五百八十歩乗中田租四斗五升得六百八十六萬九千九百六十一石為寔以畝法二百四十除之得二萬八千六百二十四石八斗三升七合五勺其下積四千五百七十九萬九千七石四十歩乗下租四斗得一千八百三十一萬九千八百九十六石為寔以畝法二百四十除之得七萬六千三百三十二石九斗為下田米",
        "procedure_index": 1,
        "id": "數書九章_5_#1"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#2",
        "text": "術曰以粟米及衰分求之置甲原納米為實以毎畆苗為法除之得甲原有田以乗毎畆税得田絹次以甲紬絹本色折帛併之内減田絹餘為地紬以毎紬約之得甲原有地次以甲出田併乙丙原有田各得三户今有田地各以等則乗之各得物力苗税次以毎畆物力率約各户共物力得和買副之三分因之退位為和本七分因之退位為和折夏税反其分而因之退之紬以半之併入税各得",
        "sketch": "草曰置甲原納米三十五石七斗為實以毎畆苗三升五合為法除之得一千二十畆為甲原有田以乗毎畆税一尺一寸五分得一百一十七丈三尺為絹積尺次以甲原納絹紬折帛八匹三丈九尺七寸三分九釐併紬絹本色二十匹二丈八尺九寸三分九釐得二十九匹二丈八尺六寸七分八釐以匹法四丈通匹數内零丈得一百一十八丈八尺六寸七分八釐内減田絹積丈尺一百一十七丈三尺餘一丈五尺六寸七分八釐為甲地紬以毎畆紬一尺三寸四分納之得一十一畆七分其畆下七分倍之得一百四十身下加二得一百六十八步以六十步納之得二角零四十八步得一十一畆二角四十八步為甲原有地乃以甲所出四百七畆及五百一十六畆併得九百二十三畆減原有一千二十畆餘九十七畆為甲今有田併原地次以甲出田四百七畆併乙原有田三百七十五畆共得七百八十二畆為乙令有田次以甲所出田五百一十六畆併丙原有田四百六十三畆共得九百七十九畆為丙今有田各列三户今有田地數於右行副之先以毎畆苗三升五合徧乗右行甲得三石三斗九升五合乙得二十七石三斗七升兩得三十四石二斗六升五合為本户苗米次以毎畆税一尺一寸五分徧乗左副行甲得一十一丈一尺五寸五分乙得八十九丈九尺三寸丙得一百一十二丈五尺八寸五分各為丈積各列二位皆以三分因頭位七分因下位併退一位即是自下三七折之又各以四大約丈積成匹其甲得三丈三尺四寸六分五釐為夏税折帛又得一匹三丈分尺八分五釐為夏税本色其一得六匹二丈九尺七寸九分為夏税折帛又得一十五匹二丈九尺五寸一分為夏税本色其丙得八匹一丈七尺七寸五分五釐為夏税折帛得一十九匹二丈分尺九分五釐為夏税本色次以田力一貫二百徧乗右副行併以地物力乗甲原地及納甲得一百一十六貫四百乙得九百三十八貫四百丙得一千一百七十四貫八百各為田物力其甲又置一十一畆七分以乗地紬一尺三寸四分得一丈五尺六寸七分八釐為甲地紬半之得七尺八寸三分九釐各為折紬本色又以甲地乗物力九百得一十貫五百三十為甲地乗力併田物力一百一十六貫四百共得一百二十六貫九百三十文為甲物力列甲乙丙三户共物力各為貫皆以物力和買率三十二貫為法除之甲得三匹九分六釐六毫五絲六忽二㣲五塵乙得二十九匹三分二釐五毫丙得三十六匹七分一釐二毫五絲各為和買率亦各列二位各以七三折之其頭位七折者為和買折帛下位三折者為和買本色折訖其甲得二匹七分七釐六毫五絲九忽三㣲七塵五沙為和買折帛率又得一匹一分八釐九毫九絲六忽八㣲七塵五沙為和買本色率乙得二十匹五分二釐七毫五絲為和買折帛率又得八匹七分九釐七毫五絲為和買本色率丙得二十五匹六分九釐八毫七絲五忽為和買折帛率又得一十一匹一釐三毫七絲五忽為和買本色率各率除端匹外乃以定下分毫皆以四因之收為丈尺寸分甲得和買折帛二匹三丈一尺六分三釐七毫五絲本色一匹七尺五寸九分八釐七毫五絲乙得和買折帛二十匹二丈一尺一寸本色八匹三丈一尺九寸丙得和買折帛二十五匹二丈七尺九寸五分本色一十一匹五寸五分為各户和買數及分本色下畸零數合問",
        "procedure_index": 2,
        "id": "數書九章_5_#2"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#3",
        "text": "術曰列五等户數先以四折下等數加次等户又以四折之加中等户數却以半折之加二等户又以半折之加上等户數不折便為法除科綿得上等一户之綿復半之為副等又半之為中等又四折之為次等又四折之為下等各一户綿却各以户數乗之各得五等共出綿具圖折之上副中次下$$$$$$",
        "sketch": "草曰先置下等户八千四百三十五以四折之得三千三百七十四$$$$$乃以得數折入次户二千三十五内得五千四百九户訖$$$$$又以四折次數五千四百九户得二千一百六十三户六分$$$$乃以得次數併入中户四百六十四内共得二千六百二十七户六分$$$$次以五分折中數二千六百二十七户六分得數$$$$$$次以得數一千三百一十三户八分併副户八十七得一千四百户八分$$$又以五折副數一千四百户八分得七百户四分既得數$$乃以副數七百户四分併上户一十二户得七百一十二户四分不折便以為法為法$累折至等共得七百一十二户四分以為總法乃置科綿八萬八千三百三十七兩六錢為實法法七百一十二户四分而一得一百二十四兩為上等一户所出綿以五折之得六十二兩為副等一户所出綿又五折之得三十一兩為副等一户所出綿乃以四折之得一十二兩四錢為次等一户所出綿又以四折之得四兩九錢六分為下等一户所出綿乃以各等户數各乗一户所出即各得每等共數之綿",
        "procedure_index": 3,
        "id": "數書九章_5_#3"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#4",
        "text": "術曰以衰分求之置上下户米減餘為實列等數減一餘為法除之得抛差石數以差累減上等米各得諸等米以各等户乗之併之為總數",
        "sketch": "草曰置上等户米五千石減下等户二百石餘四千八百石為實以九等減一餘八為法除實得六百石為每等抛差用減上等餘四千四百石為二等米又減六百得三千八百石為三等米又減六百得三千二百石為四等米又減六百得二千六百石為五等米又減六百得二千石為六等米又減六百得一千四百石為七等米又減六百得八百石為八等米又減六百得二百石為九等米又各乗户數併之得總認米石數二十三萬七千六百石合問",
        "procedure_index": 4,
        "id": "數書九章_5_#4"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#5",
        "text": "術曰以衰分求之置諸原率可約約之副併為法以催到錢乗未併者各為實實如法而一合問",
        "sketch": "草曰列户部九十六萬五千四百二十一貫總所六十四萬三千六百一十四貫運司一萬六千九十貫三百五十文各為原率今原率可約求等得一萬六千九十貫三百五十為等數俱約之户部得六十總所得四十運司得一各為率副併得一百一為法以催到錢九千二百五十三貫六百二十文乗未併數六十四十及一畢得五十五萬五千二百一十七貫二百文為户部之實三十七萬一百四十四貫八百文為總所之實九千二百五十三貫六百二十文為運司之實三實皆如法一百一而一其户部得五千四百九十七貫二百文總所得三千六百六十四貫八百文運司得九十一貫六百二十各為侯解錢",
        "procedure_index": 5,
        "id": "數書九章_5_#5"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#6",
        "text": "術曰以粟米求之互易入之列共租共種各以租種率數依本色對之先以各種率互乗諸租騐租數之少者以乗共種得數覆減共租餘為實以二租數相減餘為官種法實如法而一得官種以減共種餘為私種各以租率對乗官私種各得官私種所納租次以減分對乗各納租乃得各減數以減所納餘為合催租乃分别之先以總折分子乗之各為實並以總分母除之各得折色正色數次置折色數二位用夏折大小麥乗之各得與毎折諸率如雁翅列常以多一事者相乗為實以少一事者相乗為法各得所折大小麥其正色數如故為併本色得成年夏折二麥秋收正榖",
        "sketch": "草曰列共租三萬九千五百八十六石併共種九千七百八十二石次各以官種一石納租五石私種實石納租三石各為率對租種本色列之先以種率各一石互乗租數只得共榖次騐租數率三石係少者以乗共種九千七百八十二石得二萬九千三百四十六石為種覆減共租餘一萬二百四十石為種實以租率三減租率五餘二石係官租者為官種法除種實得五千一百二十石為官種以減共種九千七百八十二餘四千六百六十二石為私出種以官租率五石私租率三石各對乗官私種得二萬五千六百石為官租所納租得一萬三千九百八十六石為私種所納租併之得原額租次列官牛種與減二分私牛種與減四分各對乗所納租數得五千一百二十石為官種減租數得五千五百九十四石四斗為私種減租數併之得一萬七百一十四石四斗為今減數乃以官種減租五千一百二十石減官種租二萬五千六百餘二萬四百八十石為合催次以私種減租五千五百九十四石四斗減私種租一萬三千九百八十六石餘八千三百九十一石六斗亦是合催租乃以二等合催租分列之先以毎嵗三分之一以子一減分母三得二乃以一及二皆為子各乗各催租其官種者一分租得二萬四百八十石二分租得四萬九百六十石其私種者一分租得八千三百九十一石六斗二分租得一萬六千七百八十三石二斗並為實此四實並如母三而一其官種一分折得六千八百二十六石六斗六升零三分升之二及二分正色榖得一萬三千六百五十三石三斗三升三分升之一其私種一分折色得二千七百九十七石二斗二分正色榖得五千五百九十四石四斗次置官私種各一分折色數各二位乃用夏折四分大六分小對乗之通係四位乃並四六得一十分約之是並退一位其官種四分大麥者置折榖六千八百二十六石六斗六升三分升之二通分内子得二萬四百八十列二位頭位以四分折之得八千一百九十二石為大麥實下位以六分折之得一萬二千二百八十八石為小麥實次置私種折榖二千七百九十七石二斗列二位頭位以四分折之得一千一百一十八石八斗八升為大麥率下位以六分折之得一千六百七十八石三斗二升為小麥率其圖如後次列折色每大麥三石折小麥二石小麥二石折榖三石五斗為諸率與大小麥實率四數如雁翅列之其六分折小麥勿置大麥折率有母者列母$$$$$$$$$$$$$$$$$$官種者先以大麥率三乗小麥率二得六又乗榖實八千一百九十二石得四萬九千一百二十五石為大麥實乃以小麥率二乗榖率三石五斗得七石又乗母得二十一石為法除實得二千三百四十石五斗七升七分升之一為官種折大麥數仍以母三約本實八千一百九十二石得二千七百三十石六斗六升三分升之二為所折上得大麥榖數次以小麥折二乗榖實一萬二千二百八十八石得二萬四千五百七十六石為小麥實乃以榖率三石五斗乗母三得十石五斗為法除實得二千三百四十石五斗七升七分升之一為官種折小麥榖仍以母三約本實一萬二千二百八十八石得四千九十六石為所折上得小麥榖數私種者先以大麥三乗小麥率二得六又乗榖數一千一百一十八石八斗八升得六千七百一十三石二斗八升為實乃以小麥率二乗榖率三石五斗得七石為法除之得九百五十九石四升為私種折大麥數次以小麥率二乗榖率一千六百七十八石三斗二升得三千三百五十六石六斗四升為實以榖率三石五斗為法除之得九百五十九石四升為私種榖折小麥數次以官種四分大麥二千三百四十石五斗七升七分升之一併私種四分大麥九百五十九石四升得三千二百九十九石六斗一升七分升之一為成年夏折大麥數次以官種六分小麥二千三百四十石五斗七分七分升之一併私種六分小麥九百五十九石四升得三千二百九十九石六斗一升七分升之一為成年夏折小麥數次以官種二分正色榖一萬三千六百五十三石三斗三升三分升之一併私種正色榖五千五百九十四石四斗得一萬九千二百四十七石七斗三升三分升之一合問",
        "procedure_index": 6,
        "id": "數書九章_5_#6"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#7",
        "text": "術曰以粟米衰分求之置原物力為法除原放錢米得毎百文物力所放錢米率以各率乗今來物力各得錢米為明年兩税合放數",
        "sketch": "草曰以原物力三萬七千六百五十八貫五百文為法先除原放錢一千三百五十五貫七百六文定法百文上得一文為商除得三文六分為物力百文所放錢率次除原放米五千二百七十二石一斗九升得一升四合為物力百文所放米率以今三等户物力二十二萬八千一十五貫三百二十一文徧乗所放錢米二率得錢七千九百四十九貫三百五十一文五分五釐六毫得米三萬九百一十四石一斗四升四合九勺四抄為明年兩税合放數",
        "procedure_index": 7,
        "id": "數書九章_5_#7"
    },
    {
        "source_title": "數書九章",
        "source_juan": 5,
        "name": "#8",
        "text": "術曰以粟米求之衰分入之置様米粒數為法以常榖顆數減之餘與榖為列衰可約約之以共米乗列衰為各實實如法而一各得米數榖數置榖數以粟率折之為榖所折米次以勺率遍乗米數折米得粒數",
        "sketch": "草曰置一捻様粒數二百五十四為法以帶榖二十八顆為榖衰以減法餘二百二十六為米衰此二衰與法皆可約求等得二俱以約之法得一百二十七米衰得一百一十三榖衰得一十四以米米一千五百三十四石遍乗二衰得一十七萬三千三百四十二石為米實得二萬一千四百七十六石為榖實皆如法一百二十七而一米得一千三百六十四石八斗九升七合六勺一百二十七分勺之四十八榖得一百六十九石一斗二合三勺一百二十七分勺之七十九以粟率五十折之得八十四石五斗五升一合一勺一百二十七分勺之一百三為榖折納米數併二米得一千四百四十九石四斗四升八合八勺一百二十七分勺之二十四先通分納子一十八萬四千八十石以勺率三百粒乗之得五千五百二十二億四千萬粒為實以母一百二十七除之得四十十億四千八百三十四萬六千四百五十六粒不盡八十八棄之合問",
        "procedure_index": 8,
        "id": "數書九章_5_#8"
    }
]