[
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#0",
        "text": "法曰立天元一為古徑加多九步得□丨為宻徑以自之得下□□丨為宻徑冪又以十一乗之得□□□為十四叚宻圓積於頭又立天元古徑加二之多步一十八步得□丨為徽徑以自之得□□丨為徽徑冪也又以一百五十七乗之得□□□為二百叚徽圓積於中又置天元古徑以自之又三之得□為四叚古圓積於下乃求三積齊同分母而併之先以分母一萬七千五百乗十四叚宻圓積得□□□為二十四萬五千叚宻圓積於頭位次以分母一千二百二十五乗二百叚徽積得□□□為二十四萬五千叚徽積於中位次以分母六萬一千二百五十乗四叚古積得○○□為二十四萬五千叚古積於下位三位相併得□□□為二十四萬五千叚如積數寄左然後列見積通分内子得八十四萬九千一百二十三就分以一千四百乗之得一十一億八千八百七十七萬二千二百與左相消得下式□□□平方開之得三十六步為方徑也各加多步見徽宻二徑也義曰所以齊同於二十四萬五千叚者以元母一百七十五乗一千四百得此數",
        "tiaoduan": "依條叚求之以一千四百乗田積於頭位置徽徑多古徑自之為冪又以一千九十九乗之減頭位續置宻徑多古徑自之為冪又以一千一百一乗之復減頭位餘為實又倍徽徑多古徑以千九十九乗之為徽從又倍宻徑多古徑以一千一百乗之為宻從併二從得五萬九千三百六十四為從法亷常置三千二百四十九",
        "meaning": "義曰以一千四百乗積者取其三率皆可以除之也齊同分母湏至於二十四萬五千叚者葢以分母一百七十五元乗積數一千四百此二數相乗得二十四萬五千也此問求真積實數古徑三十六得積九百七十二步宻徑四十五步得積一千五百九十一步一十四分步之一徽徑五十四步得積二千二百八十九步二百分步之一十二併三積全步四千八百五十二步外以上維乗下位相併得三百六十八分為子實又上二位相乗得二千八百分為母法子母俱以十六約之為一百七十五分步之二十三一千四百乗田積來厯盖只就宻率上定之也置一千四百在地以宻率十一之如十四而一為一千一百積若以古率三之四而一則得一千五十積若以徽率一百五十七乗之如二百而一得一千九十九積所以用一千四百乗積者縁古法四徽法二百皆可以除之也求三積齊同分母元分母數一百七十五元乗積數一千四百此二數相乗二十四萬五千即大分母也三積總率皆齊同於此既得此齊同分母乃各以先求到叚數約之徽率得一千二百二十五宻率得一萬七千五百古率得六萬一千二百五十故反以乗叚數皆齊同於二十四萬五千也法列四數先以元母一百七十五與宻方率十四相度得度盡二數之數為七次以二數相乗以度盡數除之得三百五十為二數總母又以二數總母與徽方率數相度得度盡二數之數為五十以二數相乗度盡數除之得一千四百為三數總母又以三數總母與古方率數相度則古方率四即為度盡二數之數二數相乗度盡數除之仍得一千四百即為四數總母然後以宻方率十四除之得一百為宻分母以徽方率二百除之得七為徽分母以古方率四除之得三百五十為古分母以元分母一百七十五除之得八為原積分母以此數與各叚冪積相乗除較原數所省多矣",
        "procedure_index": 0,
        "id": "益古演段_3_#0"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#1",
        "text": "法曰此問先湏求見兩頭各截之停廣求東截停廣者置東頭所截三畆之積七百二十步以截長五十步除之得一十四步四分為東截地之停廣也求西截停廣者置西頭所截五畆之積一千二百步以截長三十步除之得四十步為西頭所截停廣也乃立天元一為毎步之差以東頭截長五十步乗之折半得□以減東停廣一十四步四分得□□為東頭元小濶於上再置天元差步以西頭截長三十步乗之得□折半得□加入西頭停廣四十步得□□為西頭大濶也内減東頭小濶餘□步□為二濶總差也寄左再立天元毎步差以正長二百四十步乗之得□亦為二濶總差與左相消得□步□下法上實如法而一得一分二釐八毫為毎步之差也置毎步之差以西頭截長三十步乗之得三步八分四釐折半得一步九分二釐加入西頭停廣四十步得四十一步九分二釐為西頭元大濶也又置毎步之差以東頭截長五十步乗之得六步四分折半得三步二分以減於東頭停廣一十四步四分餘一十一步二分為東頭元小濶也",
        "tiaoduan": "",
        "meaning": "",
        "procedure_index": 1,
        "id": "益古演段_3_#1"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#2",
        "text": "法曰立天元一為内池方以自乗倍之得□加入見積得□□寄左又列至步自之得一百六十九步又倍之得三百三十八步與左相消得□○□開平方得七步即内池方也池方自之加入見積再開平方即外田方面也",
        "tiaoduan": "依條叚求之只據前式便是更不湏重畫也只是将見積打作四叚小直田以池面為較以外田方面為和以斜至步為弦然此問惟是其池正在方田中心可依此法求之若稍有偏側則不能用也",
        "meaning": "",
        "procedure_index": 2,
        "id": "益古演段_3_#2"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#3",
        "text": "法曰立天元一為圓徑減穿步得□丨為方斜以自之得□□丨為方斜冪於頭再置天元圓徑以自之又以一步四分七釐乗之得□□步為展起圓田也併入頭位得□□□步為展數如積一叚寄左然後列見積一百二十七步兩度下加四得二百四十八步九分二釐與左相消得下式□□□開平方得六步即圓徑也以徑減穿步即方斜也",
        "tiaoduan": "依條叚求之穿步冪内減去展起見積為實二之穿步為從二步四分七釐虛隅",
        "meaning": "義曰下式乃展起之圓積也亦俱是減數也此數該一步四分七釐之方又從步内疊出一步虚隅計得二步四分七釐常法也",
        "procedure_index": 3,
        "id": "益古演段_3_#3"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#4",
        "text": "法曰立天元一為内方面身外加四又加二之頭至步四十三得□□為田長也又置池方面身外加四又加入二之邉至步一十五得□□為田濶也長濶相乗得下式□□□為直田積於頭又置天元池方面以自之得丨為内方池以減頭位得□□□為如積一叚寄左然後列見積二千七十九步與左相消得□□□開平方得一十五步即内池方面也方面外加四副二位若加兩頭至池步見長若加兩邉至池步即見濶也",
        "tiaoduan": "依條叚求之積步内減四叚邉至與頭至步相乗數為實併至頭至步倍之又身外加四為從九分六釐常法",
        "meaning": "義曰水池外有九分六釐常法從步皆加四者盖於斜上求方面也",
        "procedure_index": 4,
        "id": "益古演段_3_#4"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#5",
        "text": "法曰立天元一為池長減於倍通步□丨為田方面以自之得□□丨為田方積於頭再置天元池長内減較四步□丨為池濶以天元乗之得□丨為直池積以減頭位得□□○為如積一叚寄左然後列直積三百四十步與左相消得□□下法上實如法而一得一十步即池長也以長減於倍通步即方田面也",
        "tiaoduan": "依條叚求之四叚通步冪内減田積為實四之通步内減池較為法如法得池長",
        "meaning": "義曰四之通步為法内欠一箇池長冪却用所漏之池補之猶差一池較為法合除之數也既於實積内虚了此數故作法時於四之通步内減去一數也",
        "procedure_index": 5,
        "id": "益古演段_3_#5"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#6",
        "text": "法曰立天元一為内方面身外加四又加倍至步三十六得□□為田方面以自乗得□□□為外方積於頭再置天元内方面以自之得丨為内池積也以減頭位得□□□為如積一叚寄左然後列真積一萬八百步與左相消得□□□開平方得六十步為内池方面也内方面身外加四又加倍至步即方面也",
        "tiaoduan": "依條叚求之見積内減四叚至步冪為實四之至步身外加四為從九分六釐常法",
        "meaning": "義曰從步内加四者是於一箇方面上求",
        "procedure_index": 6,
        "id": "益古演段_3_#6"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#7",
        "text": "法曰立天元一為内方面加倍至步一百一十五步得□丨為外田斜以自之得□□丨為所展方積於頭再置天元内池面以自之得丨為内池積又就分以一步九分六釐乗之得下□亦為所展之池積也以減頭位得□□□為一叚所展如積寄左然後列真積九千三百七十五步以一步九分六釐乗之得一萬八千三百七十五與左相消得□□□開平方得二十五步即内方面也",
        "tiaoduan": "依條叚求之展積内減四叚至步冪為實四之至步為從九分六釐虚常法",
        "meaning": "義曰展積時其池亦展得虚了九分六釐也",
        "procedure_index": 7,
        "id": "益古演段_3_#7"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#8",
        "text": "法曰立天元一為内方面身外加四為池斜以減於倍通步二百四步得□□為外方面以自之得□□□為方田積於頭又置天元内池面以自之得下丨為内方池也以内方池減頭位得□□□為如積一叚寄左然後列真積一萬八百步與左相消得□□□平方開之得六十步為池方面也",
        "tiaoduan": "依條叚求之四叚通步冪内減見積為實四之通步加四為從九分六釐虚隅法",
        "meaning": "義曰從步身外加四者蓋是於池斜上求池面也",
        "procedure_index": 8,
        "id": "益古演段_3_#8"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#9",
        "text": "法曰立天元一為内方面減於倍通步一百六十五步得□丨為外田斜也以自之得□□丨為所展外田積於頭再置天元池方面以自之為方池積又就分以一步九分六釐乗之得□為所展方池積也以減頭位得□□□為展起底如積一叚寄左然後列真積三十九畆一十五步通納得九千三百七十五步又就所展分母一步九分六釐乗之得一萬八千三百七十五步與左相消得□□□平方開之得二十五步即内池面也以池面減於倍通步又身外去四即外方面也",
        "tiaoduan": "依條叚求之四叚通步冪内減展積為實四之通步為從九分六釐常法",
        "meaning": "義曰元以展積減四叚通步冪時漏下一步九分六釐池積今来於從步内疊用了一個方外剰九分六釐",
        "procedure_index": 9,
        "id": "益古演段_3_#9"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#10",
        "text": "法曰立天元一為内池長減於倍通步七十四步得□丨為外田斜也以自之得□□丨為所展外田積於頭再置倍通長七十四步内減倍通濶六十四步餘一十步乃池長濶差也再置天元池長内減長濶差得□丨為濶也以天元長乗之得□丨為直池積也又就分以一步九分六釐乗之得□□為展起底直池積也以減頭位得下式□□□為所展如積一叚寄左然後列真積八百五十步就分以一步九分六釐乗之得一千六百六十六步與左相消得□□□開平方得二十五步為内池長也",
        "tiaoduan": "依條叚求之四叚通長冪内減展積為實四之通長於頭以一步九分六釐乗長濶差以減頭位為從九分六釐常法",
        "meaning": "義曰據從步合用之積於疊起處少了一方今将減積時漏下所展水池補了一甲之地若更得一乙之地則共補成一步九分六釐之地方也今不可補故於從步内減去所展差步便是於從法合用之積内借了一乙之地恰補就一步九分六釐之方也除補了疊起的一步方外猶剰九分六釐故以之爲常法也",
        "procedure_index": 10,
        "id": "益古演段_3_#10"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#11",
        "text": "法曰立天元一爲池濶加二之邉至步三十八得□丨為外田斜以自之得□□丨為所展外田積於頭二之邉至步内減二之頭至步餘一十步為池長濶差也再置天元池濶加差一十步得□丨為池長也用天元池濶乗之得□丨為直池積也又就分以一步九分六釐乗之得□□步為所展之池積也以減頭位得□□□為所展如積一叚寄左然後列真積一千一百五十步以一步九分六釐乗之得二千二百五十五十四步與左相消得□□□開平方得二十五步為池濶也",
        "tiaoduan": "依條叚求之展積内減四叚邉至步冪為實四之邉至步於頭以一步九分六釐乗長濶差減頭位餘為從九分六釐虚常法",
        "meaning": "義曰外四隅方所減之四至冪也中十字積為實則池濶為隅四之至步為從也附直池外斜方展池積也平分上下二尖形附於左右二尖形外成一原池濶乗展池正長之直方展池正長為原池長之一步九分六釐十字積與展池積之較為實是前從隅内應少原池長之一步九分六釐又為少原池長濶較之一步九分六釐併原池濶之一步九分六釐故展較減前從以為從展隅反減前隅為虚隅也",
        "procedure_index": 11,
        "id": "益古演段_3_#11"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#12",
        "text": "法曰立天元為實徑以減相和步四百二十四得□丨為内外周共步用天元實徑乗之得□丨為如積兩叚寄左然後列二之真積一萬一千八十八步與左相消得□□丨開平方得二十八步為實徑也以徑步除田積於頭位又二十二乗徑步如七而一得數若加頭位即外周若減頭位即内周也",
        "tiaoduan": "依條叚求之倍積步為實和步為從一益隅",
        "meaning": "義曰以和步為從是於内外周數外又引出一步虚常法也",
        "procedure_index": 12,
        "id": "益古演段_3_#12"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#13",
        "text": "法曰立天元為實徑加通步六十三得□丨為外田徑以自之得下□□丨為外圓徑冪又十一之得下式□□□為十四叚外圓積於頭再置天元實徑以減通步得□丨為内圓徑以自之得□□丨為内圓徑冪又十一之得□□□為十四叚内圓積也以減頭位得下式□步為十四叚如積寄左然後列真積二十三畆一分法通得五千五百四十四又就分一十四之得七萬七千六百一十六與左相消得□□下法上實如法而一得二十八步為實徑也以實徑加通步即外徑若減通步即内池徑也",
        "tiaoduan": "依條叚求之十四之積為實四十四之通步為法求得實徑此問難以為式强立此式以推之毎積之長乃三箇通步今十四之積合以四十二箇通步除之今用四十四之通步為法者縁宻率之周稍多於古率之周也假令古率七箇積即合用二十一箇通步為法若依宻率七箇積即合用二十二箇通步為法此問乃併十四之積為實是合用四十四箇通步為法也",
        "meaning": "",
        "procedure_index": 13,
        "id": "益古演段_3_#13"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#14",
        "text": "法曰立天元一為池濶加二之畔至步得□丨為外田徑以自之得□□丨為田徑冪以三之得□□□爲四叚圓田積於頭二至歩相減餘二十四步又倍之得四十八步為池長濶差也再立天元池濶加差得□丨爲池長以天元濶乗之得□丨為池積又就分四之得□□為四叚直池積以減頭位得□□丨為如積四叚寄左然後列真積八千七百四十四步就分四之得三萬四千九百七十六步減頭位得□□丨平方開之得三十四步為池濶也",
        "tiaoduan": "依條叚求之四之見積内減十二叚畔至步冪為實十二之畔至步内減四箇長濶差餘為從一步虚常法",
        "meaning": "義曰八處以紅誌之者共是從内所減之數也",
        "procedure_index": 14,
        "id": "益古演段_3_#14"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#15",
        "text": "法曰立天元一為内池長以減倍通長八十四步得□丨為田徑以自之得□□丨為田徑冪以三之得□□□為四叚圓田於頭再立天元一為池長内減長濶差得□丨為池濶以天元一乗之得□丨又就分四之得□□為四叚池積以減頭位得下式□□丨為四叚如積寄左然後列四之真積六千三百四十八步與左相消得□□丨開平方得三十步為内池長也以長減倍通長即田徑也",
        "tiaoduan": "依條叚求之十二之通步冪内減四之見積為實十二之通步内減四差為從一步常法",
        "meaning": "義曰十二之從步内減去了三箇差又以三箇漏下池積補了疊起底三步虚方外猶剰一池更用一差減從併上所剰之一池恰補成一步常法也",
        "procedure_index": 15,
        "id": "益古演段_3_#15"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#16",
        "text": "法曰立天元一為等數五之得□為外方面自之得□為外方積於頭一次立天元一為等數以三之得□為中圓徑以自之得□為圓徑冪又三之四而一得□為池積以減頭位得□為外田積内減了中圓積之數於次位一再立天元等數便為内方面以自之得丨為内方積却加入次位得下□為如積一叚寄左然後列真積一十一畆五分五釐以畆法通得二千七百七十二步與左相消得□□步下法上實如法而一得一百四十四步再開平方得一十二步為等數也便是内方面也三之為中圓徑五之為外方面",
        "tiaoduan": "",
        "meaning": "",
        "procedure_index": 16,
        "id": "益古演段_3_#16"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#17",
        "text": "法曰立天元一為等數以五之為外圓徑以自之得□為外徑冪又三之四而一得□為外田積於頭再立天元等數以三之為中方面又自之得□為中方冪以減頭位得□為外圓積内減了中方冪之數於次位又置天元等數便為内圓徑以自之得丨為内徑冪又三之四而一得□為内圓積也却加入頭位得□為如積一叚寄左然後列真積一十四畆一分七釐半以畆法通得三千四百二步與左相消得□□下法上實如法而一得三百二十四步再開平方得一十八步為等數便是内圓徑也副置之三因為中方面五因為外圓徑也",
        "tiaoduan": "",
        "meaning": "",
        "procedure_index": 17,
        "id": "益古演段_3_#17"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#18",
        "text": "法曰立天元一為内池徑身外加二得□為池東南楞至田西北角也又加斜至步二十五步得□□為外田斜以自之得□□□為田斜冪於頭再立天元圓徑以自之為冪又以一步四分七釐乗之得□為所展圓池積以減頭位得□□□為所展如積一叚寄左然後列真積九百二十五步就分以一步九分六釐乗之得一千八百一十三步與左相消得□□□平方開得二十步為池徑也池徑外加二又添入斜至步却身外除四即外方面也",
        "tiaoduan": "依條叚求之展積内減斜至冪為實倍至步身外加二為從三釐虚常法減從開平方",
        "meaning": "義曰於一方外虚了四分七釐從上帶了四分外虚七釐又於從上乗起四釐外猶虚三釐故以三釐為常法此圖内二分合畫作極細形状與四分七釐外圓邉正自相應今不應者但二分差濶耳所以畫作差濶之状者正欲易辯二分之數也",
        "procedure_index": 18,
        "id": "益古演段_3_#18"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#19",
        "text": "法曰立天元一為池方面身外加四八又加入斜至步一十九步得□□為外田斜也以自之得□□□為外田斜冪於上再立天元一為池方面以自之又以四十九乗之如二十五而一得□為展起方池積以減上得□□□為所展如積一叚寄左然後列真積四畆一十五步以畆法通内得九百七十五步又隨分以一步九分六釐乗之得一千九百一十一步與左相消得□□□平方開得二十五步為内池方面也於此方面上兩次求斜合得一步九分六釐以除元方一步外有九分六釐半之則得四分八釐故此方面上加四八更加入斜至步為大方斜也",
        "tiaoduan": "以條叚求之展積内減至步冪為實二之至步以一步四分八釐乗之為從二分三釐四絲為常法",
        "meaning": "義曰此一問其展起積時於一池之外虚了九分六釐却於一箇從步内加四分八釐二箇從步計加了九分六釐恰就了所展虗數除外有一叚四分自乗數該一分六釐於上又有兩叚四分乗八釐數該六釐四毫於次又有一叚八釐自乗數該六毫四絲於下三位併得二分三釐四絲此數係是於展積内實有之數故以常法也",
        "procedure_index": 19,
        "id": "益古演段_3_#19"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#20",
        "text": "法曰立天元一為内池徑加二之至水六十步為小方面於小方面上又加入大小方面差五十步即大方面也於大方面上又加入大圓徑大方面差五十步即大圓徑也具圖於左一内圓徑丨一小方面□丨一大方面□丨一大圓徑□丨乃先置天元内圓徑以自之义三之得□為四叚圓池積於上又置小方面□丨以自之得□□丨為小方積以四之得下式□□□為四叚小方積於次又置大方面以自之得□□丨為大方積四之得□□□為四叚大方積於下又置大圓徑下式□丨以自之得□□丨為大圓徑冪以三之得下式□□□為四叚大圓積於下位之次併下三位得下式□□□於右以四池積□減於右得□□□為如積四叚寄左然後列真積六萬一千三百步就分四之得二十四萬五千二百步與左相消得□□□平方開之得四十步為内池徑也各加差步即各得方面與圓徑也",
        "tiaoduan": "依條叚求之四之田積於頭位内減三叚多池徑冪又減四叚大方面多池徑冪又減十六叚至水步冪為實六之圓田多池徑步又八之大方田面多池徑步又十六之至水步三位併之得二千三百二十步為從法亷常置八步開平方",
        "meaning": "義曰三叚圓徑冪乃四箇圓田積此數内有三箇方也其四叚大方田積内有四箇方也其四叚小方積毎箇圓池外餘二分半四池計餘一步方也三位上併帶八步方",
        "procedure_index": 20,
        "id": "益古演段_3_#20"
    },
    {
        "source_title": "益古演段",
        "source_juan": 3,
        "name": "#21",
        "text": "法曰立天元一為池内徑先以六除内外周差七十二步得一十二步為水徑倍之得二十四步加入天元池内徑得□丨為池外徑又加倍至步一百一步得下式□丨為外田斜以自之得□□丨為田斜冪於頭位再立天元池内徑加入二之水徑得□丨為池外徑以自之得□□丨為外徑冪又以一步四分七釐乗之得下式□□□步為展起底外圓積於次上再立天元一池内徑以自之丨亦以一步四分七釐乗之得□為展起底内圓積以減次上得□步□○為所展底池積也以此池積減頭位得下式□步□丨為展起如積一叚寄左然後列真積四十七畆二百一十七步以畆法通納之得一萬一千四百九十七步又就分以一步九分六釐乗之得二萬二千五百三十四步一分二釐與左相消得下式□步□丨開平方得三十六步即池内徑也三之為内周又加差為外周置内徑加二之水徑又加倍至步為外方斜也置外方斜身外去四即外田方面也",
        "tiaoduan": "依條叚求之以一步九分六釐乗田積於頭位以水徑加至步以自之為冪又四之以減頭位又倍水徑自乗又以一步四分七釐乗之却加入頭位為實又水徑加至步四之於頭位又三之水徑以一步九分六釐乗之減頭位為從一步常法",
        "meaning": "",
        "procedure_index": 21,
        "id": "益古演段_3_#21"
    }
]