[
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#0",
        "text": "法曰立天元一為内池徑加倍至步得□丨為田方靣以自增乗得□□丨為方積於頭再立天元一為内池徑以自之又三因四而一得○□為池積以減頭位得□□□為一段虚積寄左然後列直積以畝法通之得三千三百步與左相消得□□□開平方得二十步為圓池徑也倍至步加池徑即外方靣也",
        "tiaoduan": "以條段求之真積内減四段至步冪為實四之至步為從二分半常法",
        "meaning": "義曰真積内減四段至步冪者是減去四隅也以二分半為常法者是於一步之内占却七分半外有二分半也",
        "procedure_index": 0,
        "id": "益古演段_1_#0"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#1",
        "text": "法曰立天元為池徑減倍通步得□丨為田方靣以自増乗得□□丨為方田積於頭又以天元池徑自之三因四而一得□為池積以減頭位得□□□為一段虚積寄左然後列真積三千三百步與左相消得□□□開平方得二十歩即内池徑也倍通步内減池徑為方靣也",
        "tiaoduan": "依條段求之倍通步自乗於頭位以田積減頭位餘為實四之通步為從二分半虚常法",
        "meaning": "義曰倍通步者是於方靣之外引出一圓也用二分半虚常法者是一箇虚方内却有減餘圓池補了七分半外欠二分半故以之為虚隅也",
        "procedure_index": 1,
        "id": "益古演段_1_#1"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#2",
        "text": "法曰立天元一為内池徑加倍至步得□丨為方斜以自増乗得□□丨為方斜冪於頭又立天元為池徑自之又三因四而一為池積今為方田積既以展起則此池積亦須展起故又用一步九分六釐乗之得一步四分七釐亦為一箇展起底圓池積也以池積減田積餘□□□為一段虚積寄左然後列真積一萬一千三百二十八步亦用分母冪一步九分六釐乗之得二萬二千二百○二步八分八釐與左相消得□□□平方開之得六十四步為内池徑也倍至步加池徑身外除四見方靣也一法求所展池積以徑自之了更不湏三因四除及以一步九分六釐乗之只於徑冪上以一步四分七釐乗之便為所展之池積也",
        "tiaoduan": "依條段求之展積内減四段至步冪餘為實四之至步為從四分七釐益隅",
        "meaning": "義曰凡言展積者是於正積上以一步九分六釐乗起之數元法本是方靣上寄一步四分分母自乗過於每步上得一步九分六釐故今命之為展起之數也諸變斜為方者皆凖此所展之池積是於一步圓積上展出九分六釐若以池徑上取斜為外圓徑則一步上止生得四分七釐也故以四分七釐為虚常法又取方冪一步九分六釐四分之三亦得圓積一步四分七釐也繁碍於講解故用古率以從簡且其法既明即用宻率亦無不可",
        "procedure_index": 2,
        "id": "益古演段_1_#2"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#3",
        "text": "法曰立天元一為圓徑減倍通步得下□丨為方斜以自之得□□丨便為所展方田積於上再立天元一為池徑以自之又以一步四分七釐乗之得□便為所展圓池積也以池積減上田積餘得□□□為一段如積寄左然後列真積如法展之得二萬二千二百○二步八分八釐與左相消得□□□平方開之得六十四步為内池徑也以池徑減倍通步即是方田斜身外除四為方靣也",
        "tiaoduan": "以條段求之四段通步冪内減展積為實四之通步為從四分七釐常法",
        "meaning": "義曰四之通步為從其減積外實欠一箇方今即有展池減時所剰之積補却一箇虛方外猶剰一箇四分七釐為常法也",
        "procedure_index": 3,
        "id": "益古演段_1_#3"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#4",
        "text": "法曰立天元一為内圓周加一百六十八步得□丨為外方周以自増乗得□□丨為一十六箇方田積又三因之得□□□為四十八段方田積於頭再立天元圓周以自之丨為十二段圓池積又就分四之得□為四十八箇圓池積以減頭位得□□丨為四十八段如積寄左然後列真積一十三畝二分以畝法通之得三千一百六十八步又就分母四十八之得一十五萬二千○六十四步與寄左相消得□□丨平方開之得七十二步為内圓周也三而一為池徑",
        "tiaoduan": "依條段求之四十八段田積内減三段不及步冪為實六之不及為從一虚隅",
        "meaning": "義曰每一箇方周方為十六段方田積今三之為四十八段方田積也内除了三箇圓周冪外於見積上虚了一箇圓周冪也今求圓周故以一步為虚隅法",
        "procedure_index": 4,
        "id": "益古演段_1_#4"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#5",
        "text": "法曰立天元一為方靣以自之得元丨便為十二段池積也再立天元方靣以自之又十二之得□為十二段方田積也二數相減餘□為十二段如積寄左然後列真積就分母十二之得□與左相消得□□平方開之得五十四步為方靣亦為圓周徑也",
        "tiaoduan": "依條段求之十二之真積為實無從一十一步常法",
        "meaning": "義曰一箇方田積便是一箇圓周積也一箇圓周積便是十二箇圓池積今將一十二箇圓池積減於十二箇方田積通有十一段方田積也",
        "procedure_index": 5,
        "id": "益古演段_1_#5"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#6",
        "text": "法曰立天元一為外方加不及一十四步得□丨為内周以自増乗得□□丨為十二箇圓池積於頭再立天元方靣以自之又十二之為十二箇方田積内減頭位得□□□為十二段如積寄左然後列見積一千三百五十七步就分母十二通之得一萬六千二百八十四步與左相消得□□□開平方得四十步為外方靣也",
        "tiaoduan": "依條段求之十二之積内加入不及步冪為實二之不及步為虚從十一步常法",
        "meaning": "義曰其十二段積内𢃄起十二箇圓池其十二箇圓池補成一箇圓周方其圓周多於方靣十四步故自之為冪加入所欠之一角又二之為虚從恰得十一箇方也",
        "procedure_index": 6,
        "id": "益古演段_1_#6"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#7",
        "text": "法曰立天元一為圓徑以三之為圓周以減共步得□□為方周以自増乗得□□□為十六段方田積於頭再立天元圓徑以自之又十二之得○□為十六箇圓池積以減頭位得□□□為十六段如積寄左然後列真積一十三畝七分半以畝法通之得三千三百步又就分母一十六通之得五萬二千八百步與左相消得□□□開平方得二十步為圓池徑又三之為圓周也",
        "tiaoduan": "依條段求之和步冪内減十六之見積為實六之和步為從三步常法",
        "meaning": "義曰十六箇圓池該十二箇方内從步合除去九箇方外猶剰三箇方故以三步為常法也",
        "procedure_index": 7,
        "id": "益古演段_1_#7"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#8",
        "text": "法曰立天元一為池徑以五之減倍之相和步得□□為九箇方靣以自増乗得□□□為八十一段方田積於頭位再立天元池徑以自之又以六十步七分半乗之得□為八十一箇圓池以此減頭位餘□□□為八十一段如積寄左然後列真積三千一百六十八步以八十一通之得二十五萬六千六百○八與左相消得下□□□開平方得二十四步為池徑也五因池徑減倍相和餘九而一得方田靣以池徑減方餘折半為實徑",
        "tiaoduan": "依條段求之倍共步自乗於頭以八十一之田積減頭位餘為實二十之共步為從三十五步七分半為常法",
        "meaning": "義曰八十一箇方田内𢃄起八十一箇圓池每箇圓池七分半此八十一箇計該六十步七分半其從步内合除去二十五箇外猶剰三十五箇七分半故以之為常法也",
        "procedure_index": 8,
        "id": "益古演段_1_#8"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#9",
        "text": "法曰立天元一為池徑以二十五之減於十之相和三千四百二十步得□□為四十七箇外方靣以自増乗得□□□為二千二百九段方田積於頭位再立天元池徑以自之又以一千六百五十六步七分半乗之得□為二千二百○九箇圓池積也以此減頭位得□□□為二千二百九段如積數寄左然後列真積三千一百六十八步以分母二千二百九通之得六百九十九萬八千一百一十二步與左相消得□□□開平方得二十四步即池徑也以二十五之圓徑減十之和步餘四十七而一得為外方靣身加四内減了圓池徑餘折半為斜徑也方五因八方靣得四十以斜七乗一斜得七併之得四十七為法除實得方靣不除便為四十七箇方靣也",
        "tiaoduan": "依條段求之相和步進一位自乗於頭位以二千二百九之真積減頭位餘為實五百之和步為益從一千三十一步七分五釐為益隅",
        "meaning": "義曰減數係是二千二百九段方靣冪内却漏下二千二百九箇圓池此數該一千六百五十六箇七分圓徑冪却於從步上疊用了六百二十五箇池徑冪外猶剰一千三十一箇七分五釐故以之為隅法其從法元有五十箇圓徑今命為之五百者縁相和步進一位也",
        "procedure_index": 9,
        "id": "益古演段_1_#9"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#10",
        "text": "法曰立天元一為内方靣加倍至步為外田徑以自之得下式□□丨又三之得□□□為四段圓田積於頭再立天元方靣以自之又就分母四之得□為四池積以減頭位得□□丨為四段如積數寄左然後列真積又就分四之得二萬四千八百一十六步與左相消得□□丨開平方得三十六步為方池靣也加倍至步即圓徑也",
        "tiaoduan": "依條段求之四之積步於頭位内減十二之至步冪為實十二之至步為從一虚隅",
        "meaning": "義曰四箇外圓田内減了十二段至步冪復以十二之至步為從又合去四箇方池今元積内有三箇虚池外猶欠一箇虚池故以一步為虛隅常減從以為法",
        "procedure_index": 10,
        "id": "益古演段_1_#10"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#11",
        "text": "法曰立天元一為方斜加三步為圓徑以自之又以一步九分六釐乗之得□□□又三之得□□□内減四之天元冪得上層□中下云云寄左然後置五十步兩度加四得□又四之得□與左相消得下層三百三十九步○八釐負開平方得七步即池斜也副置池斜上位加至步即圓徑下位身外減四即方靣也合問",
        "tiaoduan": "依條段求之四段展起見積内減三段展起至步冪為實六之至步展起為從一步八分八釐為常法也此問若求方靣則其法甚易今求方斜故其圖須細分之",
        "meaning": "義曰三箇九分六釐共計二步八分八釐其元初作四段如積時合有四箇所展之池今來只見三箇故於二步八分八釐内去却一步有餘只有一步八分八釐為常法也",
        "procedure_index": 11,
        "id": "益古演段_1_#11"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#12",
        "text": "法曰立天元一為内方靣減倍通步得□丨為外圓徑以自之得□□丨為圓徑冪以三之得□□□為四段圓田積於頭再立天元内方靣以自之又就分母四之得□為四段方池積以減頭位得□□丨為四段如積數寄左然後以四之見積二萬四千八百一十六步與左相消得□□丨平方開之得三十六步為内方靣也減倍通步即圓徑",
        "tiaoduan": "依條段求之十二段至步冪内減四之見積為實十二之通步為從一常法",
        "meaning": "義曰所減數内剰下四箇方池疊補了三箇外猶剰一箇故以之為常法",
        "procedure_index": 12,
        "id": "益古演段_1_#12"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#13",
        "text": "法曰立天元一為内方靣身外加四為内方斜又加倍至步得□□為外圓徑也以自増乗得□□□為外徑冪以三之得□□□為四段外圓積於頭再立天元内方靣以自之又四之得□為四段方池積也以減頭位餘□□□為四段如積數寄左然後列四之見積二萬步與左相消得□□□開平方得五十步為池方靣也身外加四又加入倍至步即為外田徑也",
        "tiaoduan": "依條段求之四之積步内減十二段至步冪為實十二之至步身外加四為從一步八分八釐為常法",
        "meaning": "義曰三箇九分六釐計二步八分八釐其四箇圓田内有四箇方水池除從步合占三箇外猶剰一箇水池却於數内取了一步餘一步八分八釐故以之為常法也其從步加四者葢取斜中之方靣也葢不加四不能見方靣而但得方斜也",
        "procedure_index": 13,
        "id": "益古演段_1_#13"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#14",
        "text": "法曰立天元一為内方靣加四得為方斜以減倍通步得□為外圓徑以自増乗得□□□為外田徑冪也以三之得□□□為四段圓田積於頭再立天元内方靣以自之又就分四之得□為四段方池以減頭位得□□□為四段如積寄左然後列四之見積一千三百八十八步與左相消得□□□開平方得二十五步為内方靣也方靣加四減於倍通步得圓徑也",
        "tiaoduan": "依條段求之十二段通步冪内減四之田積為實十二之通步加四為益從一步八分八釐常法",
        "meaning": "義曰此式元係虚從今以虛隅命之四段圓田減積時剰下四段方池於從步内用訖三箇外猶剰一箇却於二步八分八釐虛數内補了一歩外虚一步八分八釐故以之為法",
        "procedure_index": 14,
        "id": "益古演段_1_#14"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#15",
        "text": "法曰立天元一為内方靣以四之為内方周加不及一百五十二步得□□為外圓周以自増乗得□□□為十二段圓田積於頭再立天元内方靣以自之又就分十二之得□為十二段方池積以減頭位餘□□□為十二段如積寄左然後列見積八千○九十六步又就分十二之得九萬七千一百五十二步與左相消得□□□平方開得五十二步為内池方靣也以四之為内方周加不及步為圓周也",
        "tiaoduan": "依條段求之十二段積步内減不及步冪為實八之不及步為從四步為常法也",
        "meaning": "義曰十二段圓積該九段圓徑冪九段圓徑冪便是九箇圓周冪也據十二段圓積内元少十二箇方池今於周冪内除折筭外剰四箇池積故以四步為常法也",
        "procedure_index": 15,
        "id": "益古演段_1_#15"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#16",
        "text": "法曰立天元一為等數便以為方周以自之為十六箇方池於頭丨再立天元等數便以為圓徑以自之又十二之得□為十六段圓田積内減頭位餘□為十六段如積寄左然後列真積三千五百六十四步又就分十六之得五萬七千○二十四步與左相消得□○□平方開得七十二步即等數也",
        "tiaoduan": "依條段求之十二之真積為實無從一十一步常法",
        "meaning": "義曰十六箇圓積乃十二段圓徑冪也其十六箇圓積内有十六箇方池恰是一箇方也此一箇方便是等數冪也",
        "procedure_index": 16,
        "id": "益古演段_1_#16"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#17",
        "text": "法曰立天元一為外圓徑加不及四十二步得為内方周以自増乗得下式□□丨為十六段池積於頭再立天元外圓徑以自之又十二之得□為十六段田積也内減頭位餘□□□為十六段如積寄左然後列真積一千六百一十一步就分母十六之得二萬五千七百七十六步與左相消得□□□平方開得五十四步為外圓徑也加不及步為内方周也",
        "tiaoduan": "依條段求之置十六之積加不及步冪為實倍不及步為虚從一十一步為常",
        "meaning": "義曰十二箇圓徑冪該十六箇圓田積十六箇圓田積内有十六箇方池其十六箇方池於實積内侵過所加一角并二段虛從之數也",
        "procedure_index": 17,
        "id": "益古演段_1_#17"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#18",
        "text": "法曰立天元一為内方靣以四之為内方周減於相和二百八步得□□為外圓周以自增乗得□□□為圓周冪便為十二段圓田積於頭再立天元内方靣以自之又就分十二之得□為十二段方池積也以減頭位餘□□□為十二段如積寄左然後列見積三百四十七步就分母十二之得四千一百六十四步與左相消得□□□開平方得二十五步為内方靣也四之為内方周減於相和步為圓周也",
        "tiaoduan": "依條段求之以十二之積步減和步冪為實八之和步為虚從四常法",
        "meaning": "義曰十二段圓田内有十二箇方池於方周冪内補了十二池外猶欠四箇故以四為隅法此式元係虛從今却為虛隅命之故以四為虛常法",
        "procedure_index": 18,
        "id": "益古演段_1_#18"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#19",
        "text": "法曰立天元一為内方靣以減一百七十二得□丨為外田徑也以自增乘得□□丨為圓徑冪也以三之得□□□為四段圓田積於頭再立天元内池靣以自之又就分四之得□為四池積以減頭位得□□丨為四段如積寄左然後列見積八千九十六步又就分四之得三萬二千三百八十四步與左相消得□□丨開平方得五十二步為内方靣也以七之方靣減於倍和步餘以七而一即圓徑也圓徑内減方靣餘者又半之即實徑也",
        "tiaoduan": "依條段求之徑靣共一百七十二也自之為冪又三之於頭位内減四之見積餘為實六之徑靣共步為從一常法",
        "meaning": "義曰四之真積内有四箇方池於從法内疊周了三箇外剰一箇故以一步為常法",
        "procedure_index": 19,
        "id": "益古演段_1_#19"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#20",
        "text": "法曰立天元一為内方靣以三十三之減於十之云數二千五百九十五步得□□為三十五箇圓田徑乃以三十五之圓徑自増乗得下式□□□為一千二百二十五段圓徑冪也以三因之得□□□合以四除之今不除便為四千九百段圓田積於頭再立天元内池靣以自之又就分以四千九百乗之得○□為四千九百段方池積以減頭位得□□□為四千九百段如積數寄左然後列真積二千四百七十五步就分以四千九百乗之得一千二百一十二萬七千五百步與左相消得□□□平方開得一十五步為内方靣方",
        "tiaoduan": "依條段求之十之相和步自之為冪以三之於頭位以四千九百段見積減頭位為實一千九百八十之相和步為從一千六百三十三為常法",
        "meaning": "義曰減數計三千六百七十五箇圓徑冪便是四千九百箇圓田積也内漏下四千九百箇方池却於從内疊用了三千二百六十七箇方池外猶剰一千六百三十三箇方靣冪故以之為常法也其從法元有一百九十八箇方靣合用一百九十八之相和步為從今用一千九百八十箇相和步者縁為相和步先進了一位也",
        "procedure_index": 20,
        "id": "益古演段_1_#20"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#21",
        "text": "法曰立天元一為方差以減中方靣得□丨為小方靣也以自之得□□丨為小方積於頭再立天元方差加入中方靣得□丨為大方靣以自之得□□丨為大方積於次位又列中方靣□自之得下□為中方積於下位三位相併得□○□為一段如積數寄左然後列真積四千七百七十步與左相消得□○□開平方得二十一步即是方差也",
        "tiaoduan": "依條段求之列併數以三約之所得即中方靣也以自之為冪又三之以減積為實無從二步常法",
        "meaning": "義曰積步内減三箇中方冪外有兩箇方故得二步常法舊術又折半止得一箇方也",
        "procedure_index": 21,
        "id": "益古演段_1_#21"
    },
    {
        "source_title": "益古演段",
        "source_juan": 1,
        "name": "#22",
        "text": "法曰立天元一為水占斜加入云數四十五步半得□為田斜以自増乗得□步□丨為田斜冪於頭再立天元一水占斜以自之為水占得小方積就分以一步九分六釐乗之得□為所展得水占積也以減頭位得□□□為如積一段寄左然後列真積一千二百一十二步七分半以一步九分六釐乘之得二千三百七十六步九分九釐與左相消得□□□開平方得三步半為水占斜加至步為田斜身外減四即是方靣也",
        "tiaoduan": "依條段求之展積内減至步冪為實二之至步為從九分六釐虛常法開平方得三步半即水占斜也",
        "meaning": "義曰今將水占斜直命為小方池靣也",
        "procedure_index": 22,
        "id": "益古演段_1_#22"
    }
]