"""
今有粟七斗，三人分舂之，一人為糲米，一人為粺米，一人為鑿米，令米數等。問︰取粟為米各幾何？
術曰：列置糲米三十，粺米二十七，鑿米二十四，而反衰之，副并為法。以七斗乘未并者，各自為取粟實。實如法得一斗。若求米等者，以本率各乘定所取粟為實，以粟率五十為法，實如法得一斗。
荅曰：糲米取粟 a斗 。粺米取粟 b斗 。鑿米取粟 c斗 。為米各 d斗 。
"""

"""

"""


from fractions import Fraction

# 粟七斗
粟 = 7

# 列置糲米三十，粺米二十七，鑿米二十四
糲米率 = 30
粺米率 = 27
鑿米率 = 24

# 反衰之
反糲米率 = Fraction(1, 糲米率)
反粺米率 = Fraction(1, 粺米率)
反鑿米率 = Fraction(1, 鑿米率)

# 副并為法
法 = 反糲米率 + 反粺米率 + 反鑿米率

# 以七斗乘未并者，各自為取粟實
糲米取粟實 = Fraction(粟, 法) * 反糲米率
粺米取粟實 = Fraction(粟, 法) * 反粺米率
鑿米取粟實 = Fraction(粟, 法) * 反鑿米率

# 若求米等者，以本率各乘定所取粟為實
糲米實 = 糲米率 * 糲米取粟實
粺米實 = 粺米率 * 粺米取粟實
鑿米實 = 鑿米率 * 鑿米取粟實

# 以粟率五十為法
粟率 = 50

# 實如法得一斗
糲米得米 = Fraction(糲米實, 粟率)
粺米得米 = Fraction(粺米實, 粟率)
鑿米得米 = Fraction(鑿米實, 粟率)

# 答案
a = 糲米取粟實
b = 粺米取粟實
c = 鑿米取粟實
d = 糲米得米
e = 粺米得米
f = 鑿米得米


"""

"""


"""
"""
