"""
今有邑方十里，各中開門。甲乙俱從邑中央而出。乙東出；甲南出，出門不知步數，邪向東北磨邑，適與乙會。率甲行五，乙行三。問︰甲、乙行各幾何？
術曰：令五自乘，三亦自乘，并而半之，為邪行率。邪行率減於五自乘者，餘，為南行率。以三乘五，為乙東行率。置邑方半之，以南行率乘之，如東行率而一，即得出南門步數。以增邑方半，即南行。置南行步求弦者，以邪行率乘之，求東者以東行率乘之，各自為實。實如南行率得一步。
荅曰：甲出南門 a步 ，邪東北行 b步 ，及乙。乙東行 c步 。
"""

"""

"""

#----- content starts here -----

from fractions import Fraction

# 令甲行五，乙行三
甲行率 = 5
乙行率 = 3

# 令五自乘，三亦自乘
甲行平方 = 甲行率 ** 2
乙行平方 = 乙行率 ** 2

# 并而半之，為邪行率
邪行率 = Fraction(甲行平方 +乙行平方, 2)

# 邪行率減於五自乘者，餘，為南行率
南行率 = 邪行率 - 甲行平方

# 以三乘五，為乙東行率
乙東行率 = 乙行率 * 甲行率

# 置邑方半之
邑方半 = Fraction(10, 2)

# 以南行率乘之，如東行率而一，即得出南門步數
南行步數 = Fraction(邑方半 * 南行率, 乙東行率)

# 以增邑方半，即南行
南行 = 南行步數 + 邑方半

# 置南行步求弦者，以邪行率乘之
邪行 = 南行 * 邪行率

# 求東者以東行率乘之
乙東行 = 南行 * 乙東行率

# 各自為實。實如南行率得一步
a = 南行
b = Fraction(邪行, 南行率)
c = Fraction(乙東行, 南行率)
#----- content ends here -----


"""

"""


"""
Variable 'a' has wrong value. Expected: 800, Actual: 7/3
Variable 'b' has wrong value. Expected: 9775/2, Actual: -119/24
Variable 'c' has wrong value. Expected: 8625/2, Actual: -35/8"""
