"""
今有甲乙丙三人持錢，甲語乙丙：各將公等所持錢半以益我錢成九十。乙復語甲丙：各將公等所持錢，半以益我，錢成七十。丙復語甲乙：各將公等所持錢，半以益我，錢成五十六。問：三人元持錢各若干？
術曰：先置三人所語為位，以三乘之，各為積，甲得二百七十，乙得二百一十，丙得八十四，又置甲九十，乙七十，丙五十六，各半之，以甲乙減丙，以甲丙減乙，以乙丙減甲，即各得元數。
答曰：甲 a ，乙 b ，丙 c 。
"""

"""

"""

#----- content starts here -----

from fractions import Fraction

# 甲語乙丙：各將公等所持錢半以益我錢成九十
甲語 = 90

# 乙語甲丙：各將公等所持錢半以益我錢成七十
乙語 = 70

# 丙語甲乙：各將公等所持錢半以益我錢成五十六
丙語 = 56

# 先置三人所語為位，以三乘之，各為積
甲積 = 3 * 甲語
乙積 = 3 *乙語
丙積 = 3 *丙語

#甲得二百70#----- content ends here -----


"""

"""


"""
Missing variable in output: 'a'
Missing variable in output: 'b'
Missing variable in output: 'c'"""
