#今有上禾三秉中禾二秉下禾一秉實三十九斗上禾二秉中禾三秉下禾一秉實三十四斗上禾一秉中禾二秉下禾三秉實二十六斗問上中下禾實一秉各幾何
#方程術曰置上禾三秉中禾二秉下禾一秉實三十九斗於右方中左禾列如右方以右行上禾徧乘中行而以直除又乘其次亦以直除然以中行中禾不盡者徧乘左行而以直除左方下禾不盡者上爲法下爲實實卽下禾之實求中禾以法乗中行下實而除下禾之實餘如中禾秉數而一即中禾之實求上禾亦以法乘右行下實而除下禾中禾之實餘如上禾秉數而一即上禾之實實皆如法各得一
#荅曰上禾 a 秉 b斗 中禾 c 秉 d斗 下禾 e 秉 f斗

from fractions import Fraction

# 置上禾三秉中禾二秉下禾一秉實三十九斗於右方
右 = [3, 2, 1, 39]

# 中左禾列如右方
中 = [2, 3, 1, 34]
左 = [1, 2, 3, 26]

# 以右行上禾徧乘中行
中 = [右[0] * i for i in 中] 

# 而以直除
中 = [i - (中[0] // 右[0]) * j for i, j in zip(中, 右)]

# 又乘其次
左 = [右[0] * i for i in 左]

# 亦以直除
左 = [i - (左[0] // 右[0]) * j for i, j in zip(左, 右)]

# 以中行中禾不盡者徧乘左行
左 = [中[1] * i for i in 左]

# 而以直除
左 = [i - (左[1] // 中[1]) * j for i, j in zip(左, 中)]

# 左方下禾不盡者上爲法
法 = 左[2]

# 下爲實實卽下禾之實
下禾之實 = 左[3]

# 以法乗中行下實
中[3] *= 法

# 除下禾之實
中[3] -= 下禾之實

# 餘如中禾秉數而一即中禾之實
中禾之實 = 中[3] // 中[1] 

# 以法乘右行下實
右[3] *= 法

# 除下禾中禾之實
右[3] -= 右[1] * 中禾之實
右[3] -= 下禾之實

# 餘如上禾秉數而一即上禾之實
上禾之實 = 右[3] // 右[0] 

# 實皆如法各得一
a = 1
b = Fraction(上禾之實, 法)
c = 1
d = Fraction(中禾之實, 法)
e = 1
f = Fraction(下禾之實, 法)
