#今有積五萬五千二百二十五步問爲方幾何
#開方術曰置積爲實借一算步之超一等議所得以一乘所借一算爲法而以除除已倍法爲定法其復除折法而下復置借算步之如初以復議一乘之所得副以加定法以除以所得副從定法復除折下如前若開之不盡者爲不可開當以面命之若實有分者通分內子爲定實乃開之訖開其母報除若母不可開者又以母再乘定實乃開之訖令如母而一
#荅曰 a步

# 積五萬五千二百二十五步
積 = 55225

# 置積爲實
實 = 積

# 借一算
所借一算 = 1

# 步之超一等
所借一算_position = 0
while 所借一算 * 10 ** (所借一算_position + 2) <= 實:
	所借一算_position += 2
所借一算 = 所借一算 * 10 ** 所借一算_position

# 議
議所得 = 1
while (議所得 + 1) * (議所得 + 1) * 所借一算 <= 實:
	議所得 += 1

a = 議所得

# 以一乘所借一算爲法
法 = 議所得 * 所借一算

# 以除
實 -= 議所得 * 法

# 倍法爲定法
定法 = 2 * 法

# 其復除
while 所借一算_position >= 2:
	# 折法而下
	定法 //= 10
	
	# 借算
	所借一算 = 1
	
	# 步之如初
	所借一算_position -= 2
	所借一算 = 所借一算 * 10 ** 所借一算_position
	
	# 復議
	復議 = 0
	while (復議 + 1) * (定法 + (復議 + 1) * 所借一算) <= 實:
		復議 += 1
	
	a = 10 * a + 復議
	
	# 以復議一乘之
	x = 所借一算 * 復議
	
	# 所得副以加定法
	副 = x
	定法 += x
	
	# 以除
	實 -= 復議 * 定法
	
	# 以所得副從定法
	定法 += 副
